tangbaishu/Personal/MDK-ARM/Out/STM32F407ZGT6_Embedded_V1.asm

========================================================================

** ELF Header Information

    File Name: H:\Personal_Project_V1.0\Working_Area\Personal_Project\STM32\STM32F407\STM32F407ZGT6_Embedded_Boot_V1.0\MDK-ARM\Out\STM32F407ZGT6_Embedded_V1.0

    Machine class: ELFCLASS32 (32-bit)
    Data encoding: ELFDATA2LSB (Little endian)
    Header version: EV_CURRENT (Current version)
    Operating System ABI: none
    ABI Version: 0
    File Type: ET_EXEC (Executable) (2)
    Machine: EM_ARM (ARM)

    Image Entry point: 0x08000189
    Flags: EF_ARM_HASENTRY (0x05000002)

    ARM ELF revision: 5 (ABI version 2)

    Conforms to Base float procedure-call standard

    Built with
    Component: ARM Compiler 5.06 update 7 (build 960) Tool: armasm [4d35fa]
    Component: ARM Compiler 5.06 update 7 (build 960) Tool: armlink [4d3601]

    Header size: 52 bytes (0x34)
    Program header entry size: 32 bytes (0x20)
    Section header entry size: 40 bytes (0x28)

    Program header entries: 1
    Section header entries: 16

    Program header offset: 1172432 (0x0011e3d0)
    Section header offset: 1172464 (0x0011e3f0)

    Section header string table index: 15

========================================================================

** Program header #0 (PT_LOAD) [PF_X + PF_W + PF_R + PF_ARM_ENTRY]
    Size : 17836 bytes (13052 bytes in file)
    Virtual address: 0x08000000 (Alignment 8)


========================================================================

** Section #1 'ER_IROM1' (SHT_PROGBITS) [SHF_ALLOC + SHF_EXECINSTR]
    Size   : 13004 bytes (alignment 4)
    Address: 0x08000000

    $d.realdata
    RESET
    __Vectors
        0x08000000:    200012e0    ...     DCD    536875744
        0x08000004:    080001a1    ....    DCD    134218145
        0x08000008:    08001fe3    ....    DCD    134225891
        0x0800000c:    08001ed9    ....    DCD    134225625
        0x08000010:    08001fe1    ....    DCD    134225889
        0x08000014:    08000767    g...    DCD    134219623
        0x08000018:    08002789    .'..    DCD    134227849
        0x0800001c:    00000000    ....    DCD    0
        0x08000020:    00000000    ....    DCD    0
        0x08000024:    00000000    ....    DCD    0
        0x08000028:    00000000    ....    DCD    0
        0x0800002c:    08001fe7    ....    DCD    134225895
        0x08000030:    08000bf1    ....    DCD    134220785
        0x08000034:    00000000    ....    DCD    0
        0x08000038:    08001fe5    ....    DCD    134225893
        0x0800003c:    08001fe9    ....    DCD    134225897
        0x08000040:    080001bb    ....    DCD    134218171
        0x08000044:    080001bb    ....    DCD    134218171
        0x08000048:    080001bb    ....    DCD    134218171
        0x0800004c:    080001bb    ....    DCD    134218171
        0x08000050:    080001bb    ....    DCD    134218171
        0x08000054:    080001bb    ....    DCD    134218171
        0x08000058:    080001bb    ....    DCD    134218171
        0x0800005c:    080001bb    ....    DCD    134218171
        0x08000060:    080001bb    ....    DCD    134218171
        0x08000064:    080001bb    ....    DCD    134218171
        0x08000068:    080001bb    ....    DCD    134218171
        0x0800006c:    080001bb    ....    DCD    134218171
        0x08000070:    08000769    i...    DCD    134219625
        0x08000074:    080001bb    ....    DCD    134218171
        0x08000078:    0800079d    ....    DCD    134219677
        0x0800007c:    080001bb    ....    DCD    134218171
        0x08000080:    080001bb    ....    DCD    134218171
        0x08000084:    080001bb    ....    DCD    134218171
        0x08000088:    080001bb    ....    DCD    134218171
        0x0800008c:    080001bb    ....    DCD    134218171
        0x08000090:    080001bb    ....    DCD    134218171
        0x08000094:    080001bb    ....    DCD    134218171
        0x08000098:    080001bb    ....    DCD    134218171
        0x0800009c:    080001bb    ....    DCD    134218171
        0x080000a0:    080001bb    ....    DCD    134218171
        0x080000a4:    080001bb    ....    DCD    134218171
        0x080000a8:    080001bb    ....    DCD    134218171
        0x080000ac:    080001bb    ....    DCD    134218171
        0x080000b0:    080001bb    ....    DCD    134218171
        0x080000b4:    080001bb    ....    DCD    134218171
        0x080000b8:    080001bb    ....    DCD    134218171
        0x080000bc:    080001bb    ....    DCD    134218171
        0x080000c0:    080001bb    ....    DCD    134218171
        0x080000c4:    080001bb    ....    DCD    134218171
        0x080000c8:    080001bb    ....    DCD    134218171
        0x080000cc:    080001bb    ....    DCD    134218171
        0x080000d0:    080001bb    ....    DCD    134218171
        0x080000d4:    080026e5    .&..    DCD    134227685
        0x080000d8:    080001bb    ....    DCD    134218171
        0x080000dc:    08002769    i'..    DCD    134227817
        0x080000e0:    080001bb    ....    DCD    134218171
        0x080000e4:    080001bb    ....    DCD    134218171
        0x080000e8:    080001bb    ....    DCD    134218171
        0x080000ec:    080001bb    ....    DCD    134218171
        0x080000f0:    080001bb    ....    DCD    134218171
        0x080000f4:    080001bb    ....    DCD    134218171
        0x080000f8:    080001bb    ....    DCD    134218171
        0x080000fc:    080001bb    ....    DCD    134218171
        0x08000100:    080001bb    ....    DCD    134218171
        0x08000104:    080001bb    ....    DCD    134218171
        0x08000108:    080001bb    ....    DCD    134218171
        0x0800010c:    080001bb    ....    DCD    134218171
        0x08000110:    080001bb    ....    DCD    134218171
        0x08000114:    080001bb    ....    DCD    134218171
        0x08000118:    080001bb    ....    DCD    134218171
        0x0800011c:    080020a9    . ..    DCD    134226089
        0x08000120:    080001bb    ....    DCD    134218171
        0x08000124:    080001bb    ....    DCD    134218171
        0x08000128:    080001bb    ....    DCD    134218171
        0x0800012c:    080001bb    ....    DCD    134218171
        0x08000130:    080001bb    ....    DCD    134218171
        0x08000134:    08000bf5    ....    DCD    134220789
        0x08000138:    08000c01    ....    DCD    134220801
        0x0800013c:    080001bb    ....    DCD    134218171
        0x08000140:    080001bb    ....    DCD    134218171
        0x08000144:    080001bb    ....    DCD    134218171
        0x08000148:    080001bb    ....    DCD    134218171
        0x0800014c:    080001bb    ....    DCD    134218171
        0x08000150:    080007a9    ....    DCD    134219689
        0x08000154:    080001bb    ....    DCD    134218171
        0x08000158:    080007c5    ....    DCD    134219717
        0x0800015c:    080001bb    ....    DCD    134218171
        0x08000160:    080001bb    ....    DCD    134218171
        0x08000164:    080001bb    ....    DCD    134218171
        0x08000168:    080001bb    ....    DCD    134218171
        0x0800016c:    080001bb    ....    DCD    134218171
        0x08000170:    080001bb    ....    DCD    134218171
        0x08000174:    080001bb    ....    DCD    134218171
        0x08000178:    080001bb    ....    DCD    134218171
        0x0800017c:    00000000    ....    DCD    0
        0x08000180:    080001bb    ....    DCD    134218171
        0x08000184:    080001bb    ....    DCD    134218171
    $t
    .ARM.Collect$$$$00000000
    .ARM.Collect$$$$00000001
    __Vectors_End
    __main
    _main_stk
        0x08000188:    f8dfd010    ....    LDR      sp,__lit__00000000 ; [0x800019c] = 0x200012e0
    .ARM.Collect$$$$00000004
    _main_scatterload
        0x0800018c:    f000fa6a    ..j.    BL       __scatterload ; 0x8000664
    .ARM.Collect$$$$00000008
    .ARM.Collect$$$$0000000A
    .ARM.Collect$$$$0000000B
    __main_after_scatterload
    _main_clock
    _main_cpp_init
    _main_init
        0x08000190:    4800        .H      LDR      r0,[pc,#0] ; [0x8000194] = 0x80030d5
        0x08000192:    4700        .G      BX       r0
    $d
        0x08000194:    080030d5    .0..    DCD    134230229
    $t
    .ARM.Collect$$$$0000000E
    __rt_lib_shutdown_fini
        0x08000198:    f3af8000    ....    NOP.W    
    $d
    .ARM.Collect$$$$00002712
    __lit__00000000
    .ARM.Collect$$$$0000000F
    .ARM.Collect$$$$00000011
    __rt_final_cpp
    __rt_final_exit
        0x0800019c:    200012e0    ...     DCD    536875744
    $t
    .text
    $v0
    Reset_Handler
        0x080001a0:    4806        .H      LDR      r0,[pc,#24] ; [0x80001bc] = 0x800208d
        0x080001a2:    4780        .G      BLX      r0
        0x080001a4:    4806        .H      LDR      r0,[pc,#24] ; [0x80001c0] = 0x8000189
        0x080001a6:    4700        .G      BX       r0
        0x080001a8:    e7fe        ..      B        0x80001a8 ; Reset_Handler + 8
        0x080001aa:    e7fe        ..      B        0x80001aa ; Reset_Handler + 10
        0x080001ac:    e7fe        ..      B        0x80001ac ; Reset_Handler + 12
        0x080001ae:    e7fe        ..      B        0x80001ae ; Reset_Handler + 14
        0x080001b0:    e7fe        ..      B        0x80001b0 ; Reset_Handler + 16
        0x080001b2:    e7fe        ..      B        0x80001b2 ; Reset_Handler + 18
        0x080001b4:    e7fe        ..      B        0x80001b4 ; Reset_Handler + 20
        0x080001b6:    e7fe        ..      B        0x80001b6 ; Reset_Handler + 22
        0x080001b8:    e7fe        ..      B        0x80001b8 ; Reset_Handler + 24
    ADC_IRQHandler
    CAN1_RX0_IRQHandler
    CAN1_RX1_IRQHandler
    CAN1_SCE_IRQHandler
    CAN1_TX_IRQHandler
    CAN2_RX0_IRQHandler
    CAN2_RX1_IRQHandler
    CAN2_SCE_IRQHandler
    CAN2_TX_IRQHandler
    DCMI_IRQHandler
    DMA1_Stream0_IRQHandler
    DMA1_Stream2_IRQHandler
    DMA1_Stream4_IRQHandler
    DMA1_Stream5_IRQHandler
    DMA1_Stream6_IRQHandler
    DMA1_Stream7_IRQHandler
    DMA2_Stream0_IRQHandler
    DMA2_Stream1_IRQHandler
    DMA2_Stream2_IRQHandler
    DMA2_Stream3_IRQHandler
    DMA2_Stream4_IRQHandler
    DMA2_Stream6_IRQHandler
    EXTI0_IRQHandler
    EXTI15_10_IRQHandler
    EXTI1_IRQHandler
    EXTI2_IRQHandler
    EXTI3_IRQHandler
    EXTI4_IRQHandler
    EXTI9_5_IRQHandler
    FLASH_IRQHandler
    FMC_IRQHandler
    FPU_IRQHandler
    HASH_RNG_IRQHandler
    I2C1_ER_IRQHandler
    I2C1_EV_IRQHandler
    I2C2_ER_IRQHandler
    I2C2_EV_IRQHandler
    I2C3_ER_IRQHandler
    I2C3_EV_IRQHandler
    OTG_FS_IRQHandler
    OTG_FS_WKUP_IRQHandler
    OTG_HS_EP1_IN_IRQHandler
    OTG_HS_EP1_OUT_IRQHandler
    OTG_HS_IRQHandler
    OTG_HS_WKUP_IRQHandler
    PVD_IRQHandler
    RCC_IRQHandler
    RTC_Alarm_IRQHandler
    RTC_WKUP_IRQHandler
    SDIO_IRQHandler
    SPI1_IRQHandler
    SPI2_IRQHandler
    SPI3_IRQHandler
    TAMP_STAMP_IRQHandler
    TIM1_BRK_TIM9_IRQHandler
    TIM1_CC_IRQHandler
    TIM1_TRG_COM_TIM11_IRQHandler
    TIM1_UP_TIM10_IRQHandler
    TIM2_IRQHandler
    TIM3_IRQHandler
    TIM4_IRQHandler
    TIM5_IRQHandler
    TIM6_DAC_IRQHandler
    TIM8_BRK_TIM12_IRQHandler
    TIM8_CC_IRQHandler
    TIM8_TRG_COM_TIM14_IRQHandler
    TIM8_UP_TIM13_IRQHandler
    UART4_IRQHandler
    UART5_IRQHandler
    USART2_IRQHandler
    USART6_IRQHandler
    WWDG_IRQHandler
        0x080001ba:    e7fe        ..      B        ADC_IRQHandler ; 0x80001ba
    $d
        0x080001bc:    0800208d    . ..    DCD    134226061
        0x080001c0:    08000189    ....    DCD    134218121
    $t
    .text
    __aeabi_uldivmod
        0x080001c4:    e92d5ff0    -.._    PUSH     {r4-r12,lr}
        0x080001c8:    4605        .F      MOV      r5,r0
        0x080001ca:    2000        .       MOVS     r0,#0
        0x080001cc:    4692        .F      MOV      r10,r2
        0x080001ce:    469b        .F      MOV      r11,r3
        0x080001d0:    4688        .F      MOV      r8,r1
        0x080001d2:    4606        .F      MOV      r6,r0
        0x080001d4:    4681        .F      MOV      r9,r0
        0x080001d6:    2440        @$      MOVS     r4,#0x40
        0x080001d8:    e01b        ..      B        0x8000212 ; __aeabi_uldivmod + 78
        0x080001da:    4628        (F      MOV      r0,r5
        0x080001dc:    4641        AF      MOV      r1,r8
        0x080001de:    4647        GF      MOV      r7,r8
        0x080001e0:    4622        "F      MOV      r2,r4
        0x080001e2:    f000f820    .. .    BL       __aeabi_llsr ; 0x8000226
        0x080001e6:    4653        SF      MOV      r3,r10
        0x080001e8:    465a        ZF      MOV      r2,r11
        0x080001ea:    1ac0        ..      SUBS     r0,r0,r3
        0x080001ec:    4191        .A      SBCS     r1,r1,r2
        0x080001ee:    d310        ..      BCC      0x8000212 ; __aeabi_uldivmod + 78
        0x080001f0:    4611        .F      MOV      r1,r2
        0x080001f2:    4618        .F      MOV      r0,r3
        0x080001f4:    4622        "F      MOV      r2,r4
        0x080001f6:    f000f86e    ..n.    BL       __aeabi_llsl ; 0x80002d6
        0x080001fa:    1a2d        -.      SUBS     r5,r5,r0
        0x080001fc:    eb670801    g...    SBC      r8,r7,r1
        0x08000200:    464f        OF      MOV      r7,r9
        0x08000202:    4622        "F      MOV      r2,r4
        0x08000204:    2001        .       MOVS     r0,#1
        0x08000206:    2100        .!      MOVS     r1,#0
        0x08000208:    f000f865    ..e.    BL       __aeabi_llsl ; 0x80002d6
        0x0800020c:    eb170900    ....    ADDS     r9,r7,r0
        0x08000210:    414e        NA      ADCS     r6,r6,r1
        0x08000212:    1e20         .      SUBS     r0,r4,#0
        0x08000214:    f1a40401    ....    SUB      r4,r4,#1
        0x08000218:    dcdf        ..      BGT      0x80001da ; __aeabi_uldivmod + 22
        0x0800021a:    4648        HF      MOV      r0,r9
        0x0800021c:    4631        1F      MOV      r1,r6
        0x0800021e:    462a        *F      MOV      r2,r5
        0x08000220:    4643        CF      MOV      r3,r8
        0x08000222:    e8bd9ff0    ....    POP      {r4-r12,pc}
    .text
    __aeabi_llsr
    _ll_ushift_r
        0x08000226:    2a20         *      CMP      r2,#0x20
        0x08000228:    db04        ..      BLT      0x8000234 ; __aeabi_llsr + 14
        0x0800022a:    3a20         :      SUBS     r2,r2,#0x20
        0x0800022c:    fa21f002    !...    LSR      r0,r1,r2
        0x08000230:    2100        .!      MOVS     r1,#0
        0x08000232:    4770        pG      BX       lr
        0x08000234:    fa21f302    !...    LSR      r3,r1,r2
        0x08000238:    40d0        .@      LSRS     r0,r0,r2
        0x0800023a:    f1c20220    .. .    RSB      r2,r2,#0x20
        0x0800023e:    4091        .@      LSLS     r1,r1,r2
        0x08000240:    4308        .C      ORRS     r0,r0,r1
        0x08000242:    4619        .F      MOV      r1,r3
        0x08000244:    4770        pG      BX       lr
    .text
    ___aeabi_memcpy8$move
    __aeabi_memcpy
    __aeabi_memcpy4
    __aeabi_memmove
    __aeabi_memmove4
    __aeabi_memmove8
        0x08000246:    b510        ..      PUSH     {r4,lr}
        0x08000248:    1a43        C.      SUBS     r3,r0,r1
        0x0800024a:    4293        .B      CMP      r3,r2
        0x0800024c:    d209        ..      BCS      0x8000262 ; ___aeabi_memcpy8$move + 28
        0x0800024e:    1883        ..      ADDS     r3,r0,r2
        0x08000250:    1888        ..      ADDS     r0,r1,r2
        0x08000252:    e003        ..      B        0x800025c ; ___aeabi_memcpy8$move + 22
        0x08000254:    f8101d01    ....    LDRB     r1,[r0,#-1]!
        0x08000258:    f8031d01    ....    STRB     r1,[r3,#-1]!
        0x0800025c:    1e52        R.      SUBS     r2,r2,#1
        0x0800025e:    d2f9        ..      BCS      0x8000254 ; ___aeabi_memcpy8$move + 14
        0x08000260:    bd10        ..      POP      {r4,pc}
        0x08000262:    ea400301    @...    ORR      r3,r0,r1
        0x08000266:    079b        ..      LSLS     r3,r3,#30
        0x08000268:    d003        ..      BEQ      0x8000272 ; ___aeabi_memcpy8$move + 44
        0x0800026a:    e009        ..      B        0x8000280 ; ___aeabi_memcpy8$move + 58
        0x0800026c:    c908        ..      LDM      r1!,{r3}
        0x0800026e:    1f12        ..      SUBS     r2,r2,#4
        0x08000270:    c008        ..      STM      r0!,{r3}
        0x08000272:    2a04        .*      CMP      r2,#4
        0x08000274:    d2fa        ..      BCS      0x800026c ; ___aeabi_memcpy8$move + 38
        0x08000276:    e003        ..      B        0x8000280 ; ___aeabi_memcpy8$move + 58
        0x08000278:    f8113b01    ...;    LDRB     r3,[r1],#1
        0x0800027c:    f8003b01    ...;    STRB     r3,[r0],#1
        0x08000280:    1e52        R.      SUBS     r2,r2,#1
        0x08000282:    d2f9        ..      BCS      0x8000278 ; ___aeabi_memcpy8$move + 50
        0x08000284:    bd10        ..      POP      {r4,pc}
    .text
    __aeabi_memset
    __aeabi_memset4
    __aeabi_memset8
        0x08000286:    b2d2        ..      UXTB     r2,r2
        0x08000288:    e001        ..      B        0x800028e ; __aeabi_memset + 8
        0x0800028a:    f8002b01    ...+    STRB     r2,[r0],#1
        0x0800028e:    1e49        I.      SUBS     r1,r1,#1
        0x08000290:    d2fb        ..      BCS      0x800028a ; __aeabi_memset + 4
        0x08000292:    4770        pG      BX       lr
    __aeabi_memclr
    __aeabi_memclr4
    __aeabi_memclr8
        0x08000294:    2200        ."      MOVS     r2,#0
        0x08000296:    e7f6        ..      B        __aeabi_memset ; 0x8000286
    _memset$wrapper
        0x08000298:    b510        ..      PUSH     {r4,lr}
        0x0800029a:    4613        .F      MOV      r3,r2
        0x0800029c:    460a        .F      MOV      r2,r1
        0x0800029e:    4604        .F      MOV      r4,r0
        0x080002a0:    4619        .F      MOV      r1,r3
        0x080002a2:    f7fffff0    ....    BL       __aeabi_memset ; 0x8000286
        0x080002a6:    4620         F      MOV      r0,r4
        0x080002a8:    bd10        ..      POP      {r4,pc}
    .text
    __aeabi_uidiv
    __aeabi_uidivmod
        0x080002aa:    b530        0.      PUSH     {r4,r5,lr}
        0x080002ac:    460b        .F      MOV      r3,r1
        0x080002ae:    4601        .F      MOV      r1,r0
        0x080002b0:    2000        .       MOVS     r0,#0
        0x080002b2:    2220         "      MOVS     r2,#0x20
        0x080002b4:    2401        .$      MOVS     r4,#1
        0x080002b6:    e009        ..      B        0x80002cc ; __aeabi_uidiv + 34
        0x080002b8:    fa21f502    !...    LSR      r5,r1,r2
        0x080002bc:    429d        .B      CMP      r5,r3
        0x080002be:    d305        ..      BCC      0x80002cc ; __aeabi_uidiv + 34
        0x080002c0:    fa03f502    ....    LSL      r5,r3,r2
        0x080002c4:    1b49        I.      SUBS     r1,r1,r5
        0x080002c6:    fa04f502    ....    LSL      r5,r4,r2
        0x080002ca:    4428        (D      ADD      r0,r0,r5
        0x080002cc:    1e15        ..      SUBS     r5,r2,#0
        0x080002ce:    f1a20201    ....    SUB      r2,r2,#1
        0x080002d2:    dcf1        ..      BGT      0x80002b8 ; __aeabi_uidiv + 14
        0x080002d4:    bd30        0.      POP      {r4,r5,pc}
    .text
    __aeabi_llsl
    _ll_shift_l
        0x080002d6:    2a20         *      CMP      r2,#0x20
        0x080002d8:    db04        ..      BLT      0x80002e4 ; __aeabi_llsl + 14
        0x080002da:    3a20         :      SUBS     r2,r2,#0x20
        0x080002dc:    fa00f102    ....    LSL      r1,r0,r2
        0x080002e0:    2000        .       MOVS     r0,#0
        0x080002e2:    4770        pG      BX       lr
        0x080002e4:    4091        .@      LSLS     r1,r1,r2
        0x080002e6:    f1c20320    .. .    RSB      r3,r2,#0x20
        0x080002ea:    fa20f303     ...    LSR      r3,r0,r3
        0x080002ee:    4319        .C      ORRS     r1,r1,r3
        0x080002f0:    4090        .@      LSLS     r0,r0,r2
        0x080002f2:    4770        pG      BX       lr
    .text
    .text
    __I$use$fp
    __aeabi_dadd
        0x080002f4:    e92d4ffe    -..O    PUSH     {r1-r11,lr}
        0x080002f8:    4680        .F      MOV      r8,r0
        0x080002fa:    ea810003    ....    EOR      r0,r1,r3
        0x080002fe:    0fc0        ..      LSRS     r0,r0,#31
        0x08000300:    460c        .F      MOV      r4,r1
        0x08000302:    9000        ..      STR      r0,[sp,#0]
        0x08000304:    f0214100    !..A    BIC      r1,r1,#0x80000000
        0x08000308:    f0234500    #..E    BIC      r5,r3,#0x80000000
        0x0800030c:    ebb80002    ....    SUBS     r0,r8,r2
        0x08000310:    41a9        .A      SBCS     r1,r1,r5
        0x08000312:    d205        ..      BCS      0x8000320 ; __I$use$fp + 44
        0x08000314:    4640        @F      MOV      r0,r8
        0x08000316:    4621        !F      MOV      r1,r4
        0x08000318:    4690        .F      MOV      r8,r2
        0x0800031a:    461c        .F      MOV      r4,r3
        0x0800031c:    460b        .F      MOV      r3,r1
        0x0800031e:    4602        .F      MOV      r2,r0
        0x08000320:    f0234000    #..@    BIC      r0,r3,#0x80000000
        0x08000324:    4310        .C      ORRS     r0,r0,r2
        0x08000326:    d047        G.      BEQ      0x80003b8 ; __I$use$fp + 196
        0x08000328:    0d27        '.      LSRS     r7,r4,#20
        0x0800032a:    f3c7000a    ....    UBFX     r0,r7,#0,#11
        0x0800032e:    f3c3510a    ...Q    UBFX     r1,r3,#20,#11
        0x08000332:    9002        ..      STR      r0,[sp,#8]
        0x08000334:    1a40        @.      SUBS     r0,r0,r1
        0x08000336:    9001        ..      STR      r0,[sp,#4]
        0x08000338:    2840        @(      CMP      r0,#0x40
        0x0800033a:    da6b        k.      BGE      0x8000414 ; __I$use$fp + 288
        0x0800033c:    f3c30013    ....    UBFX     r0,r3,#0,#20
        0x08000340:    f4401b80    @...    ORR      r11,r0,#0x100000
        0x08000344:    9800        ..      LDR      r0,[sp,#0]
        0x08000346:    4692        .F      MOV      r10,r2
        0x08000348:    b120         .      CBZ      r0,0x8000354 ; __I$use$fp + 96
        0x0800034a:    2300        .#      MOVS     r3,#0
        0x0800034c:    ebd20a03    ....    RSBS     r10,r2,r3
        0x08000350:    eb630b0b    c...    SBC      r11,r3,r11
        0x08000354:    9801        ..      LDR      r0,[sp,#4]
        0x08000356:    4659        YF      MOV      r1,r11
        0x08000358:    f1c00240    ..@.    RSB      r2,r0,#0x40
        0x0800035c:    4650        PF      MOV      r0,r10
        0x0800035e:    f7ffffba    ....    BL       __aeabi_llsl ; 0x80002d6
        0x08000362:    4606        .F      MOV      r6,r0
        0x08000364:    460d        .F      MOV      r5,r1
        0x08000366:    4650        PF      MOV      r0,r10
        0x08000368:    4659        YF      MOV      r1,r11
        0x0800036a:    9a01        ..      LDR      r2,[sp,#4]
        0x0800036c:    f000f98c    ....    BL       __aeabi_lasr ; 0x8000688
        0x08000370:    eb100008    ....    ADDS     r0,r0,r8
        0x08000374:    4161        aA      ADCS     r1,r1,r4
        0x08000376:    2400        .$      MOVS     r4,#0
        0x08000378:    ea875211    ...R    EOR      r2,r7,r1,LSR #20
        0x0800037c:    ea8473e7    ...s    EOR      r3,r4,r7,ASR #31
        0x08000380:    431a        .C      ORRS     r2,r2,r3
        0x08000382:    d040        @.      BEQ      0x8000406 ; __I$use$fp + 274
        0x08000384:    9a00        ..      LDR      r2,[sp,#0]
        0x08000386:    b362        b.      CBZ      r2,0x80003e2 ; __I$use$fp + 238
        0x08000388:    9a01        ..      LDR      r2,[sp,#4]
        0x0800038a:    2a01        .*      CMP      r2,#1
