tangbaishu/Personal/MDK-ARM/Out/STM32F407ZGT6_Embedded_V1.asm
        0x0800038c:    ea4f5207    O..R    LSL      r2,r7,#20
        0x08000390:    dc15        ..      BGT      0x80003be ; __I$use$fp + 202
        0x08000392:    1b00        ..      SUBS     r0,r0,r4
        0x08000394:    eb610102    a...    SBC      r1,r1,r2
        0x08000398:    f04f4200    O..B    MOV      r2,#0x80000000
        0x0800039c:    ea025207    ...R    AND      r2,r2,r7,LSL #20
        0x080003a0:    e9cd4200    ...B    STRD     r4,r2,[sp,#0]
        0x080003a4:    1c00        ..      ADDS     r0,r0,#0
        0x080003a6:    f5411180    A...    ADC      r1,r1,#0x100000
        0x080003aa:    4632        2F      MOV      r2,r6
        0x080003ac:    462b        +F      MOV      r3,r5
        0x080003ae:    f000f98c    ....    BL       _double_epilogue ; 0x80006ca
        0x080003b2:    b003        ..      ADD      sp,sp,#0xc
        0x080003b4:    e8bd8ff0    ....    POP      {r4-r11,pc}
        0x080003b8:    4640        @F      MOV      r0,r8
        0x080003ba:    4621        !F      MOV      r1,r4
        0x080003bc:    e7f9        ..      B        0x80003b2 ; __I$use$fp + 190
        0x080003be:    1b00        ..      SUBS     r0,r0,r4
        0x080003c0:    eb610102    a...    SBC      r1,r1,r2
        0x080003c4:    1c00        ..      ADDS     r0,r0,#0
        0x080003c6:    f5411380    A...    ADC      r3,r1,#0x100000
        0x080003ca:    1800        ..      ADDS     r0,r0,r0
        0x080003cc:    415b        [A      ADCS     r3,r3,r3
        0x080003ce:    1820         .      ADDS     r0,r4,r0
        0x080003d0:    f5a21700    ....    SUB      r7,r2,#0x200000
        0x080003d4:    eb470103    G...    ADC      r1,r7,r3
        0x080003d8:    ea4070d5    @..p    ORR      r0,r0,r5,LSR #31
        0x080003dc:    19b6        ..      ADDS     r6,r6,r6
        0x080003de:    416d        mA      ADCS     r5,r5,r5
        0x080003e0:    e011        ..      B        0x8000406 ; __I$use$fp + 274
        0x080003e2:    086d        m.      LSRS     r5,r5,#1
        0x080003e4:    ea4f0636    O.6.    RRX      r6,r6
        0x080003e8:    ea4575c0    E..u    ORR      r5,r5,r0,LSL #31
        0x080003ec:    ea4f5207    O..R    LSL      r2,r7,#20
        0x080003f0:    1b00        ..      SUBS     r0,r0,r4
        0x080003f2:    eb610102    a...    SBC      r1,r1,r2
        0x080003f6:    1c00        ..      ADDS     r0,r0,#0
        0x080003f8:    f5411180    A...    ADC      r1,r1,#0x100000
        0x080003fc:    0849        I.      LSRS     r1,r1,#1
        0x080003fe:    ea4f0030    O.0.    RRX      r0,r0
        0x08000402:    1900        ..      ADDS     r0,r0,r4
        0x08000404:    4151        QA      ADCS     r1,r1,r2
        0x08000406:    4632        2F      MOV      r2,r6
        0x08000408:    462b        +F      MOV      r3,r5
        0x0800040a:    b003        ..      ADD      sp,sp,#0xc
        0x0800040c:    e8bd4ff0    ...O    POP      {r4-r11,lr}
        0x08000410:    f000b94c    ..L.    B.W      _double_round ; 0x80006ac
        0x08000414:    9800        ..      LDR      r0,[sp,#0]
        0x08000416:    2201        ."      MOVS     r2,#1
        0x08000418:    0040        @.      LSLS     r0,r0,#1
        0x0800041a:    2300        .#      MOVS     r3,#0
        0x0800041c:    ebd00202    ....    RSBS     r2,r0,r2
        0x08000420:    eb6373e0    c..s    SBC      r3,r3,r0,ASR #31
        0x08000424:    9800        ..      LDR      r0,[sp,#0]
        0x08000426:    4621        !F      MOV      r1,r4
        0x08000428:    ea4f74e0    O..t    ASR      r4,r0,#31
        0x0800042c:    ebb80000    ....    SUBS     r0,r8,r0
        0x08000430:    eb610104    a...    SBC      r1,r1,r4
        0x08000434:    e7e9        ..      B        0x800040a ; __I$use$fp + 278
    __aeabi_dsub
        0x08000436:    f0834300    ...C    EOR      r3,r3,#0x80000000
        0x0800043a:    e75b        [.      B        __I$use$fp ; 0x80002f4
    __aeabi_drsub
        0x0800043c:    f0814100    ...A    EOR      r1,r1,#0x80000000
        0x08000440:    e758        X.      B        __I$use$fp ; 0x80002f4
    .text
    __aeabi_dmul
        0x08000442:    e92d4ffe    -..O    PUSH     {r1-r11,lr}
        0x08000446:    ea810403    ....    EOR      r4,r1,r3
        0x0800044a:    f0044400    ...D    AND      r4,r4,#0x80000000
        0x0800044e:    f0214100    !..A    BIC      r1,r1,#0x80000000
        0x08000452:    9400        ..      STR      r4,[sp,#0]
        0x08000454:    f04f0b00    O...    MOV      r11,#0
        0x08000458:    f0234300    #..C    BIC      r3,r3,#0x80000000
        0x0800045c:    ea500401    P...    ORRS     r4,r0,r1
        0x08000460:    d05e        ^.      BEQ      0x8000520 ; __aeabi_dmul + 222
        0x08000462:    ea520403    R...    ORRS     r4,r2,r3
        0x08000466:    d05b        [.      BEQ      0x8000520 ; __aeabi_dmul + 222
        0x08000468:    f3c3540a    ...T    UBFX     r4,r3,#20,#11
        0x0800046c:    f3c1550a    ...U    UBFX     r5,r1,#20,#11
        0x08000470:    442c        ,D      ADD      r4,r4,r5
        0x08000472:    f2a434f3    ...4    SUB      r4,r4,#0x3f3
        0x08000476:    9401        ..      STR      r4,[sp,#4]
        0x08000478:    fba05402    ...T    UMULL    r5,r4,r0,r2
        0x0800047c:    f3c10113    ....    UBFX     r1,r1,#0,#20
        0x08000480:    f4411180    A...    ORR      r1,r1,#0x100000
        0x08000484:    f3c30313    ....    UBFX     r3,r3,#0,#20
        0x08000488:    f4431380    C...    ORR      r3,r3,#0x100000
        0x0800048c:    fb014402    ...D    MLA      r4,r1,r2,r4
        0x08000490:    fb004e03    ...N    MLA      lr,r0,r3,r4
        0x08000494:    0a84        ..      LSRS     r4,r0,#10
        0x08000496:    0a97        ..      LSRS     r7,r2,#10
        0x08000498:    ea445481    D..T    ORR      r4,r4,r1,LSL #22
        0x0800049c:    ea475783    G..W    ORR      r7,r7,r3,LSL #22
        0x080004a0:    fba46807    ...h    UMULL    r6,r8,r4,r7
        0x080004a4:    9502        ..      STR      r5,[sp,#8]
        0x080004a6:    0a8d        ..      LSRS     r5,r1,#10
        0x080004a8:    fb058507    ....    MLA      r5,r5,r7,r8
        0x080004ac:    ea4f2c93    O..,    LSR      r12,r3,#10
        0x080004b0:    fb04540c    ...T    MLA      r4,r4,r12,r5
        0x080004b4:    0527        '.      LSLS     r7,r4,#20
        0x080004b6:    9d02        ..      LDR      r5,[sp,#8]
        0x080004b8:    ea4f5806    O..X    LSL      r8,r6,#20
        0x080004bc:    ea473716    G..7    ORR      r7,r7,r6,LSR #12
        0x080004c0:    ebb50508    ....    SUBS     r5,r5,r8
        0x080004c4:    eb6e0c07    n...    SBC      r12,lr,r7
        0x080004c8:    0e87        ..      LSRS     r7,r0,#26
        0x080004ca:    0e92        ..      LSRS     r2,r2,#26
        0x080004cc:    ea471781    G...    ORR      r7,r7,r1,LSL #6
        0x080004d0:    ea421283    B...    ORR      r2,r2,r3,LSL #6
        0x080004d4:    fba70102    ....    UMULL    r0,r1,r7,r2
        0x080004d8:    ebb6010b    ....    SUBS     r1,r6,r11
        0x080004dc:    eb640400    d...    SBC      r4,r4,r0
        0x080004e0:    0d2b        +.      LSRS     r3,r5,#20
        0x080004e2:    ea43330c    C..3    ORR      r3,r3,r12,LSL #12
        0x080004e6:    185e        ^.      ADDS     r6,r3,r1
        0x080004e8:    eb44501c    D..P    ADC      r0,r4,r12,LSR #20
        0x080004ec:    46da        .F      MOV      r10,r11
        0x080004ee:    4651        QF      MOV      r1,r10
        0x080004f0:    fbe70102    ....    UMLAL    r0,r1,r7,r2
        0x080004f4:    f3c50413    ....    UBFX     r4,r5,#0,#20
        0x080004f8:    ea4f330b    O..3    LSL      r3,r11,#12
        0x080004fc:    ea435314    C..S    ORR      r3,r3,r4,LSR #20
        0x08000500:    ea4f3204    O..2    LSL      r2,r4,#12
        0x08000504:    9c01        ..      LDR      r4,[sp,#4]
        0x08000506:    ea430306    C...    ORR      r3,r3,r6
        0x0800050a:    f1a4040c    ....    SUB      r4,r4,#0xc
        0x0800050e:    9402        ..      STR      r4,[sp,#8]
        0x08000510:    9c00        ..      LDR      r4,[sp,#0]
        0x08000512:    e9cdb400    ....    STRD     r11,r4,[sp,#0]
        0x08000516:    f000f8d8    ....    BL       _double_epilogue ; 0x80006ca
        0x0800051a:    b003        ..      ADD      sp,sp,#0xc
        0x0800051c:    e8bd8ff0    ....    POP      {r4-r11,pc}
        0x08000520:    2000        .       MOVS     r0,#0
        0x08000522:    4601        .F      MOV      r1,r0
        0x08000524:    e7f9        ..      B        0x800051a ; __aeabi_dmul + 216
    .text
    __aeabi_ddiv
        0x08000526:    e92d4df0    -..M    PUSH     {r4-r8,r10,r11,lr}
        0x0800052a:    ea810403    ....    EOR      r4,r1,r3
        0x0800052e:    f0044b00    ...K    AND      r11,r4,#0x80000000
        0x08000532:    f0214500    !..E    BIC      r5,r1,#0x80000000
        0x08000536:    4614        .F      MOV      r4,r2
        0x08000538:    f04f0a00    O...    MOV      r10,#0
        0x0800053c:    f0234100    #..A    BIC      r1,r3,#0x80000000
        0x08000540:    ea500205    P...    ORRS     r2,r0,r5
        0x08000544:    d020         .      BEQ      0x8000588 ; __aeabi_ddiv + 98
        0x08000546:    ea540201    T...    ORRS     r2,r4,r1
        0x0800054a:    d01d        ..      BEQ      0x8000588 ; __aeabi_ddiv + 98
        0x0800054c:    f3c5570a    ...W    UBFX     r7,r5,#20,#11
        0x08000550:    4602        .F      MOV      r2,r0
        0x08000552:    f3c50313    ....    UBFX     r3,r5,#0,#20
        0x08000556:    f3c10013    ....    UBFX     r0,r1,#0,#20
        0x0800055a:    f3c1560a    ...V    UBFX     r6,r1,#20,#11
        0x0800055e:    f4401580    @...    ORR      r5,r0,#0x100000
        0x08000562:    f4431380    C...    ORR      r3,r3,#0x100000
        0x08000566:    eba70806    ....    SUB      r8,r7,r6
        0x0800056a:    1b10        ..      SUBS     r0,r2,r4
        0x0800056c:    46d6        .F      MOV      lr,r10
        0x0800056e:    f20838fd    ...8    ADD      r8,r8,#0x3fd
        0x08000572:    eb730005    s...    SBCS     r0,r3,r5
        0x08000576:    d302        ..      BCC      0x800057e ; __aeabi_ddiv + 88
        0x08000578:    f1080801    ....    ADD      r8,r8,#1
        0x0800057c:    e001        ..      B        0x8000582 ; __aeabi_ddiv + 92
        0x0800057e:    1892        ..      ADDS     r2,r2,r2
        0x08000580:    415b        [A      ADCS     r3,r3,r3
        0x08000582:    f1b80f00    ....    CMP      r8,#0
        0x08000586:    da03        ..      BGE      0x8000590 ; __aeabi_ddiv + 106
        0x08000588:    2000        .       MOVS     r0,#0
        0x0800058a:    4601        .F      MOV      r1,r0
        0x0800058c:    e8bd8df0    ....    POP      {r4-r8,r10,r11,pc}
        0x08000590:    2000        .       MOVS     r0,#0
        0x08000592:    f44f1180    O...    MOV      r1,#0x100000
        0x08000596:    4606        .F      MOV      r6,r0
        0x08000598:    4684        .F      MOV      r12,r0
        0x0800059a:    e00e        ..      B        0x80005ba ; __aeabi_ddiv + 148
        0x0800059c:    1b17        ..      SUBS     r7,r2,r4
        0x0800059e:    eb730705    s...    SBCS     r7,r3,r5
        0x080005a2:    d305        ..      BCC      0x80005b0 ; __aeabi_ddiv + 138
        0x080005a4:    1b12        ..      SUBS     r2,r2,r4
        0x080005a6:    eb630305    c...    SBC      r3,r3,r5
        0x080005aa:    4306        .C      ORRS     r6,r6,r0
        0x080005ac:    ea4c0c01    L...    ORR      r12,r12,r1
        0x080005b0:    0849        I.      LSRS     r1,r1,#1
        0x080005b2:    ea4f0030    O.0.    RRX      r0,r0
        0x080005b6:    1892        ..      ADDS     r2,r2,r2
        0x080005b8:    415b        [A      ADCS     r3,r3,r3
        0x080005ba:    ea500701    P...    ORRS     r7,r0,r1
        0x080005be:    d1ed        ..      BNE      0x800059c ; __aeabi_ddiv + 118
        0x080005c0:    ea520003    R...    ORRS     r0,r2,r3
        0x080005c4:    d012        ..      BEQ      0x80005ec ; __aeabi_ddiv + 198
        0x080005c6:    ea820004    ....    EOR      r0,r2,r4
        0x080005ca:    ea830105    ....    EOR      r1,r3,r5
        0x080005ce:    4308        .C      ORRS     r0,r0,r1
        0x080005d0:    d005        ..      BEQ      0x80005de ; __aeabi_ddiv + 184
        0x080005d2:    1b10        ..      SUBS     r0,r2,r4
        0x080005d4:    41ab        .A      SBCS     r3,r3,r5
        0x080005d6:    d206        ..      BCS      0x80005e6 ; __aeabi_ddiv + 192
        0x080005d8:    2201        ."      MOVS     r2,#1
        0x080005da:    2300        .#      MOVS     r3,#0
        0x080005dc:    e006        ..      B        0x80005ec ; __aeabi_ddiv + 198
        0x080005de:    2200        ."      MOVS     r2,#0
        0x080005e0:    f04f4300    O..C    MOV      r3,#0x80000000
        0x080005e4:    e002        ..      B        0x80005ec ; __aeabi_ddiv + 198
        0x080005e6:    f06f0201    o...    MVN      r2,#1
        0x080005ea:    1053        S.      ASRS     r3,r2,#1
        0x080005ec:    eb1a0006    ....    ADDS     r0,r10,r6
        0x080005f0:    eb4c5108    L..Q    ADC      r1,r12,r8,LSL #20
        0x080005f4:    eb10000a    ....    ADDS     r0,r0,r10
        0x080005f8:    eb41010b    A...    ADC      r1,r1,r11
        0x080005fc:    e8bd4df0    ...M    POP      {r4-r8,r10,r11,lr}
        0x08000600:    f000b854    ..T.    B.W      _double_round ; 0x80006ac
    .text
    __aeabi_d2ulz
        0x08000604:    f3c1520a    ...R    UBFX     r2,r1,#20,#11
        0x08000608:    f3c10113    ....    UBFX     r1,r1,#0,#20
        0x0800060c:    f24033ff    @..3    MOV      r3,#0x3ff
        0x08000610:    f4411180    A...    ORR      r1,r1,#0x100000
        0x08000614:    429a        .B      CMP      r2,r3
        0x08000616:    da02        ..      BGE      0x800061e ; __aeabi_d2ulz + 26
        0x08000618:    2000        .       MOVS     r0,#0
        0x0800061a:    4601        .F      MOV      r1,r0
        0x0800061c:    4770        pG      BX       lr
        0x0800061e:    f2404333    @.3C    MOV      r3,#0x433
        0x08000622:    429a        .B      CMP      r2,r3
        0x08000624:    f2a24233    ..3B    SUB      r2,r2,#0x433
        0x08000628:    dc02        ..      BGT      0x8000630 ; __aeabi_d2ulz + 44
        0x0800062a:    4252        RB      RSBS     r2,r2,#0
        0x0800062c:    f7ffbdfb    ....    B.W      __aeabi_llsr ; 0x8000226
        0x08000630:    f7ffbe51    ..Q.    B.W      __aeabi_llsl ; 0x80002d6
    .text
    __aeabi_cdrcmple
        0x08000634:    b530        0.      PUSH     {r4,r5,lr}
        0x08000636:    1e04        ..      SUBS     r4,r0,#0
        0x08000638:    f1710400    q...    SBCS     r4,r1,#0
        0x0800063c:    db04        ..      BLT      0x8000648 ; __aeabi_cdrcmple + 20
        0x0800063e:    f04f4400    O..D    MOV      r4,#0x80000000
        0x08000642:    4240        @B      RSBS     r0,r0,#0
        0x08000644:    eb640101    d...    SBC      r1,r4,r1
        0x08000648:    1e14        ..      SUBS     r4,r2,#0
        0x0800064a:    f1730400    s...    SBCS     r4,r3,#0
        0x0800064e:    db05        ..      BLT      0x800065c ; __aeabi_cdrcmple + 40
        0x08000650:    461c        .F      MOV      r4,r3
        0x08000652:    f04f4300    O..C    MOV      r3,#0x80000000
        0x08000656:    4252        RB      RSBS     r2,r2,#0
        0x08000658:    eb630304    c...    SBC      r3,r3,r4
        0x0800065c:    4299        .B      CMP      r1,r3
        0x0800065e:    bf08        ..      IT       EQ
        0x08000660:    4290        .B      CMPEQ    r0,r2
        0x08000662:    bd30        0.      POP      {r4,r5,pc}
    .text
    __scatterload
    __scatterload_rt2
        0x08000664:    4c06        .L      LDR      r4,[pc,#24] ; [0x8000680] = 0x80032ac
        0x08000666:    4d07        .M      LDR      r5,[pc,#28] ; [0x8000684] = 0x80032cc
        0x08000668:    e006        ..      B        0x8000678 ; __scatterload + 20
        0x0800066a:    68e0        .h      LDR      r0,[r4,#0xc]
        0x0800066c:    f0400301    @...    ORR      r3,r0,#1
        0x08000670:    e8940007    ....    LDM      r4,{r0-r2}
        0x08000674:    4798        .G      BLX      r3
        0x08000676:    3410        .4      ADDS     r4,r4,#0x10
        0x08000678:    42ac        .B      CMP      r4,r5
        0x0800067a:    d3f6        ..      BCC      0x800066a ; __scatterload + 6
        0x0800067c:    f7fffd88    ....    BL       __main_after_scatterload ; 0x8000190
    $d
        0x08000680:    080032ac    .2..    DCD    134230700
        0x08000684:    080032cc    .2..    DCD    134230732
    $t
    .text
    __aeabi_lasr
    _ll_sshift_r
        0x08000688:    2a20         *      CMP      r2,#0x20
        0x0800068a:    db06        ..      BLT      0x800069a ; __aeabi_lasr + 18
        0x0800068c:    17cb        ..      ASRS     r3,r1,#31
        0x0800068e:    3a20         :      SUBS     r2,r2,#0x20
        0x08000690:    fa41f002    A...    ASR      r0,r1,r2
        0x08000694:    ea4373e0    C..s    ORR      r3,r3,r0,ASR #31
        0x08000698:    e006        ..      B        0x80006a8 ; __aeabi_lasr + 32
        0x0800069a:    fa41f302    A...    ASR      r3,r1,r2
        0x0800069e:    40d0        .@      LSRS     r0,r0,r2
        0x080006a0:    f1c20220    .. .    RSB      r2,r2,#0x20
        0x080006a4:    4091        .@      LSLS     r1,r1,r2
        0x080006a6:    4308        .C      ORRS     r0,r0,r1
        0x080006a8:    4619        .F      MOV      r1,r3
        0x080006aa:    4770        pG      BX       lr
    .text
    _double_round
        0x080006ac:    b510        ..      PUSH     {r4,lr}
        0x080006ae:    1e14        ..      SUBS     r4,r2,#0
        0x080006b0:    f1730400    s...    SBCS     r4,r3,#0
        0x080006b4:    da08        ..      BGE      0x80006c8 ; _double_round + 28
        0x080006b6:    1c40        @.      ADDS     r0,r0,#1
        0x080006b8:    f1410100    A...    ADC      r1,r1,#0
        0x080006bc:    1892        ..      ADDS     r2,r2,r2
        0x080006be:    415b        [A      ADCS     r3,r3,r3
        0x080006c0:    431a        .C      ORRS     r2,r2,r3
        0x080006c2:    d101        ..      BNE      0x80006c8 ; _double_round + 28
        0x080006c4:    f0200001     ...    BIC      r0,r0,#1
        0x080006c8:    bd10        ..      POP      {r4,pc}
    _double_epilogue
        0x080006ca:    e92d4df0    -..M    PUSH     {r4-r8,r10,r11,lr}
        0x080006ce:    4692        .F      MOV      r10,r2
        0x080006d0:    469b        .F      MOV      r11,r3
        0x080006d2:    b111        ..      CBZ      r1,0x80006da ; _double_epilogue + 16
        0x080006d4:    fab1f281    ....    CLZ      r2,r1
        0x080006d8:    e002        ..      B        0x80006e0 ; _double_epilogue + 22
        0x080006da:    fab0f280    ....    CLZ      r2,r0
        0x080006de:    3220         2      ADDS     r2,r2,#0x20
        0x080006e0:    4690        .F      MOV      r8,r2
        0x080006e2:    f7fffdf8    ....    BL       __aeabi_llsl ; 0x80002d6
        0x080006e6:    4604        .F      MOV      r4,r0
        0x080006e8:    460f        .F      MOV      r7,r1
        0x080006ea:    ea40000a    @...    ORR      r0,r0,r10
        0x080006ee:    ea41010b    A...    ORR      r1,r1,r11
        0x080006f2:    4653        SF      MOV      r3,r10
        0x080006f4:    465a        ZF      MOV      r2,r11
        0x080006f6:    4308        .C      ORRS     r0,r0,r1
        0x080006f8:    d013        ..      BEQ      0x8000722 ; _double_epilogue + 88
        0x080006fa:    4611        .F      MOV      r1,r2
        0x080006fc:    ea530001    S...    ORRS     r0,r3,r1
        0x08000700:    d019        ..      BEQ      0x8000736 ; _double_epilogue + 108
        0x08000702:    f1c80240    ..@.    RSB      r2,r8,#0x40
        0x08000706:    4650        PF      MOV      r0,r10
        0x08000708:    f7fffd8d    ....    BL       __aeabi_llsr ; 0x8000226
        0x0800070c:    4605        .F      MOV      r5,r0
        0x0800070e:    460e        .F      MOV      r6,r1
        0x08000710:    4650        PF      MOV      r0,r10
        0x08000712:    4659        YF      MOV      r1,r11
        0x08000714:    4642        BF      MOV      r2,r8
        0x08000716:    f7fffdde    ....    BL       __aeabi_llsl ; 0x80002d6
        0x0800071a:    4308        .C      ORRS     r0,r0,r1
        0x0800071c:    d005        ..      BEQ      0x800072a ; _double_epilogue + 96
        0x0800071e:    2001        .       MOVS     r0,#1
        0x08000720:    e004        ..      B        0x800072c ; _double_epilogue + 98
        0x08000722:    4620         F      MOV      r0,r4
        0x08000724:    4639        9F      MOV      r1,r7
        0x08000726:    e8bd8df0    ....    POP      {r4-r8,r10,r11,pc}
        0x0800072a:    2000        .       MOVS     r0,#0
        0x0800072c:    4305        .C      ORRS     r5,r5,r0
        0x0800072e:    ea4676e0    F..v    ORR      r6,r6,r0,ASR #31
        0x08000732:    432c        ,C      ORRS     r4,r4,r5
        0x08000734:    4337        7C      ORRS     r7,r7,r6
        0x08000736:    980a        ..      LDR      r0,[sp,#0x28]
        0x08000738:    0563        c.      LSLS     r3,r4,#21
        0x0800073a:    0ae4        ..      LSRS     r4,r4,#11
        0x0800073c:    eba00008    ....    SUB      r0,r0,r8
        0x08000740:    2200        ."      MOVS     r2,#0
        0x08000742:    0afd        ..      LSRS     r5,r7,#11
        0x08000744:    ea445447    D.GT    ORR      r4,r4,r7,LSL #21
        0x08000748:    300a        .0      ADDS     r0,r0,#0xa
        0x0800074a:    d502        ..      BPL      0x8000752 ; _double_epilogue + 136
        0x0800074c:    2000        .       MOVS     r0,#0
        0x0800074e:    4601        .F      MOV      r1,r0
        0x08000750:    e7e9        ..      B        0x8000726 ; _double_epilogue + 92
        0x08000752:    0501        ..      LSLS     r1,r0,#20
        0x08000754:    1910        ..      ADDS     r0,r2,r4
        0x08000756:    4169        iA      ADCS     r1,r1,r5
        0x08000758:    e9dd4508    ...E    LDRD     r4,r5,[sp,#0x20]
        0x0800075c:    1900        ..      ADDS     r0,r0,r4
        0x0800075e:    4169        iA      ADCS     r1,r1,r5
        0x08000760:    e8bd4df0    ...M    POP      {r4-r8,r10,r11,lr}
        0x08000764:    e7a2        ..      B        _double_round ; 0x80006ac
    i.BusFault_Handler
    BusFault_Handler
        0x08000766:    e7fe        ..      B        BusFault_Handler ; 0x8000766
    i.DMA1_Stream1_IRQHandler
    DMA1_Stream1_IRQHandler
        0x08000768:    4806        .H      LDR      r0,[pc,#24] ; [0x8000784] = 0x20000b64
        0x0800076a:    b510        ..      PUSH     {r4,lr}
        0x0800076c:    6bc0        .k      LDR      r0,[r0,#0x3c]
        0x0800076e:    6800        .h      LDR      r0,[r0,#0]
        0x08000770:    6841        Ah      LDR      r1,[r0,#4]
        0x08000772:    a005        ..      ADR      r0,{pc}+0x16 ; 0x8000788
        0x08000774:    f000f8c8    ....    BL       DMA_Sprintf_ISR ; 0x8000908
        0x08000778:    4802        .H      LDR      r0,[pc,#8] ; [0x8000784] = 0x20000b64
        0x0800077a:    e8bd4010    ...@    POP      {r4,lr}
        0x0800077e:    30a8        .0      ADDS     r0,r0,#0xa8
        0x08000780:    f000baa2    ....    B.W      HAL_DMA_IRQHandler ; 0x8000cc8
    $d
        0x08000784:    20000b64    d..     DCD    536873828
        0x08000788:    52415355    USAR    DCD    1380012885
        0x0800078c:    4e5f3354    T3_N    DCD    1314861908
        0x08000790:    20525444    DTR     DCD    542266436
        0x08000794:    6425203d    = %d    DCD    1680154685
        0x08000798:    00000a0d    ....    DCD    2573
    $t
    i.DMA1_Stream3_IRQHandler
