tangbaishu/Personal/MDK-ARM/Out/STM32F407ZGT6_Embedded_V1.asm
    DMA1_Stream3_IRQHandler
        0x0800079c:    4801        .H      LDR      r0,[pc,#4] ; [0x80007a4] = 0x20000bac
        0x0800079e:    f000ba93    ....    B.W      HAL_DMA_IRQHandler ; 0x8000cc8
    $d
        0x080007a2:    0000        ..      DCW    0
        0x080007a4:    20000bac    ...     DCD    536873900
    $t
    i.DMA2_Stream5_IRQHandler
    DMA2_Stream5_IRQHandler
        0x080007a8:    4805        .H      LDR      r0,[pc,#20] ; [0x80007c0] = 0x20000a5c
        0x080007aa:    6bc0        .k      LDR      r0,[r0,#0x3c]
        0x080007ac:    6800        .h      LDR      r0,[r0,#0]
        0x080007ae:    6840        @h      LDR      r0,[r0,#4]
        0x080007b0:    4903        .I      LDR      r1,[pc,#12] ; [0x80007c0] = 0x20000a5c
        0x080007b2:    390c        .9      SUBS     r1,r1,#0xc
        0x080007b4:    7208        .r      STRB     r0,[r1,#8]
        0x080007b6:    f10100b4    ....    ADD      r0,r1,#0xb4
        0x080007ba:    f000ba85    ....    B.W      HAL_DMA_IRQHandler ; 0x8000cc8
    $d
        0x080007be:    0000        ..      DCW    0
        0x080007c0:    20000a5c    \..     DCD    536873564
    $t
    i.DMA2_Stream7_IRQHandler
    DMA2_Stream7_IRQHandler
        0x080007c4:    4801        .H      LDR      r0,[pc,#4] ; [0x80007cc] = 0x20000aa4
        0x080007c6:    f000ba7f    ....    B.W      HAL_DMA_IRQHandler ; 0x8000cc8
    $d
        0x080007ca:    0000        ..      DCW    0
        0x080007cc:    20000aa4    ...     DCD    536873636
    $t
    i.DMA_CalcBaseAndBitshift
    DMA_CalcBaseAndBitshift
        0x080007d0:    6801        .h      LDR      r1,[r0,#0]
        0x080007d2:    2318        .#      MOVS     r3,#0x18
        0x080007d4:    b2ca        ..      UXTB     r2,r1
        0x080007d6:    3a10        .:      SUBS     r2,r2,#0x10
        0x080007d8:    fbb2f2f3    ....    UDIV     r2,r2,r3
        0x080007dc:    4b05        .K      LDR      r3,[pc,#20] ; [0x80007f4] = 0x800328c
        0x080007de:    f36f0109    o...    BFC      r1,#0,#10
        0x080007e2:    2a03        .*      CMP      r2,#3
        0x080007e4:    5c9b        .\      LDRB     r3,[r3,r2]
        0x080007e6:    65c3        .e      STR      r3,[r0,#0x5c]
        0x080007e8:    d900        ..      BLS      0x80007ec ; DMA_CalcBaseAndBitshift + 28
        0x080007ea:    1d09        ..      ADDS     r1,r1,#4
        0x080007ec:    6581        .e      STR      r1,[r0,#0x58]
        0x080007ee:    4608        .F      MOV      r0,r1
        0x080007f0:    4770        pG      BX       lr
    $d
        0x080007f2:    0000        ..      DCW    0
        0x080007f4:    0800328c    .2..    DCD    134230668
    $t
    i.DMA_CheckFifoParam
    DMA_CheckFifoParam
        0x080007f8:    b510        ..      PUSH     {r4,lr}
        0x080007fa:    4601        .F      MOV      r1,r0
        0x080007fc:    2000        .       MOVS     r0,#0
        0x080007fe:    698b        .i      LDR      r3,[r1,#0x18]
        0x08000800:    6a8a        .j      LDR      r2,[r1,#0x28]
        0x08000802:    f04f74c0    O..t    MOV      r4,#0x1800000
        0x08000806:    b153        S.      CBZ      r3,0x800081e ; DMA_CheckFifoParam + 38
        0x08000808:    f5b35f00    ..._    CMP      r3,#0x2000
        0x0800080c:    d015        ..      BEQ      0x800083a ; DMA_CheckFifoParam + 66
        0x0800080e:    b172        r.      CBZ      r2,0x800082e ; DMA_CheckFifoParam + 54
        0x08000810:    2a01        .*      CMP      r2,#1
        0x08000812:    d00c        ..      BEQ      0x800082e ; DMA_CheckFifoParam + 54
        0x08000814:    2a02        .*      CMP      r2,#2
        0x08000816:    d00a        ..      BEQ      0x800082e ; DMA_CheckFifoParam + 54
        0x08000818:    2a03        .*      CMP      r2,#3
        0x0800081a:    d109        ..      BNE      0x8000830 ; DMA_CheckFifoParam + 56
        0x0800081c:    e004        ..      B        0x8000828 ; DMA_CheckFifoParam + 48
        0x0800081e:    b11a        ..      CBZ      r2,0x8000828 ; DMA_CheckFifoParam + 48
        0x08000820:    2a01        .*      CMP      r2,#1
        0x08000822:    d006        ..      BEQ      0x8000832 ; DMA_CheckFifoParam + 58
        0x08000824:    2a02        .*      CMP      r2,#2
        0x08000826:    d103        ..      BNE      0x8000830 ; DMA_CheckFifoParam + 56
        0x08000828:    6ac9        .j      LDR      r1,[r1,#0x2c]
        0x0800082a:    01c9        ..      LSLS     r1,r1,#7
        0x0800082c:    d500        ..      BPL      0x8000830 ; DMA_CheckFifoParam + 56
        0x0800082e:    2001        .       MOVS     r0,#1
        0x08000830:    bd10        ..      POP      {r4,pc}
        0x08000832:    6ac9        .j      LDR      r1,[r1,#0x2c]
        0x08000834:    42a1        .B      CMP      r1,r4
        0x08000836:    d0fa        ..      BEQ      0x800082e ; DMA_CheckFifoParam + 54
        0x08000838:    bd10        ..      POP      {r4,pc}
        0x0800083a:    2a00        .*      CMP      r2,#0
        0x0800083c:    d0f7        ..      BEQ      0x800082e ; DMA_CheckFifoParam + 54
        0x0800083e:    2a01        .*      CMP      r2,#1
        0x08000840:    d0f2        ..      BEQ      0x8000828 ; DMA_CheckFifoParam + 48
        0x08000842:    2a02        .*      CMP      r2,#2
        0x08000844:    d0f3        ..      BEQ      0x800082e ; DMA_CheckFifoParam + 54
        0x08000846:    2a03        .*      CMP      r2,#3
        0x08000848:    d0f3        ..      BEQ      0x8000832 ; DMA_CheckFifoParam + 58
        0x0800084a:    bd10        ..      POP      {r4,pc}
    i.DMA_SetConfig
    DMA_SetConfig
        0x0800084c:    b530        0.      PUSH     {r4,r5,lr}
        0x0800084e:    6804        .h      LDR      r4,[r0,#0]
        0x08000850:    6825        %h      LDR      r5,[r4,#0]
        0x08000852:    f4252580    %..%    BIC      r5,r5,#0x40000
        0x08000856:    6025        %`      STR      r5,[r4,#0]
        0x08000858:    6804        .h      LDR      r4,[r0,#0]
        0x0800085a:    6063        c`      STR      r3,[r4,#4]
        0x0800085c:    6883        .h      LDR      r3,[r0,#8]
        0x0800085e:    2b40        @+      CMP      r3,#0x40
        0x08000860:    6803        .h      LDR      r3,[r0,#0]
        0x08000862:    d003        ..      BEQ      0x800086c ; DMA_SetConfig + 32
        0x08000864:    6099        .`      STR      r1,[r3,#8]
        0x08000866:    6800        .h      LDR      r0,[r0,#0]
        0x08000868:    60c2        .`      STR      r2,[r0,#0xc]
        0x0800086a:    bd30        0.      POP      {r4,r5,pc}
        0x0800086c:    609a        .`      STR      r2,[r3,#8]
        0x0800086e:    6800        .h      LDR      r0,[r0,#0]
        0x08000870:    60c1        .`      STR      r1,[r0,#0xc]
        0x08000872:    bd30        0.      POP      {r4,r5,pc}
    i.DMA_Sprintf
    DMA_Sprintf
        0x08000874:    b40f        ..      PUSH     {r0-r3}
        0x08000876:    e92d47f0    -..G    PUSH     {r4-r10,lr}
        0x0800087a:    f8df8080    ....    LDR      r8,[pc,#128] ; [0x80008fc] = 0x20000664
        0x0800087e:    f8dfa080    ....    LDR      r10,[pc,#128] ; [0x8000900] = 0x20000018
        0x08000882:    f508767e    ..~v    ADD      r6,r8,#0x3f8
        0x08000886:    f04f0900    O...    MOV      r9,#0
        0x0800088a:    ad09        ..      ADD      r5,sp,#0x24
        0x0800088c:    f2a674e4    ...t    SUB      r4,r6,#0x7e4
        0x08000890:    f44f77fa    O..w    MOV      r7,#0x1f4
        0x08000894:    f8d403e8    ....    LDR      r0,[r4,#0x3e8]
        0x08000898:    42b8        .B      CMP      r0,r7
        0x0800089a:    da10        ..      BGE      0x80008be ; DMA_Sprintf + 74
        0x0800089c:    f2a031e9    ...1    SUB      r1,r0,#0x3e9
        0x080008a0:    462b        +F      MOV      r3,r5
        0x080008a2:    4249        IB      RSBS     r1,r1,#0
        0x080008a4:    4420         D      ADD      r0,r0,r4
        0x080008a6:    9a08        ..      LDR      r2,[sp,#0x20]
        0x080008a8:    f001ff80    ....    BL       __0vsnprintf ; 0x80027ac
        0x080008ac:    f8ca0004    ....    STR      r0,[r10,#4]
        0x080008b0:    f8d413e8    ....    LDR      r1,[r4,#0x3e8]
        0x080008b4:    180a        ..      ADDS     r2,r1,r0
        0x080008b6:    f8c423e8    ...#    STR      r2,[r4,#0x3e8]
        0x080008ba:    42ba        .B      CMP      r2,r7
        0x080008bc:    db06        ..      BLT      0x80008cc ; DMA_Sprintf + 88
        0x080008be:    6830        0h      LDR      r0,[r6,#0]
        0x080008c0:    6800        .h      LDR      r0,[r0,#0]
        0x080008c2:    0640        @.      LSLS     r0,r0,#25
        0x080008c4:    d5e6        ..      BPL      0x8000894 ; DMA_Sprintf + 32
        0x080008c6:    f8d423e8    ...#    LDR      r2,[r4,#0x3e8]
        0x080008ca:    e003        ..      B        0x80008d4 ; DMA_Sprintf + 96
        0x080008cc:    6830        0h      LDR      r0,[r6,#0]
        0x080008ce:    6800        .h      LDR      r0,[r0,#0]
        0x080008d0:    0640        @.      LSLS     r0,r0,#25
        0x080008d2:    d50f        ..      BPL      0x80008f4 ; DMA_Sprintf + 128
        0x080008d4:    490b        .I      LDR      r1,[pc,#44] ; [0x8000904] = 0x20000278
        0x080008d6:    4809        .H      LDR      r0,[pc,#36] ; [0x80008fc] = 0x20000664
        0x080008d8:    f7fffcb5    ....    BL       ___aeabi_memcpy8$move ; 0x8000246
        0x080008dc:    f8d403e8    ....    LDR      r0,[r4,#0x3e8]
        0x080008e0:    f8c803e8    ....    STR      r0,[r8,#0x3e8]
        0x080008e4:    4905        .I      LDR      r1,[pc,#20] ; [0x80008fc] = 0x20000664
        0x080008e6:    b282        ..      UXTH     r2,r0
        0x080008e8:    f501707e    ..~p    ADD      r0,r1,#0x3f8
        0x080008ec:    f8c493e8    ....    STR      r9,[r4,#0x3e8]
        0x080008f0:    f001fab4    ....    BL       HAL_UART_Transmit_DMA ; 0x8001e5c
        0x080008f4:    e8bd07f0    ....    POP      {r4-r10}
        0x080008f8:    f85dfb14    ]...    LDR      pc,[sp],#0x14
    $d
        0x080008fc:    20000664    d..     DCD    536872548
        0x08000900:    20000018    ...     DCD    536870936
        0x08000904:    20000278    x..     DCD    536871544
    $t
    i.DMA_Sprintf_ISR
    DMA_Sprintf_ISR
        0x08000908:    b40f        ..      PUSH     {r0-r3}
        0x0800090a:    e92d5ff0    -.._    PUSH     {r4-r12,lr}
        0x0800090e:    f8df90dc    ....    LDR      r9,[pc,#220] ; [0x80009ec] = 0x20000664
        0x08000912:    f8dfa0dc    ....    LDR      r10,[pc,#220] ; [0x80009f0] = 0x20000018
        0x08000916:    f5a9747b    ..{t    SUB      r4,r9,#0x3ec
        0x0800091a:    ae0b        ..      ADD      r6,sp,#0x2c
        0x0800091c:    f44f77fa    O..w    MOV      r7,#0x1f4
        0x08000920:    f04f0800    O...    MOV      r8,#0
        0x08000924:    f04f0bfe    O...    MOV      r11,#0xfe
        0x08000928:    f20475e4    ...u    ADD      r5,r4,#0x7e4
        0x0800092c:    f8d403e8    ....    LDR      r0,[r4,#0x3e8]
        0x08000930:    42b8        .B      CMP      r0,r7
        0x08000932:    da10        ..      BGE      0x8000956 ; DMA_Sprintf_ISR + 78
        0x08000934:    f2a031e9    ...1    SUB      r1,r0,#0x3e9
        0x08000938:    4633        3F      MOV      r3,r6
        0x0800093a:    4249        IB      RSBS     r1,r1,#0
        0x0800093c:    4420         D      ADD      r0,r0,r4
        0x0800093e:    9a0a        ..      LDR      r2,[sp,#0x28]
        0x08000940:    f001ff34    ..4.    BL       __0vsnprintf ; 0x80027ac
        0x08000944:    f8ca0008    ....    STR      r0,[r10,#8]
        0x08000948:    f8d413e8    ....    LDR      r1,[r4,#0x3e8]
        0x0800094c:    180a        ..      ADDS     r2,r1,r0
        0x0800094e:    f8c423e8    ...#    STR      r2,[r4,#0x3e8]
        0x08000952:    42ba        .B      CMP      r2,r7
        0x08000954:    db22        ".      BLT      0x800099c ; DMA_Sprintf_ISR + 148
        0x08000956:    6828        (h      LDR      r0,[r5,#0]
        0x08000958:    6800        .h      LDR      r0,[r0,#0]
        0x0800095a:    0640        @.      LSLS     r0,r0,#25
        0x0800095c:    d5e6        ..      BPL      0x800092c ; DMA_Sprintf_ISR + 36
        0x0800095e:    4925        %I      LDR      r1,[pc,#148] ; [0x80009f4] = 0x20000278
        0x08000960:    4822        "H      LDR      r0,[pc,#136] ; [0x80009ec] = 0x20000664
        0x08000962:    f8d423e8    ...#    LDR      r2,[r4,#0x3e8]
        0x08000966:    f7fffc6e    ..n.    BL       ___aeabi_memcpy8$move ; 0x8000246
        0x0800096a:    f8d403e8    ....    LDR      r0,[r4,#0x3e8]
        0x0800096e:    f8c903e8    ....    STR      r0,[r9,#0x3e8]
        0x08000972:    491e        .I      LDR      r1,[pc,#120] ; [0x80009ec] = 0x20000664
        0x08000974:    b282        ..      UXTH     r2,r0
        0x08000976:    f501707e    ..~p    ADD      r0,r1,#0x3f8
        0x0800097a:    f8c483e8    ....    STR      r8,[r4,#0x3e8]
        0x0800097e:    f001fa6d    ..m.    BL       HAL_UART_Transmit_DMA ; 0x8001e5c
        0x08000982:    e8bd1ff0    ....    POP      {r4-r12}
        0x08000986:    f85dfb14    ]...    LDR      pc,[sp],#0x14
        0x0800098a:    bf00        ..      NOP      
        0x0800098c:    f8cb6000    ...`    STR      r6,[r11,#0]
        0x08000990:    4b19        .K      LDR      r3,[pc,#100] ; [0x80009f8] = 0x40003000
        0x08000992:    f8878000    ....    STRB     r8,[r7,#0]
        0x08000996:    f8c3a000    ....    STR      r10,[r3,#0]
        0x0800099a:    e006        ..      B        0x80009aa ; DMA_Sprintf_ISR + 162
        0x0800099c:    465e        ^F      MOV      r6,r11
        0x0800099e:    f8dfb05c    ..\.    LDR      r11,[pc,#92] ; [0x80009fc] = 0x40002c00
        0x080009a2:    4f17        .O      LDR      r7,[pc,#92] ; [0x8000a00] = 0x20000014
        0x080009a4:    6828        (h      LDR      r0,[r5,#0]
        0x080009a6:    f64a2aaa    J..*    MOV      r10,#0xaaaa
        0x080009aa:    6801        .h      LDR      r1,[r0,#0]
        0x080009ac:    0649        I.      LSLS     r1,r1,#25
        0x080009ae:    d5ed        ..      BPL      0x800098c ; DMA_Sprintf_ISR + 132
        0x080009b0:    4910        .I      LDR      r1,[pc,#64] ; [0x80009f4] = 0x20000278
        0x080009b2:    480e        .H      LDR      r0,[pc,#56] ; [0x80009ec] = 0x20000664
        0x080009b4:    f7fffc47    ..G.    BL       ___aeabi_memcpy8$move ; 0x8000246
        0x080009b8:    f8d403e8    ....    LDR      r0,[r4,#0x3e8]
        0x080009bc:    f8c903e8    ....    STR      r0,[r9,#0x3e8]
        0x080009c0:    490a        .I      LDR      r1,[pc,#40] ; [0x80009ec] = 0x20000664
        0x080009c2:    b282        ..      UXTH     r2,r0
        0x080009c4:    f501707e    ..~p    ADD      r0,r1,#0x3f8
        0x080009c8:    f8c483e8    ....    STR      r8,[r4,#0x3e8]
        0x080009cc:    f001fa46    ..F.    BL       HAL_UART_Transmit_DMA ; 0x8001e5c
        0x080009d0:    465a        ZF      MOV      r2,r11
        0x080009d2:    463b        ;F      MOV      r3,r7
        0x080009d4:    4651        QF      MOV      r1,r10
        0x080009d6:    4808        .H      LDR      r0,[pc,#32] ; [0x80009f8] = 0x40003000
        0x080009d8:    682c        ,h      LDR      r4,[r5,#0]
        0x080009da:    e003        ..      B        0x80009e4 ; DMA_Sprintf_ISR + 220
        0x080009dc:    6016        .`      STR      r6,[r2,#0]
        0x080009de:    f8838000    ....    STRB     r8,[r3,#0]
        0x080009e2:    6001        .`      STR      r1,[r0,#0]
        0x080009e4:    6825        %h      LDR      r5,[r4,#0]
        0x080009e6:    066d        m.      LSLS     r5,r5,#25
        0x080009e8:    d5f8        ..      BPL      0x80009dc ; DMA_Sprintf_ISR + 212
        0x080009ea:    e7ca        ..      B        0x8000982 ; DMA_Sprintf_ISR + 122
    $d
        0x080009ec:    20000664    d..     DCD    536872548
        0x080009f0:    20000018    ...     DCD    536870936
        0x080009f4:    20000278    x..     DCD    536871544
        0x080009f8:    40003000    .0.@    DCD    1073754112
        0x080009fc:    40002c00    .,.@    DCD    1073753088
        0x08000a00:    20000014    ...     DCD    536870932
    $t
    i.DMA_Sprintf_String
    DMA_Sprintf_String
        0x08000a04:    e92d47f0    -..G    PUSH     {r4-r10,lr}
        0x08000a08:    4c16        .L      LDR      r4,[pc,#88] ; [0x8000a64] = 0x20000a5c
        0x08000a0a:    f8dfc054    ..T.    LDR      r12,[pc,#84] ; [0x8000a60] = 0x40003000
        0x08000a0e:    2500        .%      MOVS     r5,#0
        0x08000a10:    26fe        .&      MOVS     r6,#0xfe
        0x08000a12:    4f11        .O      LDR      r7,[pc,#68] ; [0x8000a58] = 0x40002c00
        0x08000a14:    f8df8044    ..D.    LDR      r8,[pc,#68] ; [0x8000a5c] = 0x20000014
        0x08000a18:    f64a29aa    J..)    MOV      r9,#0xaaaa
        0x08000a1c:    46e2        .F      MOV      r10,r12
        0x08000a1e:    6822        "h      LDR      r2,[r4,#0]
        0x08000a20:    e004        ..      B        0x8000a2c ; DMA_Sprintf_String + 40
        0x08000a22:    603e        >`      STR      r6,[r7,#0]
        0x08000a24:    f8885000    ...P    STRB     r5,[r8,#0]
        0x08000a28:    f8cc9000    ....    STR      r9,[r12,#0]
        0x08000a2c:    6813        .h      LDR      r3,[r2,#0]
        0x08000a2e:    065b        [.      LSLS     r3,r3,#25
        0x08000a30:    d5f7        ..      BPL      0x8000a22 ; DMA_Sprintf_String + 30
        0x08000a32:    460a        .F      MOV      r2,r1
        0x08000a34:    4601        .F      MOV      r1,r0
        0x08000a36:    480b        .H      LDR      r0,[pc,#44] ; [0x8000a64] = 0x20000a5c
        0x08000a38:    f001fa10    ....    BL       HAL_UART_Transmit_DMA ; 0x8001e5c
        0x08000a3c:    4641        AF      MOV      r1,r8
        0x08000a3e:    464a        JF      MOV      r2,r9
        0x08000a40:    4650        PF      MOV      r0,r10
        0x08000a42:    6823        #h      LDR      r3,[r4,#0]
        0x08000a44:    e002        ..      B        0x8000a4c ; DMA_Sprintf_String + 72
        0x08000a46:    603e        >`      STR      r6,[r7,#0]
        0x08000a48:    700d        .p      STRB     r5,[r1,#0]
        0x08000a4a:    6002        .`      STR      r2,[r0,#0]
        0x08000a4c:    681c        .h      LDR      r4,[r3,#0]
        0x08000a4e:    0664        d.      LSLS     r4,r4,#25
        0x08000a50:    d5f9        ..      BPL      0x8000a46 ; DMA_Sprintf_String + 66
        0x08000a52:    e8bd87f0    ....    POP      {r4-r10,pc}
    $d
        0x08000a56:    0000        ..      DCW    0
        0x08000a58:    40002c00    .,.@    DCD    1073753088
        0x08000a5c:    20000014    ...     DCD    536870932
        0x08000a60:    40003000    .0.@    DCD    1073754112
        0x08000a64:    20000a5c    \..     DCD    536873564
    $t
    i.DMA_UART1_Buff_ckeck
    DMA_UART1_Buff_ckeck
        0x08000a68:    b510        ..      PUSH     {r4,lr}
        0x08000a6a:    4c11        .L      LDR      r4,[pc,#68] ; [0x8000ab0] = 0x20000278
        0x08000a6c:    f8d423e8    ...#    LDR      r2,[r4,#0x3e8]
        0x08000a70:    2a00        .*      CMP      r2,#0
        0x08000a72:    d01c        ..      BEQ      0x8000aae ; DMA_UART1_Buff_ckeck + 70
        0x08000a74:    f20470e4    ...p    ADD      r0,r4,#0x7e4
        0x08000a78:    6800        .h      LDR      r0,[r0,#0]
        0x08000a7a:    6800        .h      LDR      r0,[r0,#0]
        0x08000a7c:    0640        @.      LSLS     r0,r0,#25
        0x08000a7e:    d516        ..      BPL      0x8000aae ; DMA_UART1_Buff_ckeck + 70
        0x08000a80:    4621        !F      MOV      r1,r4
        0x08000a82:    f501707b    ..{p    ADD      r0,r1,#0x3ec
        0x08000a86:    f7fffbde    ....    BL       ___aeabi_memcpy8$move ; 0x8000246
        0x08000a8a:    f504717b    ..{q    ADD      r1,r4,#0x3ec
        0x08000a8e:    f8d403e8    ....    LDR      r0,[r4,#0x3e8]
        0x08000a92:    f8c103e8    ....    STR      r0,[r1,#0x3e8]
        0x08000a96:    2100        .!      MOVS     r1,#0
        0x08000a98:    f8c413e8    ....    STR      r1,[r4,#0x3e8]
        0x08000a9c:    f504717b    ..{q    ADD      r1,r4,#0x3ec
        0x08000aa0:    b282        ..      UXTH     r2,r0
        0x08000aa2:    e8bd4010    ...@    POP      {r4,lr}
        0x08000aa6:    f501707e    ..~p    ADD      r0,r1,#0x3f8
        0x08000aaa:    f001b9d7    ....    B.W      HAL_UART_Transmit_DMA ; 0x8001e5c
        0x08000aae:    bd10        ..      POP      {r4,pc}
    $d
        0x08000ab0:    20000278    x..     DCD    536871544
    $t
    i.DMA_UART_Debug_Driver_Init
    DMA_UART_Debug_Driver_Init
        0x08000ab4:    e92d4ff8    -..O    PUSH     {r3-r11,lr}
        0x08000ab8:    482f        /H      LDR      r0,[pc,#188] ; [0x8000b78] = 0x20000018
        0x08000aba:    7800        .x      LDRB     r0,[r0,#0]
        0x08000abc:    2800        .(      CMP      r0,#0
        0x08000abe:    d159        Y.      BNE      0x8000b74 ; DMA_UART_Debug_Driver_Init + 192
        0x08000ac0:    f001fb04    ....    BL       UART1_Driver_Init ; 0x80020cc
        0x08000ac4:    482d        -H      LDR      r0,[pc,#180] ; [0x8000b7c] = 0x40023830
        0x08000ac6:    2500        .%      MOVS     r5,#0
        0x08000ac8:    6801        .h      LDR      r1,[r0,#0]
        0x08000aca:    f4410180    A...    ORR      r1,r1,#0x400000
        0x08000ace:    6001        .`      STR      r1,[r0,#0]
        0x08000ad0:    6800        .h      LDR      r0,[r0,#0]
        0x08000ad2:    4c2c        ,L      LDR      r4,[pc,#176] ; [0x8000b84] = 0x20000aa4
        0x08000ad4:    f4000080    ....    AND      r0,r0,#0x400000
        0x08000ad8:    9000        ..      STR      r0,[sp,#0]
        0x08000ada:    4829        )H      LDR      r0,[pc,#164] ; [0x8000b80] = 0x400264b8
        0x08000adc:    f04f6700    O..g    MOV      r7,#0x8000000
        0x08000ae0:    e9c40700    ....    STRD     r0,r7,[r4,#0]
        0x08000ae4:    f04f0903    O...    MOV      r9,#3
        0x08000ae8:    e9c4950a    ....    STRD     r9,r5,[r4,#0x28]
        0x08000aec:    61a5        .a      STR      r5,[r4,#0x18]
        0x08000aee:    61e5        .a      STR      r5,[r4,#0x1c]
        0x08000af0:    f44f6a80    O..j    MOV      r10,#0x400
        0x08000af4:    6325        %c      STR      r5,[r4,#0x30]
        0x08000af6:    e9c4a504    ....    STRD     r10,r5,[r4,#0x10]
        0x08000afa:    2040        @       MOVS     r0,#0x40
        0x08000afc:    e9c40502    ....    STRD     r0,r5,[r4,#8]
        0x08000b00:    f04f0804    O...    MOV      r8,#4
        0x08000b04:    f44f3b00    O..;    MOV      r11,#0x20000
        0x08000b08:    e9c4b808    ....    STRD     r11,r8,[r4,#0x20]
        0x08000b0c:    4620         F      MOV      r0,r4
        0x08000b0e:    f000f9ab    ....    BL       HAL_DMA_Init ; 0x8000e68
        0x08000b12:    f1a40648    ..H.    SUB      r6,r4,#0x48
        0x08000b16:    2200        ."      MOVS     r2,#0
        0x08000b18:    63b4        .c      STR      r4,[r6,#0x38]
        0x08000b1a:    210a        .!      MOVS     r1,#0xa
        0x08000b1c:    2046        F       MOVS     r0,#0x46
        0x08000b1e:    63a6        .c      STR      r6,[r4,#0x38]
        0x08000b20:    f000fc52    ..R.    BL       HAL_NVIC_SetPriority ; 0x80013c8
        0x08000b24:    2046        F       MOVS     r0,#0x46
        0x08000b26:    f000fc41    ..A.    BL       HAL_NVIC_EnableIRQ ; 0x80013ac
        0x08000b2a:    4815        .H      LDR      r0,[pc,#84] ; [0x8000b80] = 0x400264b8
        0x08000b2c:    3460        `4      ADDS     r4,r4,#0x60
        0x08000b2e:    3830        08      SUBS     r0,r0,#0x30
        0x08000b30:    6020         `      STR      r0,[r4,#0]
        0x08000b32:    e9c47501    ...u    STRD     r7,r5,[r4,#4]
