tangbaishu/Personal/MDK-ARM/Out/STM32F407ZGT6_Embedded_V1.asm
        0x08000b36:    e9c4950a    ....    STRD     r9,r5,[r4,#0x28]
        0x08000b3a:    61a5        .a      STR      r5,[r4,#0x18]
        0x08000b3c:    61e5        .a      STR      r5,[r4,#0x1c]
        0x08000b3e:    6325        %c      STR      r5,[r4,#0x30]
        0x08000b40:    e9c4a504    ....    STRD     r10,r5,[r4,#0x10]
        0x08000b44:    60e5        .`      STR      r5,[r4,#0xc]
        0x08000b46:    e9c4b808    ....    STRD     r11,r8,[r4,#0x20]
        0x08000b4a:    4620         F      MOV      r0,r4
        0x08000b4c:    f000f98c    ....    BL       HAL_DMA_Init ; 0x8000e68
        0x08000b50:    63f4        .c      STR      r4,[r6,#0x3c]
        0x08000b52:    2201        ."      MOVS     r2,#1
        0x08000b54:    210a        .!      MOVS     r1,#0xa
        0x08000b56:    2044        D       MOVS     r0,#0x44
        0x08000b58:    63a6        .c      STR      r6,[r4,#0x38]
        0x08000b5a:    f000fc35    ..5.    BL       HAL_NVIC_SetPriority ; 0x80013c8
        0x08000b5e:    2044        D       MOVS     r0,#0x44
        0x08000b60:    f000fc24    ..$.    BL       HAL_NVIC_EnableIRQ ; 0x80013ac
        0x08000b64:    2164        d!      MOVS     r1,#0x64
        0x08000b66:    f1a400b0    ....    SUB      r0,r4,#0xb0
        0x08000b6a:    f000f80d    ....    BL       Data_Buff_Queue_Init ; 0x8000b88
        0x08000b6e:    4802        .H      LDR      r0,[pc,#8] ; [0x8000b78] = 0x20000018
        0x08000b70:    2101        .!      MOVS     r1,#1
        0x08000b72:    7001        .p      STRB     r1,[r0,#0]
        0x08000b74:    e8bd8ff8    ....    POP      {r3-r11,pc}
    $d
        0x08000b78:    20000018    ...     DCD    536870936
        0x08000b7c:    40023830    08.@    DCD    1073887280
        0x08000b80:    400264b8    .d.@    DCD    1073898680
        0x08000b84:    20000aa4    ...     DCD    536873636
    $t
    i.Data_Buff_Queue_Init
    Data_Buff_Queue_Init
        0x08000b88:    b570        p.      PUSH     {r4-r6,lr}
        0x08000b8a:    2600        .&      MOVS     r6,#0
        0x08000b8c:    4604        .F      MOV      r4,r0
        0x08000b8e:    6006        .`      STR      r6,[r0,#0]
        0x08000b90:    460d        .F      MOV      r5,r1
        0x08000b92:    4608        .F      MOV      r0,r1
        0x08000b94:    f002fb44    ..D.    BL       malloc ; 0x8003220
        0x08000b98:    6020         `      STR      r0,[r4,#0]
        0x08000b9a:    b130        0.      CBZ      r0,0x8000baa ; Data_Buff_Queue_Init + 34
        0x08000b9c:    4629        )F      MOV      r1,r5
        0x08000b9e:    f7fffb79    ..y.    BL       __aeabi_memclr ; 0x8000294
        0x08000ba2:    7126        &q      STRB     r6,[r4,#4]
        0x08000ba4:    7165        eq      STRB     r5,[r4,#5]
        0x08000ba6:    2000        .       MOVS     r0,#0
        0x08000ba8:    bd70        p.      POP      {r4-r6,pc}
        0x08000baa:    a002        ..      ADR      r0,{pc}+0xa ; 0x8000bb4
        0x08000bac:    f7fffe62    ..b.    BL       DMA_Sprintf ; 0x8000874
        0x08000bb0:    2001        .       MOVS     r0,#1
        0x08000bb2:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x08000bb4:    6f727245    Erro    DCD    1869771333
        0x08000bb8:    21212172    r!!!    DCD    555819378
        0x08000bbc:    61442009    . Da    DCD    1631854601
        0x08000bc0:    425f6174    ta_B    DCD    1113547124
        0x08000bc4:    5f666675    uff_    DCD    1600546421
        0x08000bc8:    75657551    Queu    DCD    1969583441
        0x08000bcc:    6e495f65    e_In    DCD    1850302309
        0x08000bd0:    45207469    it E    DCD    1159754857
        0x08000bd4:    726f7272    rror    DCD    1919906418
        0x08000bd8:    6c616d3a    :mal    DCD    1818324282
        0x08000bdc:    20636f6c    loc     DCD    543387500
        0x08000be0:    75746572    retu    DCD    1970562418
        0x08000be4:    4e206e72    rn N    DCD    1310748274
        0x08000be8:    0d4c4c55    ULL.    DCD    223104085
        0x08000bec:    0000000a    ....    DCD    10
    $t
    i.DebugMon_Handler
    DebugMon_Handler
        0x08000bf0:    4770        pG      BX       lr
        0x08000bf2:    0000        ..      MOVS     r0,r0
    i.ETH_IRQHandler
    ETH_IRQHandler
        0x08000bf4:    4801        .H      LDR      r0,[pc,#4] ; [0x8000bfc] = 0x20000170
        0x08000bf6:    f000ba07    ....    B.W      HAL_ETH_IRQHandler ; 0x8001008
    $d
        0x08000bfa:    0000        ..      DCW    0
        0x08000bfc:    20000170    p..     DCD    536871280
    $t
    i.ETH_WKUP_IRQHandler
    ETH_WKUP_IRQHandler
        0x08000c00:    4801        .H      LDR      r0,[pc,#4] ; [0x8000c08] = 0x20000170
        0x08000c02:    f000ba01    ....    B.W      HAL_ETH_IRQHandler ; 0x8001008
    $d
        0x08000c06:    0000        ..      DCW    0
        0x08000c08:    20000170    p..     DCD    536871280
    $t
    i.Error_Handler
    Error_Handler
        0x08000c0c:    b672        r.      CPSID    i
        0x08000c0e:    e7fe        ..      B        0x8000c0e ; Error_Handler + 2
    i.HAL_DMA_Abort
    HAL_DMA_Abort
        0x08000c10:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08000c14:    4604        .F      MOV      r4,r0
        0x08000c16:    6d87        .m      LDR      r7,[r0,#0x58]
        0x08000c18:    f000fb68    ..h.    BL       HAL_GetTick ; 0x80012ec
        0x08000c1c:    4606        .F      MOV      r6,r0
        0x08000c1e:    f8940035    ..5.    LDRB     r0,[r4,#0x35]
        0x08000c22:    2500        .%      MOVS     r5,#0
        0x08000c24:    2802        .(      CMP      r0,#2
        0x08000c26:    d006        ..      BEQ      0x8000c36 ; HAL_DMA_Abort + 38
        0x08000c28:    2080        .       MOVS     r0,#0x80
        0x08000c2a:    6560        `e      STR      r0,[r4,#0x54]
        0x08000c2c:    f8845034    ..4P    STRB     r5,[r4,#0x34]
        0x08000c30:    2001        .       MOVS     r0,#1
        0x08000c32:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x08000c36:    6820         h      LDR      r0,[r4,#0]
        0x08000c38:    6801        .h      LDR      r1,[r0,#0]
        0x08000c3a:    f0210116    !...    BIC      r1,r1,#0x16
        0x08000c3e:    6001        .`      STR      r1,[r0,#0]
        0x08000c40:    6820         h      LDR      r0,[r4,#0]
        0x08000c42:    6941        Ai      LDR      r1,[r0,#0x14]
        0x08000c44:    f0210180    !...    BIC      r1,r1,#0x80
        0x08000c48:    6141        Aa      STR      r1,[r0,#0x14]
        0x08000c4a:    6c20         l      LDR      r0,[r4,#0x40]
        0x08000c4c:    b908        ..      CBNZ     r0,0x8000c52 ; HAL_DMA_Abort + 66
        0x08000c4e:    6ca0        .l      LDR      r0,[r4,#0x48]
        0x08000c50:    b120         .      CBZ      r0,0x8000c5c ; HAL_DMA_Abort + 76
        0x08000c52:    6820         h      LDR      r0,[r4,#0]
        0x08000c54:    6801        .h      LDR      r1,[r0,#0]
        0x08000c56:    f0210108    !...    BIC      r1,r1,#8
        0x08000c5a:    6001        .`      STR      r1,[r0,#0]
        0x08000c5c:    6820         h      LDR      r0,[r4,#0]
        0x08000c5e:    6801        .h      LDR      r1,[r0,#0]
        0x08000c60:    f0210101    !...    BIC      r1,r1,#1
        0x08000c64:    6001        .`      STR      r1,[r0,#0]
        0x08000c66:    e00c        ..      B        0x8000c82 ; HAL_DMA_Abort + 114
        0x08000c68:    f000fb40    ..@.    BL       HAL_GetTick ; 0x80012ec
        0x08000c6c:    1b80        ..      SUBS     r0,r0,r6
        0x08000c6e:    2805        .(      CMP      r0,#5
        0x08000c70:    d907        ..      BLS      0x8000c82 ; HAL_DMA_Abort + 114
        0x08000c72:    2020                MOVS     r0,#0x20
        0x08000c74:    6560        `e      STR      r0,[r4,#0x54]
        0x08000c76:    2003        .       MOVS     r0,#3
        0x08000c78:    f8840035    ..5.    STRB     r0,[r4,#0x35]
        0x08000c7c:    f8845034    ..4P    STRB     r5,[r4,#0x34]
        0x08000c80:    e7d7        ..      B        0x8000c32 ; HAL_DMA_Abort + 34
        0x08000c82:    6820         h      LDR      r0,[r4,#0]
        0x08000c84:    6800        .h      LDR      r0,[r0,#0]
        0x08000c86:    07c0        ..      LSLS     r0,r0,#31
        0x08000c88:    d1ee        ..      BNE      0x8000c68 ; HAL_DMA_Abort + 88
        0x08000c8a:    f894105c    ..\.    LDRB     r1,[r4,#0x5c]
        0x08000c8e:    203f        ?       MOVS     r0,#0x3f
        0x08000c90:    4088        .@      LSLS     r0,r0,r1
        0x08000c92:    60b8        .`      STR      r0,[r7,#8]
        0x08000c94:    2001        .       MOVS     r0,#1
        0x08000c96:    f8840035    ..5.    STRB     r0,[r4,#0x35]
        0x08000c9a:    f8845034    ..4P    STRB     r5,[r4,#0x34]
        0x08000c9e:    2000        .       MOVS     r0,#0
        0x08000ca0:    e7c7        ..      B        0x8000c32 ; HAL_DMA_Abort + 34
    i.HAL_DMA_Abort_IT
    HAL_DMA_Abort_IT
        0x08000ca2:    f8901035    ..5.    LDRB     r1,[r0,#0x35]
        0x08000ca6:    2902        .)      CMP      r1,#2
        0x08000ca8:    d003        ..      BEQ      0x8000cb2 ; HAL_DMA_Abort_IT + 16
        0x08000caa:    2180        .!      MOVS     r1,#0x80
        0x08000cac:    6541        Ae      STR      r1,[r0,#0x54]
        0x08000cae:    2001        .       MOVS     r0,#1
        0x08000cb0:    4770        pG      BX       lr
        0x08000cb2:    2105        .!      MOVS     r1,#5
        0x08000cb4:    f8801035    ..5.    STRB     r1,[r0,#0x35]
        0x08000cb8:    6800        .h      LDR      r0,[r0,#0]
        0x08000cba:    6801        .h      LDR      r1,[r0,#0]
        0x08000cbc:    f0210101    !...    BIC      r1,r1,#1
        0x08000cc0:    6001        .`      STR      r1,[r0,#0]
        0x08000cc2:    2000        .       MOVS     r0,#0
        0x08000cc4:    4770        pG      BX       lr
        0x08000cc6:    0000        ..      MOVS     r0,r0
    i.HAL_DMA_IRQHandler
    HAL_DMA_IRQHandler
        0x08000cc8:    e92d43f8    -..C    PUSH     {r3-r9,lr}
        0x08000ccc:    4604        .F      MOV      r4,r0
        0x08000cce:    f04f0900    O...    MOV      r9,#0
        0x08000cd2:    f8cd9000    ....    STR      r9,[sp,#0]
        0x08000cd6:    4863        cH      LDR      r0,[pc,#396] ; [0x8000e64] = 0x2000000c
        0x08000cd8:    f44f5116    O..Q    MOV      r1,#0x2580
        0x08000cdc:    6da5        .m      LDR      r5,[r4,#0x58]
        0x08000cde:    6800        .h      LDR      r0,[r0,#0]
        0x08000ce0:    fbb0f7f1    ....    UDIV     r7,r0,r1
        0x08000ce4:    682e        .h      LDR      r6,[r5,#0]
        0x08000ce6:    f894105c    ..\.    LDRB     r1,[r4,#0x5c]
        0x08000cea:    2008        .       MOVS     r0,#8
        0x08000cec:    fa00f101    ....    LSL      r1,r0,r1
        0x08000cf0:    4231        1B      TST      r1,r6
        0x08000cf2:    d00f        ..      BEQ      0x8000d14 ; HAL_DMA_IRQHandler + 76
        0x08000cf4:    6821        !h      LDR      r1,[r4,#0]
        0x08000cf6:    680a        .h      LDR      r2,[r1,#0]
        0x08000cf8:    0752        R.      LSLS     r2,r2,#29
        0x08000cfa:    d50b        ..      BPL      0x8000d14 ; HAL_DMA_IRQHandler + 76
        0x08000cfc:    680a        .h      LDR      r2,[r1,#0]
        0x08000cfe:    f0220204    "...    BIC      r2,r2,#4
        0x08000d02:    600a        .`      STR      r2,[r1,#0]
        0x08000d04:    f894105c    ..\.    LDRB     r1,[r4,#0x5c]
        0x08000d08:    4088        .@      LSLS     r0,r0,r1
        0x08000d0a:    60a8        .`      STR      r0,[r5,#8]
        0x08000d0c:    6d60        `m      LDR      r0,[r4,#0x54]
        0x08000d0e:    f0400001    @...    ORR      r0,r0,#1
        0x08000d12:    6560        `e      STR      r0,[r4,#0x54]
        0x08000d14:    f894105c    ..\.    LDRB     r1,[r4,#0x5c]
        0x08000d18:    f04f0801    O...    MOV      r8,#1
        0x08000d1c:    fa08f001    ....    LSL      r0,r8,r1
        0x08000d20:    4230        0B      TST      r0,r6
        0x08000d22:    d008        ..      BEQ      0x8000d36 ; HAL_DMA_IRQHandler + 110
        0x08000d24:    6821        !h      LDR      r1,[r4,#0]
        0x08000d26:    6949        Ii      LDR      r1,[r1,#0x14]
        0x08000d28:    0609        ..      LSLS     r1,r1,#24
        0x08000d2a:    d504        ..      BPL      0x8000d36 ; HAL_DMA_IRQHandler + 110
        0x08000d2c:    60a8        .`      STR      r0,[r5,#8]
        0x08000d2e:    6d60        `m      LDR      r0,[r4,#0x54]
        0x08000d30:    f0400002    @...    ORR      r0,r0,#2
        0x08000d34:    6560        `e      STR      r0,[r4,#0x54]
        0x08000d36:    f894105c    ..\.    LDRB     r1,[r4,#0x5c]
        0x08000d3a:    2004        .       MOVS     r0,#4
        0x08000d3c:    4088        .@      LSLS     r0,r0,r1
        0x08000d3e:    4230        0B      TST      r0,r6
        0x08000d40:    d008        ..      BEQ      0x8000d54 ; HAL_DMA_IRQHandler + 140
        0x08000d42:    6821        !h      LDR      r1,[r4,#0]
        0x08000d44:    6809        .h      LDR      r1,[r1,#0]
        0x08000d46:    0789        ..      LSLS     r1,r1,#30
        0x08000d48:    d504        ..      BPL      0x8000d54 ; HAL_DMA_IRQHandler + 140
        0x08000d4a:    60a8        .`      STR      r0,[r5,#8]
        0x08000d4c:    6d60        `m      LDR      r0,[r4,#0x54]
        0x08000d4e:    f0400004    @...    ORR      r0,r0,#4
        0x08000d52:    6560        `e      STR      r0,[r4,#0x54]
        0x08000d54:    f894105c    ..\.    LDRB     r1,[r4,#0x5c]
        0x08000d58:    2010        .       MOVS     r0,#0x10
        0x08000d5a:    4088        .@      LSLS     r0,r0,r1
        0x08000d5c:    4230        0B      TST      r0,r6
        0x08000d5e:    d018        ..      BEQ      0x8000d92 ; HAL_DMA_IRQHandler + 202
        0x08000d60:    6821        !h      LDR      r1,[r4,#0]
        0x08000d62:    6809        .h      LDR      r1,[r1,#0]
        0x08000d64:    0709        ..      LSLS     r1,r1,#28
        0x08000d66:    d514        ..      BPL      0x8000d92 ; HAL_DMA_IRQHandler + 202
        0x08000d68:    60a8        .`      STR      r0,[r5,#8]
        0x08000d6a:    6820         h      LDR      r0,[r4,#0]
        0x08000d6c:    6801        .h      LDR      r1,[r0,#0]
        0x08000d6e:    0349        I.      LSLS     r1,r1,#13
        0x08000d70:    d504        ..      BPL      0x8000d7c ; HAL_DMA_IRQHandler + 180
        0x08000d72:    6800        .h      LDR      r0,[r0,#0]
        0x08000d74:    0300        ..      LSLS     r0,r0,#12
        0x08000d76:    d508        ..      BPL      0x8000d8a ; HAL_DMA_IRQHandler + 194
        0x08000d78:    6ca1        .l      LDR      r1,[r4,#0x48]
        0x08000d7a:    e007        ..      B        0x8000d8c ; HAL_DMA_IRQHandler + 196
        0x08000d7c:    6801        .h      LDR      r1,[r0,#0]
        0x08000d7e:    05c9        ..      LSLS     r1,r1,#23
        0x08000d80:    d403        ..      BMI      0x8000d8a ; HAL_DMA_IRQHandler + 194
        0x08000d82:    6801        .h      LDR      r1,[r0,#0]
        0x08000d84:    f0210108    !...    BIC      r1,r1,#8
        0x08000d88:    6001        .`      STR      r1,[r0,#0]
        0x08000d8a:    6c21        !l      LDR      r1,[r4,#0x40]
        0x08000d8c:    b109        ..      CBZ      r1,0x8000d92 ; HAL_DMA_IRQHandler + 202
        0x08000d8e:    4620         F      MOV      r0,r4
        0x08000d90:    4788        .G      BLX      r1
        0x08000d92:    f894105c    ..\.    LDRB     r1,[r4,#0x5c]
        0x08000d96:    2020                MOVS     r0,#0x20
        0x08000d98:    4088        .@      LSLS     r0,r0,r1
        0x08000d9a:    4230        0B      TST      r0,r6
        0x08000d9c:    d031        1.      BEQ      0x8000e02 ; HAL_DMA_IRQHandler + 314
        0x08000d9e:    6821        !h      LDR      r1,[r4,#0]
        0x08000da0:    6809        .h      LDR      r1,[r1,#0]
        0x08000da2:    06c9        ..      LSLS     r1,r1,#27
        0x08000da4:    d52d        -.      BPL      0x8000e02 ; HAL_DMA_IRQHandler + 314
        0x08000da6:    60a8        .`      STR      r0,[r5,#8]
        0x08000da8:    f8940035    ..5.    LDRB     r0,[r4,#0x35]
        0x08000dac:    2805        .(      CMP      r0,#5
        0x08000dae:    6820         h      LDR      r0,[r4,#0]
        0x08000db0:    6801        .h      LDR      r1,[r0,#0]
        0x08000db2:    d006        ..      BEQ      0x8000dc2 ; HAL_DMA_IRQHandler + 250
        0x08000db4:    0349        I.      LSLS     r1,r1,#13
        0x08000db6:    d547        G.      BPL      0x8000e48 ; HAL_DMA_IRQHandler + 384
        0x08000db8:    6800        .h      LDR      r0,[r0,#0]
        0x08000dba:    0300        ..      LSLS     r0,r0,#12
        0x08000dbc:    d41d        ..      BMI      0x8000dfa ; HAL_DMA_IRQHandler + 306
        0x08000dbe:    6c61        al      LDR      r1,[r4,#0x44]
        0x08000dc0:    e01c        ..      B        0x8000dfc ; HAL_DMA_IRQHandler + 308
        0x08000dc2:    f0210116    !...    BIC      r1,r1,#0x16
        0x08000dc6:    6001        .`      STR      r1,[r0,#0]
        0x08000dc8:    6820         h      LDR      r0,[r4,#0]
        0x08000dca:    6941        Ai      LDR      r1,[r0,#0x14]
        0x08000dcc:    f0210180    !...    BIC      r1,r1,#0x80
        0x08000dd0:    6141        Aa      STR      r1,[r0,#0x14]
        0x08000dd2:    6c20         l      LDR      r0,[r4,#0x40]
        0x08000dd4:    b908        ..      CBNZ     r0,0x8000dda ; HAL_DMA_IRQHandler + 274
        0x08000dd6:    6ca0        .l      LDR      r0,[r4,#0x48]
        0x08000dd8:    b120         .      CBZ      r0,0x8000de4 ; HAL_DMA_IRQHandler + 284
        0x08000dda:    6820         h      LDR      r0,[r4,#0]
        0x08000ddc:    6801        .h      LDR      r1,[r0,#0]
        0x08000dde:    f0210108    !...    BIC      r1,r1,#8
        0x08000de2:    6001        .`      STR      r1,[r0,#0]
        0x08000de4:    f894105c    ..\.    LDRB     r1,[r4,#0x5c]
        0x08000de8:    203f        ?       MOVS     r0,#0x3f
        0x08000dea:    4088        .@      LSLS     r0,r0,r1
        0x08000dec:    60a8        .`      STR      r0,[r5,#8]
        0x08000dee:    f8848035    ..5.    STRB     r8,[r4,#0x35]
        0x08000df2:    f8849034    ..4.    STRB     r9,[r4,#0x34]
        0x08000df6:    6d21        !m      LDR      r1,[r4,#0x50]
        0x08000df8:    e01f        ..      B        0x8000e3a ; HAL_DMA_IRQHandler + 370
        0x08000dfa:    6be1        .k      LDR      r1,[r4,#0x3c]
        0x08000dfc:    b109        ..      CBZ      r1,0x8000e02 ; HAL_DMA_IRQHandler + 314
        0x08000dfe:    4620         F      MOV      r0,r4
        0x08000e00:    4788        .G      BLX      r1
        0x08000e02:    6d60        `m      LDR      r0,[r4,#0x54]
        0x08000e04:    2800        .(      CMP      r0,#0
        0x08000e06:    d02b        +.      BEQ      0x8000e60 ; HAL_DMA_IRQHandler + 408
        0x08000e08:    6d60        `m      LDR      r0,[r4,#0x54]
        0x08000e0a:    07c0        ..      LSLS     r0,r0,#31
        0x08000e0c:    d014        ..      BEQ      0x8000e38 ; HAL_DMA_IRQHandler + 368
        0x08000e0e:    2005        .       MOVS     r0,#5
        0x08000e10:    f8840035    ..5.    STRB     r0,[r4,#0x35]
        0x08000e14:    6820         h      LDR      r0,[r4,#0]
        0x08000e16:    6801        .h      LDR      r1,[r0,#0]
        0x08000e18:    f0210101    !...    BIC      r1,r1,#1
        0x08000e1c:    6001        .`      STR      r1,[r0,#0]
        0x08000e1e:    9800        ..      LDR      r0,[sp,#0]
        0x08000e20:    1c40        @.      ADDS     r0,r0,#1
        0x08000e22:    9000        ..      STR      r0,[sp,#0]
        0x08000e24:    42b8        .B      CMP      r0,r7
        0x08000e26:    d803        ..      BHI      0x8000e30 ; HAL_DMA_IRQHandler + 360
        0x08000e28:    6820         h      LDR      r0,[r4,#0]
        0x08000e2a:    6800        .h      LDR      r0,[r0,#0]
        0x08000e2c:    07c0        ..      LSLS     r0,r0,#31
        0x08000e2e:    d1f6        ..      BNE      0x8000e1e ; HAL_DMA_IRQHandler + 342
        0x08000e30:    f8848035    ..5.    STRB     r8,[r4,#0x35]
        0x08000e34:    f8849034    ..4.    STRB     r9,[r4,#0x34]
        0x08000e38:    6ce1        .l      LDR      r1,[r4,#0x4c]
        0x08000e3a:    2900        .)      CMP      r1,#0
        0x08000e3c:    d010        ..      BEQ      0x8000e60 ; HAL_DMA_IRQHandler + 408
        0x08000e3e:    b001        ..      ADD      sp,sp,#4
        0x08000e40:    4620         F      MOV      r0,r4
        0x08000e42:    e8bd43f0    ...C    POP      {r4-r9,lr}
        0x08000e46:    4708        .G      BX       r1
        0x08000e48:    6801        .h      LDR      r1,[r0,#0]
        0x08000e4a:    05c9        ..      LSLS     r1,r1,#23
        0x08000e4c:    d4d5        ..      BMI      0x8000dfa ; HAL_DMA_IRQHandler + 306
        0x08000e4e:    6801        .h      LDR      r1,[r0,#0]
        0x08000e50:    f0210110    !...    BIC      r1,r1,#0x10
        0x08000e54:    6001        .`      STR      r1,[r0,#0]
        0x08000e56:    f8848035    ..5.    STRB     r8,[r4,#0x35]
        0x08000e5a:    f8849034    ..4.    STRB     r9,[r4,#0x34]
        0x08000e5e:    e7cc        ..      B        0x8000dfa ; HAL_DMA_IRQHandler + 306
        0x08000e60:    e8bd83f8    ....    POP      {r3-r9,pc}
    $d
        0x08000e64:    2000000c    ...     DCD    536870924
    $t
    i.HAL_DMA_Init
    HAL_DMA_Init
        0x08000e68:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08000e6c:    4604        .F      MOV      r4,r0
        0x08000e6e:    f000fa3d    ..=.    BL       HAL_GetTick ; 0x80012ec
        0x08000e72:    4606        .F      MOV      r6,r0
        0x08000e74:    b15c        \.      CBZ      r4,0x8000e8e ; HAL_DMA_Init + 38
        0x08000e76:    2002        .       MOVS     r0,#2
        0x08000e78:    f8840035    ..5.    STRB     r0,[r4,#0x35]
        0x08000e7c:    2500        .%      MOVS     r5,#0
        0x08000e7e:    f8845034    ..4P    STRB     r5,[r4,#0x34]
        0x08000e82:    6820         h      LDR      r0,[r4,#0]
        0x08000e84:    6801        .h      LDR      r1,[r0,#0]
        0x08000e86:    f0210101    !...    BIC      r1,r1,#1
        0x08000e8a:    6001        .`      STR      r1,[r0,#0]
        0x08000e8c:    e00d        ..      B        0x8000eaa ; HAL_DMA_Init + 66
        0x08000e8e:    2001        .       MOVS     r0,#1
        0x08000e90:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x08000e94:    f000fa2a    ..*.    BL       HAL_GetTick ; 0x80012ec
        0x08000e98:    1b80        ..      SUBS     r0,r0,r6
        0x08000e9a:    2805        .(      CMP      r0,#5
        0x08000e9c:    d905        ..      BLS      0x8000eaa ; HAL_DMA_Init + 66
        0x08000e9e:    2020                MOVS     r0,#0x20
        0x08000ea0:    6560        `e      STR      r0,[r4,#0x54]
        0x08000ea2:    2003        .       MOVS     r0,#3
        0x08000ea4:    f8840035    ..5.    STRB     r0,[r4,#0x35]
        0x08000ea8:    e7f2        ..      B        0x8000e90 ; HAL_DMA_Init + 40
        0x08000eaa:    6820         h      LDR      r0,[r4,#0]
        0x08000eac:    6800        .h      LDR      r0,[r0,#0]
        0x08000eae:    07c0        ..      LSLS     r0,r0,#31
        0x08000eb0:    d1f0        ..      BNE      0x8000e94 ; HAL_DMA_Init + 44
        0x08000eb2:    6822        "h      LDR      r2,[r4,#0]
        0x08000eb4:    6811        .h      LDR      r1,[r2,#0]
        0x08000eb6:    4820         H      LDR      r0,[pc,#128] ; [0x8000f38] = 0xf010803f
        0x08000eb8:    4001        .@      ANDS     r1,r1,r0
        0x08000eba:    e9d40301    ....    LDRD     r0,r3,[r4,#4]
