tangbaishu/Personal/MDK-ARM/Out/STM32F407ZGT6_Embedded_V1.asm
        0x08000ebe:    4318        .C      ORRS     r0,r0,r3
        0x08000ec0:    e9d43603    ...6    LDRD     r3,r6,[r4,#0xc]
        0x08000ec4:    4333        3C      ORRS     r3,r3,r6
        0x08000ec6:    4318        .C      ORRS     r0,r0,r3
        0x08000ec8:    6963        ci      LDR      r3,[r4,#0x14]
        0x08000eca:    4318        .C      ORRS     r0,r0,r3
        0x08000ecc:    69a3        .i      LDR      r3,[r4,#0x18]
        0x08000ece:    4318        .C      ORRS     r0,r0,r3
        0x08000ed0:    69e3        .i      LDR      r3,[r4,#0x1c]
        0x08000ed2:    4318        .C      ORRS     r0,r0,r3
        0x08000ed4:    6a23        #j      LDR      r3,[r4,#0x20]
        0x08000ed6:    4318        .C      ORRS     r0,r0,r3
        0x08000ed8:    4308        .C      ORRS     r0,r0,r1
        0x08000eda:    6a61        aj      LDR      r1,[r4,#0x24]
        0x08000edc:    2904        .)      CMP      r1,#4
        0x08000ede:    d103        ..      BNE      0x8000ee8 ; HAL_DMA_Init + 128
        0x08000ee0:    e9d4130b    ....    LDRD     r1,r3,[r4,#0x2c]
        0x08000ee4:    4319        .C      ORRS     r1,r1,r3
        0x08000ee6:    4308        .C      ORRS     r0,r0,r1
        0x08000ee8:    6010        .`      STR      r0,[r2,#0]
        0x08000eea:    6820         h      LDR      r0,[r4,#0]
        0x08000eec:    6940        @i      LDR      r0,[r0,#0x14]
        0x08000eee:    6a66        fj      LDR      r6,[r4,#0x24]
        0x08000ef0:    f0200107     ...    BIC      r1,r0,#7
        0x08000ef4:    4630        0F      MOV      r0,r6
        0x08000ef6:    430e        .C      ORRS     r6,r6,r1
        0x08000ef8:    2701        .'      MOVS     r7,#1
        0x08000efa:    2804        .(      CMP      r0,#4
        0x08000efc:    d10c        ..      BNE      0x8000f18 ; HAL_DMA_Init + 176
        0x08000efe:    6aa0        .j      LDR      r0,[r4,#0x28]
        0x08000f00:    4306        .C      ORRS     r6,r6,r0
        0x08000f02:    6ae0        .j      LDR      r0,[r4,#0x2c]
        0x08000f04:    b140        @.      CBZ      r0,0x8000f18 ; HAL_DMA_Init + 176
        0x08000f06:    4620         F      MOV      r0,r4
        0x08000f08:    f7fffc76    ..v.    BL       DMA_CheckFifoParam ; 0x80007f8
        0x08000f0c:    b120         .      CBZ      r0,0x8000f18 ; HAL_DMA_Init + 176
        0x08000f0e:    2040        @       MOVS     r0,#0x40
        0x08000f10:    6560        `e      STR      r0,[r4,#0x54]
        0x08000f12:    f8847035    ..5p    STRB     r7,[r4,#0x35]
        0x08000f16:    e7ba        ..      B        0x8000e8e ; HAL_DMA_Init + 38
        0x08000f18:    6820         h      LDR      r0,[r4,#0]
        0x08000f1a:    6146        Fa      STR      r6,[r0,#0x14]
        0x08000f1c:    4620         F      MOV      r0,r4
        0x08000f1e:    f7fffc57    ..W.    BL       DMA_CalcBaseAndBitshift ; 0x80007d0
        0x08000f22:    f894205c    ..\     LDRB     r2,[r4,#0x5c]
        0x08000f26:    213f        ?!      MOVS     r1,#0x3f
        0x08000f28:    4091        .@      LSLS     r1,r1,r2
        0x08000f2a:    6081        .`      STR      r1,[r0,#8]
        0x08000f2c:    6565        ee      STR      r5,[r4,#0x54]
        0x08000f2e:    f8847035    ..5p    STRB     r7,[r4,#0x35]
        0x08000f32:    2000        .       MOVS     r0,#0
        0x08000f34:    e7ac        ..      B        0x8000e90 ; HAL_DMA_Init + 40
    $d
        0x08000f36:    0000        ..      DCW    0
        0x08000f38:    f010803f    ?...    DCD    4027613247
    $t
    i.HAL_DMA_Start_IT
    HAL_DMA_Start_IT
        0x08000f3c:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08000f40:    4604        .F      MOV      r4,r0
        0x08000f42:    6d86        .m      LDR      r6,[r0,#0x58]
        0x08000f44:    f8900034    ..4.    LDRB     r0,[r0,#0x34]
        0x08000f48:    2500        .%      MOVS     r5,#0
        0x08000f4a:    2801        .(      CMP      r0,#1
        0x08000f4c:    d00d        ..      BEQ      0x8000f6a ; HAL_DMA_Start_IT + 46
        0x08000f4e:    2001        .       MOVS     r0,#1
        0x08000f50:    f8840034    ..4.    STRB     r0,[r4,#0x34]
        0x08000f54:    f8947035    ..5p    LDRB     r7,[r4,#0x35]
        0x08000f58:    2000        .       MOVS     r0,#0
        0x08000f5a:    2f01        ./      CMP      r7,#1
        0x08000f5c:    d007        ..      BEQ      0x8000f6e ; HAL_DMA_Start_IT + 50
        0x08000f5e:    f8840034    ..4.    STRB     r0,[r4,#0x34]
        0x08000f62:    2502        .%      MOVS     r5,#2
        0x08000f64:    4628        (F      MOV      r0,r5
        0x08000f66:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x08000f6a:    2002        .       MOVS     r0,#2
        0x08000f6c:    e7fb        ..      B        0x8000f66 ; HAL_DMA_Start_IT + 42
        0x08000f6e:    2702        .'      MOVS     r7,#2
        0x08000f70:    f8847035    ..5p    STRB     r7,[r4,#0x35]
        0x08000f74:    6560        `e      STR      r0,[r4,#0x54]
        0x08000f76:    4620         F      MOV      r0,r4
        0x08000f78:    f7fffc68    ..h.    BL       DMA_SetConfig ; 0x800084c
        0x08000f7c:    f894105c    ..\.    LDRB     r1,[r4,#0x5c]
        0x08000f80:    203f        ?       MOVS     r0,#0x3f
        0x08000f82:    4088        .@      LSLS     r0,r0,r1
        0x08000f84:    60b0        .`      STR      r0,[r6,#8]
        0x08000f86:    6820         h      LDR      r0,[r4,#0]
        0x08000f88:    6801        .h      LDR      r1,[r0,#0]
        0x08000f8a:    f0410116    A...    ORR      r1,r1,#0x16
        0x08000f8e:    6001        .`      STR      r1,[r0,#0]
        0x08000f90:    6c20         l      LDR      r0,[r4,#0x40]
        0x08000f92:    b120         .      CBZ      r0,0x8000f9e ; HAL_DMA_Start_IT + 98
        0x08000f94:    6820         h      LDR      r0,[r4,#0]
        0x08000f96:    6801        .h      LDR      r1,[r0,#0]
        0x08000f98:    f0410108    A...    ORR      r1,r1,#8
        0x08000f9c:    6001        .`      STR      r1,[r0,#0]
        0x08000f9e:    6820         h      LDR      r0,[r4,#0]
        0x08000fa0:    6801        .h      LDR      r1,[r0,#0]
        0x08000fa2:    f0410101    A...    ORR      r1,r1,#1
        0x08000fa6:    6001        .`      STR      r1,[r0,#0]
        0x08000fa8:    e7dc        ..      B        0x8000f64 ; HAL_DMA_Start_IT + 40
        0x08000faa:    0000        ..      MOVS     r0,r0
    i.HAL_Delay
    HAL_Delay
        0x08000fac:    e92d5ff0    -.._    PUSH     {r4-r12,lr}
        0x08000fb0:    4604        .F      MOV      r4,r0
        0x08000fb2:    f000f99b    ....    BL       HAL_GetTick ; 0x80012ec
        0x08000fb6:    4605        .F      MOV      r5,r0
        0x08000fb8:    1c60        `.      ADDS     r0,r4,#1
        0x08000fba:    d002        ..      BEQ      0x8000fc2 ; HAL_Delay + 22
        0x08000fbc:    480d        .H      LDR      r0,[pc,#52] ; [0x8000ff4] = 0x20000000
        0x08000fbe:    7800        .x      LDRB     r0,[r0,#0]
        0x08000fc0:    4404        .D      ADD      r4,r4,r0
        0x08000fc2:    2600        .&      MOVS     r6,#0
        0x08000fc4:    f8df8030    ..0.    LDR      r8,[pc,#48] ; [0x8000ff8] = 0x40002c00
        0x08000fc8:    f8df9030    ..0.    LDR      r9,[pc,#48] ; [0x8000ffc] = 0x20000014
        0x08000fcc:    f8dfb030    ..0.    LDR      r11,[pc,#48] ; [0x8001000] = 0x40003000
        0x08000fd0:    27fe        .'      MOVS     r7,#0xfe
        0x08000fd2:    f64a2aaa    J..*    MOV      r10,#0xaaaa
        0x08000fd6:    bf00        ..      NOP      
        0x08000fd8:    f000f988    ....    BL       HAL_GetTick ; 0x80012ec
        0x08000fdc:    1b40        @.      SUBS     r0,r0,r5
        0x08000fde:    42a0        .B      CMP      r0,r4
        0x08000fe0:    d206        ..      BCS      0x8000ff0 ; HAL_Delay + 68
        0x08000fe2:    f8c87000    ...p    STR      r7,[r8,#0]
        0x08000fe6:    f8896000    ...`    STRB     r6,[r9,#0]
        0x08000fea:    f8cba000    ....    STR      r10,[r11,#0]
        0x08000fee:    e7f3        ..      B        0x8000fd8 ; HAL_Delay + 44
        0x08000ff0:    e8bd9ff0    ....    POP      {r4-r12,pc}
    $d
        0x08000ff4:    20000000    ...     DCD    536870912
        0x08000ff8:    40002c00    .,.@    DCD    1073753088
        0x08000ffc:    20000014    ...     DCD    536870932
        0x08001000:    40003000    .0.@    DCD    1073754112
    $t
    i.HAL_ETH_ErrorCallback
    HAL_ETH_ErrorCallback
        0x08001004:    4770        pG      BX       lr
        0x08001006:    0000        ..      MOVS     r0,r0
    i.HAL_ETH_IRQHandler
    HAL_ETH_IRQHandler
        0x08001008:    b510        ..      PUSH     {r4,lr}
        0x0800100a:    4604        .F      MOV      r4,r0
        0x0800100c:    6800        .h      LDR      r0,[r0,#0]
        0x0800100e:    f5005080    ...P    ADD      r0,r0,#0x1000
        0x08001012:    6941        Ai      LDR      r1,[r0,#0x14]
        0x08001014:    0649        I.      LSLS     r1,r1,#25
        0x08001016:    d507        ..      BPL      0x8001028 ; HAL_ETH_IRQHandler + 32
        0x08001018:    69c1        .i      LDR      r1,[r0,#0x1c]
        0x0800101a:    0649        I.      LSLS     r1,r1,#25
        0x0800101c:    d504        ..      BPL      0x8001028 ; HAL_ETH_IRQHandler + 32
        0x0800101e:    492b        +I      LDR      r1,[pc,#172] ; [0x80010cc] = 0x10040
        0x08001020:    6141        Aa      STR      r1,[r0,#0x14]
        0x08001022:    4620         F      MOV      r0,r4
        0x08001024:    f000f859    ..Y.    BL       HAL_ETH_RxCpltCallback ; 0x80010da
        0x08001028:    6820         h      LDR      r0,[r4,#0]
        0x0800102a:    f5005080    ...P    ADD      r0,r0,#0x1000
        0x0800102e:    6941        Ai      LDR      r1,[r0,#0x14]
        0x08001030:    07c9        ..      LSLS     r1,r1,#31
        0x08001032:    d008        ..      BEQ      0x8001046 ; HAL_ETH_IRQHandler + 62
        0x08001034:    69c1        .i      LDR      r1,[r0,#0x1c]
        0x08001036:    07c9        ..      LSLS     r1,r1,#31
        0x08001038:    d005        ..      BEQ      0x8001046 ; HAL_ETH_IRQHandler + 62
        0x0800103a:    f04f1101    O...    MOV      r1,#0x10001
        0x0800103e:    6141        Aa      STR      r1,[r0,#0x14]
        0x08001040:    4620         F      MOV      r0,r4
        0x08001042:    f000f84b    ..K.    BL       HAL_ETH_TxCpltCallback ; 0x80010dc
        0x08001046:    6820         h      LDR      r0,[r4,#0]
        0x08001048:    f5005080    ...P    ADD      r0,r0,#0x1000
        0x0800104c:    6941        Ai      LDR      r1,[r0,#0x14]
        0x0800104e:    0409        ..      LSLS     r1,r1,#16
        0x08001050:    d522        ".      BPL      0x8001098 ; HAL_ETH_IRQHandler + 144
        0x08001052:    69c1        .i      LDR      r1,[r0,#0x1c]
        0x08001054:    0409        ..      LSLS     r1,r1,#16
        0x08001056:    d51f        ..      BPL      0x8001098 ; HAL_ETH_IRQHandler + 144
        0x08001058:    f8d41088    ....    LDR      r1,[r4,#0x88]
        0x0800105c:    f0410108    A...    ORR      r1,r1,#8
        0x08001060:    f8c41088    ....    STR      r1,[r4,#0x88]
        0x08001064:    6941        Ai      LDR      r1,[r0,#0x14]
        0x08001066:    0489        ..      LSLS     r1,r1,#18
        0x08001068:    d50c        ..      BPL      0x8001084 ; HAL_ETH_IRQHandler + 124
        0x0800106a:    6941        Ai      LDR      r1,[r0,#0x14]
        0x0800106c:    4a18        .J      LDR      r2,[pc,#96] ; [0x80010d0] = 0x7e2000
        0x0800106e:    4011        .@      ANDS     r1,r1,r2
        0x08001070:    f8c4108c    ....    STR      r1,[r4,#0x8c]
        0x08001074:    69c1        .i      LDR      r1,[r0,#0x1c]
        0x08001076:    f42131c0    !..1    BIC      r1,r1,#0x18000
        0x0800107a:    61c1        .a      STR      r1,[r0,#0x1c]
        0x0800107c:    20e0        .       MOVS     r0,#0xe0
        0x0800107e:    f8c40084    ....    STR      r0,[r4,#0x84]
        0x08001082:    e006        ..      B        0x8001092 ; HAL_ETH_IRQHandler + 138
        0x08001084:    6942        Bi      LDR      r2,[r0,#0x14]
        0x08001086:    f2486180    H..a    MOV      r1,#0x8680
        0x0800108a:    400a        .@      ANDS     r2,r2,r1
        0x0800108c:    f8c4208c    ...     STR      r2,[r4,#0x8c]
        0x08001090:    6141        Aa      STR      r1,[r0,#0x14]
        0x08001092:    4620         F      MOV      r0,r4
        0x08001094:    f7ffffb6    ....    BL       HAL_ETH_ErrorCallback ; 0x8001004
        0x08001098:    6820         h      LDR      r0,[r4,#0]
        0x0800109a:    6b81        .k      LDR      r1,[r0,#0x38]
        0x0800109c:    0709        ..      LSLS     r1,r1,#28
        0x0800109e:    d50a        ..      BPL      0x80010b6 ; HAL_ETH_IRQHandler + 174
        0x080010a0:    6ac0        .j      LDR      r0,[r0,#0x2c]
        0x080010a2:    f0000060    ..`.    AND      r0,r0,#0x60
        0x080010a6:    f8c40094    ....    STR      r0,[r4,#0x94]
        0x080010aa:    4620         F      MOV      r0,r4
        0x080010ac:    f000f814    ....    BL       HAL_ETH_PMTCallback ; 0x80010d8
        0x080010b0:    2000        .       MOVS     r0,#0
        0x080010b2:    f8c40094    ....    STR      r0,[r4,#0x94]
        0x080010b6:    4807        .H      LDR      r0,[pc,#28] ; [0x80010d4] = 0x40013c14
        0x080010b8:    6801        .h      LDR      r1,[r0,#0]
        0x080010ba:    0309        ..      LSLS     r1,r1,#12
        0x080010bc:    d505        ..      BPL      0x80010ca ; HAL_ETH_IRQHandler + 194
        0x080010be:    f44f2100    O..!    MOV      r1,#0x80000
        0x080010c2:    6001        .`      STR      r1,[r0,#0]
        0x080010c4:    4620         F      MOV      r0,r4
        0x080010c6:    f000f80a    ....    BL       HAL_ETH_WakeUpCallback ; 0x80010de
        0x080010ca:    bd10        ..      POP      {r4,pc}
    $d
        0x080010cc:    00010040    @...    DCD    65600
        0x080010d0:    007e2000    . ~.    DCD    8265728
        0x080010d4:    40013c14    .<.@    DCD    1073822740
    $t
    i.HAL_ETH_PMTCallback
    HAL_ETH_PMTCallback
        0x080010d8:    4770        pG      BX       lr
    i.HAL_ETH_RxCpltCallback
    HAL_ETH_RxCpltCallback
        0x080010da:    4770        pG      BX       lr
    i.HAL_ETH_TxCpltCallback
    HAL_ETH_TxCpltCallback
        0x080010dc:    4770        pG      BX       lr
    i.HAL_ETH_WakeUpCallback
    HAL_ETH_WakeUpCallback
        0x080010de:    4770        pG      BX       lr
    i.HAL_GPIO_Init
    HAL_GPIO_Init
        0x080010e0:    e92d4ff8    -..O    PUSH     {r3-r11,lr}
        0x080010e4:    f8dfa1bc    ....    LDR      r10,[pc,#444] ; [0x80012a4] = 0x40013c08
        0x080010e8:    2200        ."      MOVS     r2,#0
        0x080010ea:    2501        .%      MOVS     r5,#1
        0x080010ec:    2603        .&      MOVS     r6,#3
        0x080010ee:    f04f090f    O...    MOV      r9,#0xf
        0x080010f2:    f10a0b04    ....    ADD      r11,r10,#4
        0x080010f6:    f1aa0e04    ....    SUB      lr,r10,#4
        0x080010fa:    bf00        ..      NOP      
        0x080010fc:    680b        .h      LDR      r3,[r1,#0]
        0x080010fe:    fa05f402    ....    LSL      r4,r5,r2
        0x08001102:    4023        #@      ANDS     r3,r3,r4
        0x08001104:    42a3        .B      CMP      r3,r4
        0x08001106:    d170        p.      BNE      0x80011ea ; HAL_GPIO_Init + 266
        0x08001108:    790f        .y      LDRB     r7,[r1,#4]
        0x0800110a:    f0070703    ....    AND      r7,r7,#3
        0x0800110e:    2f01        ./      CMP      r7,#1
        0x08001110:    d001        ..      BEQ      0x8001116 ; HAL_GPIO_Init + 54
        0x08001112:    2f02        ./      CMP      r7,#2
        0x08001114:    d116        ..      BNE      0x8001144 ; HAL_GPIO_Init + 100
        0x08001116:    6887        .h      LDR      r7,[r0,#8]
        0x08001118:    ea4f0842    O.B.    LSL      r8,r2,#1
        0x0800111c:    fa06fc08    ....    LSL      r12,r6,r8
        0x08001120:    ea27070c    '...    BIC      r7,r7,r12
        0x08001124:    f8d1c00c    ....    LDR      r12,[r1,#0xc]
        0x08001128:    fa0cfc08    ....    LSL      r12,r12,r8
        0x0800112c:    ea4c0c07    L...    ORR      r12,r12,r7
        0x08001130:    f8c0c008    ....    STR      r12,[r0,#8]
        0x08001134:    6847        Gh      LDR      r7,[r0,#4]
        0x08001136:    43a7        .C      BICS     r7,r7,r4
        0x08001138:    790c        .y      LDRB     r4,[r1,#4]
        0x0800113a:    f3c41400    ....    UBFX     r4,r4,#4,#1
        0x0800113e:    4094        .@      LSLS     r4,r4,r2
        0x08001140:    433c        <C      ORRS     r4,r4,r7
        0x08001142:    6044        D`      STR      r4,[r0,#4]
        0x08001144:    790c        .y      LDRB     r4,[r1,#4]
        0x08001146:    43e4        .C      MVNS     r4,r4
        0x08001148:    07a4        ..      LSLS     r4,r4,#30
        0x0800114a:    d00a        ..      BEQ      0x8001162 ; HAL_GPIO_Init + 130
        0x0800114c:    68c4        .h      LDR      r4,[r0,#0xc]
        0x0800114e:    ea4f0c42    O.B.    LSL      r12,r2,#1
        0x08001152:    fa06f70c    ....    LSL      r7,r6,r12
        0x08001156:    43bc        .C      BICS     r4,r4,r7
        0x08001158:    688f        .h      LDR      r7,[r1,#8]
        0x0800115a:    fa07f70c    ....    LSL      r7,r7,r12
        0x0800115e:    4327        'C      ORRS     r7,r7,r4
        0x08001160:    60c7        .`      STR      r7,[r0,#0xc]
        0x08001162:    790c        .y      LDRB     r4,[r1,#4]
        0x08001164:    f0040403    ....    AND      r4,r4,#3
        0x08001168:    2c02        .,      CMP      r4,#2
        0x0800116a:    d112        ..      BNE      0x8001192 ; HAL_GPIO_Init + 178
        0x0800116c:    08d4        ..      LSRS     r4,r2,#3
        0x0800116e:    eb000c84    ....    ADD      r12,r0,r4,LSL #2
        0x08001172:    f8dc4020    .. @    LDR      r4,[r12,#0x20]
        0x08001176:    0757        W.      LSLS     r7,r2,#29
        0x08001178:    0eff        ..      LSRS     r7,r7,#27
        0x0800117a:    fa09f807    ....    LSL      r8,r9,r7
        0x0800117e:    ea240408    $...    BIC      r4,r4,r8
        0x08001182:    f8d18010    ....    LDR      r8,[r1,#0x10]
        0x08001186:    fa08f807    ....    LSL      r8,r8,r7
        0x0800118a:    ea480804    H...    ORR      r8,r8,r4
        0x0800118e:    f8cc8020    .. .    STR      r8,[r12,#0x20]
        0x08001192:    6804        .h      LDR      r4,[r0,#0]
        0x08001194:    ea4f0c42    O.B.    LSL      r12,r2,#1
        0x08001198:    fa06f70c    ....    LSL      r7,r6,r12
        0x0800119c:    43bc        .C      BICS     r4,r4,r7
        0x0800119e:    790f        .y      LDRB     r7,[r1,#4]
        0x080011a0:    f0070703    ....    AND      r7,r7,#3
        0x080011a4:    fa07f70c    ....    LSL      r7,r7,r12
        0x080011a8:    4327        'C      ORRS     r7,r7,r4
        0x080011aa:    6007        .`      STR      r7,[r0,#0]
        0x080011ac:    684c        Lh      LDR      r4,[r1,#4]
        0x080011ae:    f4143f40    ..@?    TST      r4,#0x30000
        0x080011b2:    d070        p.      BEQ      0x8001296 ; HAL_GPIO_Init + 438
        0x080011b4:    4c3c        <L      LDR      r4,[pc,#240] ; [0x80012a8] = 0x40023844
        0x080011b6:    6827        'h      LDR      r7,[r4,#0]
        0x080011b8:    f4474780    G..G    ORR      r7,r7,#0x4000
        0x080011bc:    6027        '`      STR      r7,[r4,#0]
        0x080011be:    6824        $h      LDR      r4,[r4,#0]
        0x080011c0:    f0220703    "...    BIC      r7,r2,#3
        0x080011c4:    f4044480    ...D    AND      r4,r4,#0x4000
        0x080011c8:    9400        ..      STR      r4,[sp,#0]
        0x080011ca:    4c38        8L      LDR      r4,[pc,#224] ; [0x80012ac] = 0x40013000
        0x080011cc:    eb070c04    ....    ADD      r12,r7,r4
        0x080011d0:    f8dc4808    ...H    LDR      r4,[r12,#0x808]
        0x080011d4:    0797        ..      LSLS     r7,r2,#30
        0x080011d6:    ea4f7817    O..x    LSR      r8,r7,#28
        0x080011da:    fa09f708    ....    LSL      r7,r9,r8
        0x080011de:    43bc        .C      BICS     r4,r4,r7
        0x080011e0:    4f33        3O      LDR      r7,[pc,#204] ; [0x80012b0] = 0x40020000
        0x080011e2:    42b8        .B      CMP      r0,r7
        0x080011e4:    d102        ..      BNE      0x80011ec ; HAL_GPIO_Init + 268
        0x080011e6:    2700        .'      MOVS     r7,#0
        0x080011e8:    e024        $.      B        0x8001234 ; HAL_GPIO_Init + 340
        0x080011ea:    e054        T.      B        0x8001296 ; HAL_GPIO_Init + 438
        0x080011ec:    4f31        1O      LDR      r7,[pc,#196] ; [0x80012b4] = 0x40020400
        0x080011ee:    42b8        .B      CMP      r0,r7
        0x080011f0:    d101        ..      BNE      0x80011f6 ; HAL_GPIO_Init + 278
        0x080011f2:    2701        .'      MOVS     r7,#1
        0x080011f4:    e01e        ..      B        0x8001234 ; HAL_GPIO_Init + 340
        0x080011f6:    4f30        0O      LDR      r7,[pc,#192] ; [0x80012b8] = 0x40020800
        0x080011f8:    42b8        .B      CMP      r0,r7
        0x080011fa:    d101        ..      BNE      0x8001200 ; HAL_GPIO_Init + 288
        0x080011fc:    2702        .'      MOVS     r7,#2
        0x080011fe:    e019        ..      B        0x8001234 ; HAL_GPIO_Init + 340
        0x08001200:    4f2e        .O      LDR      r7,[pc,#184] ; [0x80012bc] = 0x40020c00
        0x08001202:    42b8        .B      CMP      r0,r7
        0x08001204:    d101        ..      BNE      0x800120a ; HAL_GPIO_Init + 298
        0x08001206:    2703        .'      MOVS     r7,#3
        0x08001208:    e014        ..      B        0x8001234 ; HAL_GPIO_Init + 340
        0x0800120a:    4f2d        -O      LDR      r7,[pc,#180] ; [0x80012c0] = 0x40021000
        0x0800120c:    42b8        .B      CMP      r0,r7
        0x0800120e:    d101        ..      BNE      0x8001214 ; HAL_GPIO_Init + 308
        0x08001210:    2704        .'      MOVS     r7,#4
        0x08001212:    e00f        ..      B        0x8001234 ; HAL_GPIO_Init + 340
        0x08001214:    4f2b        +O      LDR      r7,[pc,#172] ; [0x80012c4] = 0x40021400
        0x08001216:    42b8        .B      CMP      r0,r7
        0x08001218:    d101        ..      BNE      0x800121e ; HAL_GPIO_Init + 318
        0x0800121a:    2705        .'      MOVS     r7,#5
        0x0800121c:    e00a        ..      B        0x8001234 ; HAL_GPIO_Init + 340
        0x0800121e:    4f2a        *O      LDR      r7,[pc,#168] ; [0x80012c8] = 0x40021800
        0x08001220:    42b8        .B      CMP      r0,r7
        0x08001222:    d101        ..      BNE      0x8001228 ; HAL_GPIO_Init + 328
        0x08001224:    2706        .'      MOVS     r7,#6
        0x08001226:    e005        ..      B        0x8001234 ; HAL_GPIO_Init + 340
        0x08001228:    4f28        (O      LDR      r7,[pc,#160] ; [0x80012cc] = 0x40021c00
        0x0800122a:    42b8        .B      CMP      r0,r7
        0x0800122c:    d101        ..      BNE      0x8001232 ; HAL_GPIO_Init + 338
        0x0800122e:    2707        .'      MOVS     r7,#7
        0x08001230:    e000        ..      B        0x8001234 ; HAL_GPIO_Init + 340
        0x08001232:    2708        .'      MOVS     r7,#8
        0x08001234:    fa07f708    ....    LSL      r7,r7,r8
        0x08001238:    4327        'C      ORRS     r7,r7,r4
        0x0800123a:    f8cc7808    ...x    STR      r7,[r12,#0x808]
        0x0800123e:    f8da4000    ...@    LDR      r4,[r10,#0]
        0x08001242:    4657        WF      MOV      r7,r10
        0x08001244:    f8d1c004    ....    LDR      r12,[r1,#4]
