tangbaishu/Personal/MDK-ARM/Out/STM32F407ZGT6_Embedded_V1.asm
        0x08001248:    439c        .C      BICS     r4,r4,r3
        0x0800124a:    ea5f2ccc    _..,    LSLS     r12,r12,#11
        0x0800124e:    d500        ..      BPL      0x8001252 ; HAL_GPIO_Init + 370
        0x08001250:    431c        .C      ORRS     r4,r4,r3
        0x08001252:    603c        <`      STR      r4,[r7,#0]
        0x08001254:    f8db4000    ...@    LDR      r4,[r11,#0]
        0x08001258:    465f        _F      MOV      r7,r11
        0x0800125a:    f8d1c004    ....    LDR      r12,[r1,#4]
        0x0800125e:    439c        .C      BICS     r4,r4,r3
        0x08001260:    ea5f2c8c    _..,    LSLS     r12,r12,#10
        0x08001264:    d500        ..      BPL      0x8001268 ; HAL_GPIO_Init + 392
        0x08001266:    431c        .C      ORRS     r4,r4,r3
        0x08001268:    603c        <`      STR      r4,[r7,#0]
        0x0800126a:    f8de4000    ...@    LDR      r4,[lr,#0]
        0x0800126e:    4677        wF      MOV      r7,lr
        0x08001270:    f8d1c004    ....    LDR      r12,[r1,#4]
        0x08001274:    439c        .C      BICS     r4,r4,r3
        0x08001276:    ea5f3c8c    _..<    LSLS     r12,r12,#14
        0x0800127a:    d500        ..      BPL      0x800127e ; HAL_GPIO_Init + 414
        0x0800127c:    431c        .C      ORRS     r4,r4,r3
        0x0800127e:    603c        <`      STR      r4,[r7,#0]
        0x08001280:    4f08        .O      LDR      r7,[pc,#32] ; [0x80012a4] = 0x40013c08
        0x08001282:    3f08        .?      SUBS     r7,r7,#8
        0x08001284:    683c        <h      LDR      r4,[r7,#0]
        0x08001286:    f8d1c004    ....    LDR      r12,[r1,#4]
        0x0800128a:    439c        .C      BICS     r4,r4,r3
        0x0800128c:    ea5f3ccc    _..<    LSLS     r12,r12,#15
        0x08001290:    d500        ..      BPL      0x8001294 ; HAL_GPIO_Init + 436
        0x08001292:    431c        .C      ORRS     r4,r4,r3
        0x08001294:    603c        <`      STR      r4,[r7,#0]
        0x08001296:    1c52        R.      ADDS     r2,r2,#1
        0x08001298:    2a10        .*      CMP      r2,#0x10
        0x0800129a:    f4ffaf2f    ../.    BCC      0x80010fc ; HAL_GPIO_Init + 28
        0x0800129e:    e8bd8ff8    ....    POP      {r3-r11,pc}
    $d
        0x080012a2:    0000        ..      DCW    0
        0x080012a4:    40013c08    .<.@    DCD    1073822728
        0x080012a8:    40023844    D8.@    DCD    1073887300
        0x080012ac:    40013000    .0.@    DCD    1073819648
        0x080012b0:    40020000    ...@    DCD    1073872896
        0x080012b4:    40020400    ...@    DCD    1073873920
        0x080012b8:    40020800    ...@    DCD    1073874944
        0x080012bc:    40020c00    ...@    DCD    1073875968
        0x080012c0:    40021000    ...@    DCD    1073876992
        0x080012c4:    40021400    ...@    DCD    1073878016
        0x080012c8:    40021800    ...@    DCD    1073879040
        0x080012cc:    40021c00    ...@    DCD    1073880064
    $t
    i.HAL_GPIO_TogglePin
    HAL_GPIO_TogglePin
        0x080012d0:    6942        Bi      LDR      r2,[r0,#0x14]
        0x080012d2:    ea210302    !...    BIC      r3,r1,r2
        0x080012d6:    400a        .@      ANDS     r2,r2,r1
        0x080012d8:    ea434102    C..A    ORR      r1,r3,r2,LSL #16
        0x080012dc:    6181        .a      STR      r1,[r0,#0x18]
        0x080012de:    4770        pG      BX       lr
    i.HAL_GPIO_WritePin
    HAL_GPIO_WritePin
        0x080012e0:    b10a        ..      CBZ      r2,0x80012e6 ; HAL_GPIO_WritePin + 6
        0x080012e2:    6181        .a      STR      r1,[r0,#0x18]
        0x080012e4:    4770        pG      BX       lr
        0x080012e6:    0409        ..      LSLS     r1,r1,#16
        0x080012e8:    e7fb        ..      B        0x80012e2 ; HAL_GPIO_WritePin + 2
        0x080012ea:    0000        ..      MOVS     r0,r0
    i.HAL_GetTick
    HAL_GetTick
        0x080012ec:    4801        .H      LDR      r0,[pc,#4] ; [0x80012f4] = 0x20000000
        0x080012ee:    6880        .h      LDR      r0,[r0,#8]
        0x080012f0:    4770        pG      BX       lr
    $d
        0x080012f2:    0000        ..      DCW    0
        0x080012f4:    20000000    ...     DCD    536870912
    $t
    i.HAL_IncTick
    HAL_IncTick
        0x080012f8:    4802        .H      LDR      r0,[pc,#8] ; [0x8001304] = 0x20000000
        0x080012fa:    6881        .h      LDR      r1,[r0,#8]
        0x080012fc:    7802        .x      LDRB     r2,[r0,#0]
        0x080012fe:    4411        .D      ADD      r1,r1,r2
        0x08001300:    6081        .`      STR      r1,[r0,#8]
        0x08001302:    4770        pG      BX       lr
    $d
        0x08001304:    20000000    ...     DCD    536870912
    $t
    i.HAL_Init
    HAL_Init
        0x08001308:    480b        .H      LDR      r0,[pc,#44] ; [0x8001338] = 0x40023c00
        0x0800130a:    b510        ..      PUSH     {r4,lr}
        0x0800130c:    6801        .h      LDR      r1,[r0,#0]
        0x0800130e:    f4417100    A..q    ORR      r1,r1,#0x200
        0x08001312:    6001        .`      STR      r1,[r0,#0]
        0x08001314:    6801        .h      LDR      r1,[r0,#0]
        0x08001316:    f4416180    A..a    ORR      r1,r1,#0x400
        0x0800131a:    6001        .`      STR      r1,[r0,#0]
        0x0800131c:    6801        .h      LDR      r1,[r0,#0]
        0x0800131e:    f4417180    A..q    ORR      r1,r1,#0x100
        0x08001322:    6001        .`      STR      r1,[r0,#0]
        0x08001324:    2007        .       MOVS     r0,#7
        0x08001326:    f000f86f    ..o.    BL       HAL_NVIC_SetPriorityGrouping ; 0x8001408
        0x0800132a:    200f        .       MOVS     r0,#0xf
        0x0800132c:    f000f806    ....    BL       HAL_InitTick ; 0x800133c
        0x08001330:    f000f824    ..$.    BL       HAL_MspInit ; 0x800137c
        0x08001334:    2000        .       MOVS     r0,#0
        0x08001336:    bd10        ..      POP      {r4,pc}
    $d
        0x08001338:    40023c00    .<.@    DCD    1073888256
    $t
    i.HAL_InitTick
    HAL_InitTick
        0x0800133c:    b570        p.      PUSH     {r4-r6,lr}
        0x0800133e:    4d0d        .M      LDR      r5,[pc,#52] ; [0x8001374] = 0x20000000
        0x08001340:    4604        .F      MOV      r4,r0
        0x08001342:    f44f717a    O.zq    MOV      r1,#0x3e8
        0x08001346:    7828        (x      LDRB     r0,[r5,#0]
        0x08001348:    fbb1f0f0    ....    UDIV     r0,r1,r0
        0x0800134c:    490a        .I      LDR      r1,[pc,#40] ; [0x8001378] = 0x2000000c
        0x0800134e:    6809        .h      LDR      r1,[r1,#0]
        0x08001350:    fbb1f0f0    ....    UDIV     r0,r1,r0
        0x08001354:    f000fb0a    ....    BL       HAL_SYSTICK_Config ; 0x800196c
        0x08001358:    b948        H.      CBNZ     r0,0x800136e ; HAL_InitTick + 50
        0x0800135a:    2c10        .,      CMP      r4,#0x10
        0x0800135c:    d207        ..      BCS      0x800136e ; HAL_InitTick + 50
        0x0800135e:    2200        ."      MOVS     r2,#0
        0x08001360:    4621        !F      MOV      r1,r4
        0x08001362:    1e50        P.      SUBS     r0,r2,#1
        0x08001364:    f000f830    ..0.    BL       HAL_NVIC_SetPriority ; 0x80013c8
        0x08001368:    2000        .       MOVS     r0,#0
        0x0800136a:    606c        l`      STR      r4,[r5,#4]
        0x0800136c:    bd70        p.      POP      {r4-r6,pc}
        0x0800136e:    2001        .       MOVS     r0,#1
        0x08001370:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x08001372:    0000        ..      DCW    0
        0x08001374:    20000000    ...     DCD    536870912
        0x08001378:    2000000c    ...     DCD    536870924
    $t
    i.HAL_MspInit
    HAL_MspInit
        0x0800137c:    480a        .H      LDR      r0,[pc,#40] ; [0x80013a8] = 0x40023844
        0x0800137e:    b508        ..      PUSH     {r3,lr}
        0x08001380:    6801        .h      LDR      r1,[r0,#0]
        0x08001382:    f4414180    A..A    ORR      r1,r1,#0x4000
        0x08001386:    6001        .`      STR      r1,[r0,#0]
        0x08001388:    6800        .h      LDR      r0,[r0,#0]
        0x0800138a:    f4004080    ...@    AND      r0,r0,#0x4000
        0x0800138e:    9000        ..      STR      r0,[sp,#0]
        0x08001390:    4805        .H      LDR      r0,[pc,#20] ; [0x80013a8] = 0x40023844
        0x08001392:    1f00        ..      SUBS     r0,r0,#4
        0x08001394:    6801        .h      LDR      r1,[r0,#0]
        0x08001396:    f0415180    A..Q    ORR      r1,r1,#0x10000000
        0x0800139a:    6001        .`      STR      r1,[r0,#0]
        0x0800139c:    6800        .h      LDR      r0,[r0,#0]
        0x0800139e:    f0005080    ...P    AND      r0,r0,#0x10000000
        0x080013a2:    9000        ..      STR      r0,[sp,#0]
        0x080013a4:    bd08        ..      POP      {r3,pc}
    $d
        0x080013a6:    0000        ..      DCW    0
        0x080013a8:    40023844    D8.@    DCD    1073887300
    $t
    i.HAL_NVIC_EnableIRQ
    HAL_NVIC_EnableIRQ
        0x080013ac:    2800        .(      CMP      r0,#0
        0x080013ae:    db09        ..      BLT      0x80013c4 ; HAL_NVIC_EnableIRQ + 24
        0x080013b0:    f000021f    ....    AND      r2,r0,#0x1f
        0x080013b4:    2101        .!      MOVS     r1,#1
        0x080013b6:    4091        .@      LSLS     r1,r1,r2
        0x080013b8:    0940        @.      LSRS     r0,r0,#5
        0x080013ba:    0080        ..      LSLS     r0,r0,#2
        0x080013bc:    f10020e0    ...     ADD      r0,r0,#0xe000e000
        0x080013c0:    f8c01100    ....    STR      r1,[r0,#0x100]
        0x080013c4:    4770        pG      BX       lr
        0x080013c6:    0000        ..      MOVS     r0,r0
    i.HAL_NVIC_SetPriority
    HAL_NVIC_SetPriority
        0x080013c8:    b4f0        ..      PUSH     {r4-r7}
        0x080013ca:    4b0e        .K      LDR      r3,[pc,#56] ; [0x8001404] = 0xe000ed0c
        0x080013cc:    681b        .h      LDR      r3,[r3,#0]
        0x080013ce:    460c        .F      MOV      r4,r1
        0x080013d0:    f3c32302    ...#    UBFX     r3,r3,#8,#3
        0x080013d4:    f1c30507    ....    RSB      r5,r3,#7
        0x080013d8:    2d04        .-      CMP      r5,#4
        0x080013da:    d900        ..      BLS      0x80013de ; HAL_NVIC_SetPriority + 22
        0x080013dc:    2504        .%      MOVS     r5,#4
        0x080013de:    1d19        ..      ADDS     r1,r3,#4
        0x080013e0:    2907        .)      CMP      r1,#7
        0x080013e2:    d201        ..      BCS      0x80013e8 ; HAL_NVIC_SetPriority + 32
        0x080013e4:    2300        .#      MOVS     r3,#0
        0x080013e6:    e000        ..      B        0x80013ea ; HAL_NVIC_SetPriority + 34
        0x080013e8:    1edb        ..      SUBS     r3,r3,#3
        0x080013ea:    2601        .&      MOVS     r6,#1
        0x080013ec:    fa06f105    ....    LSL      r1,r6,r5
        0x080013f0:    1e49        I.      SUBS     r1,r1,#1
        0x080013f2:    4021        !@      ANDS     r1,r1,r4
        0x080013f4:    4099        .@      LSLS     r1,r1,r3
        0x080013f6:    409e        .@      LSLS     r6,r6,r3
        0x080013f8:    1e76        v.      SUBS     r6,r6,#1
        0x080013fa:    4016        .@      ANDS     r6,r6,r2
        0x080013fc:    4331        1C      ORRS     r1,r1,r6
        0x080013fe:    bcf0        ..      POP      {r4-r7}
        0x08001400:    f001b9ee    ....    B.W      __NVIC_SetPriority ; 0x80027e0
    $d
        0x08001404:    e000ed0c    ....    DCD    3758157068
    $t
    i.HAL_NVIC_SetPriorityGrouping
    HAL_NVIC_SetPriorityGrouping
        0x08001408:    4906        .I      LDR      r1,[pc,#24] ; [0x8001424] = 0xe000ed0c
        0x0800140a:    f0000207    ....    AND      r2,r0,#7
        0x0800140e:    6808        .h      LDR      r0,[r1,#0]
        0x08001410:    f64f03ff    O...    MOV      r3,#0xf8ff
        0x08001414:    4018        .@      ANDS     r0,r0,r3
        0x08001416:    ea402002    @..     ORR      r0,r0,r2,LSL #8
        0x0800141a:    4a03        .J      LDR      r2,[pc,#12] ; [0x8001428] = 0x5fa0000
        0x0800141c:    4310        .C      ORRS     r0,r0,r2
        0x0800141e:    6008        .`      STR      r0,[r1,#0]
        0x08001420:    4770        pG      BX       lr
    $d
        0x08001422:    0000        ..      DCW    0
        0x08001424:    e000ed0c    ....    DCD    3758157068
        0x08001428:    05fa0000    ....    DCD    100270080
    $t
    i.HAL_RCC_ClockConfig
    HAL_RCC_ClockConfig
        0x0800142c:    e92d47f0    -..G    PUSH     {r4-r10,lr}
        0x08001430:    460e        .F      MOV      r6,r1
        0x08001432:    0005        ..      MOVS     r5,r0
        0x08001434:    d065        e.      BEQ      0x8001502 ; HAL_RCC_ClockConfig + 214
        0x08001436:    f8df8114    ....    LDR      r8,[pc,#276] ; [0x800154c] = 0x40023c00
        0x0800143a:    f8d80000    ....    LDR      r0,[r8,#0]
        0x0800143e:    b2f7        ..      UXTB     r7,r6
        0x08001440:    f0000007    ....    AND      r0,r0,#7
        0x08001444:    42b0        .B      CMP      r0,r6
        0x08001446:    d207        ..      BCS      0x8001458 ; HAL_RCC_ClockConfig + 44
        0x08001448:    f8887000    ...p    STRB     r7,[r8,#0]
        0x0800144c:    f8d80000    ....    LDR      r0,[r8,#0]
        0x08001450:    f0000007    ....    AND      r0,r0,#7
        0x08001454:    42b0        .B      CMP      r0,r6
        0x08001456:    d154        T.      BNE      0x8001502 ; HAL_RCC_ClockConfig + 214
        0x08001458:    6828        (h      LDR      r0,[r5,#0]
        0x0800145a:    4c3d        =L      LDR      r4,[pc,#244] ; [0x8001550] = 0x40023808
        0x0800145c:    0781        ..      LSLS     r1,r0,#30
        0x0800145e:    d512        ..      BPL      0x8001486 ; HAL_RCC_ClockConfig + 90
        0x08001460:    0740        @.      LSLS     r0,r0,#29
        0x08001462:    d503        ..      BPL      0x800146c ; HAL_RCC_ClockConfig + 64
        0x08001464:    6820         h      LDR      r0,[r4,#0]
        0x08001466:    f44050e0    @..P    ORR      r0,r0,#0x1c00
        0x0800146a:    6020         `      STR      r0,[r4,#0]
        0x0800146c:    7828        (x      LDRB     r0,[r5,#0]
        0x0800146e:    0700        ..      LSLS     r0,r0,#28
        0x08001470:    d503        ..      BPL      0x800147a ; HAL_RCC_ClockConfig + 78
        0x08001472:    6820         h      LDR      r0,[r4,#0]
        0x08001474:    f4404060    @.`@    ORR      r0,r0,#0xe000
        0x08001478:    6020         `      STR      r0,[r4,#0]
        0x0800147a:    6820         h      LDR      r0,[r4,#0]
        0x0800147c:    68a9        .h      LDR      r1,[r5,#8]
        0x0800147e:    f02000f0     ...    BIC      r0,r0,#0xf0
        0x08001482:    4308        .C      ORRS     r0,r0,r1
        0x08001484:    6020         `      STR      r0,[r4,#0]
        0x08001486:    7828        (x      LDRB     r0,[r5,#0]
        0x08001488:    07c0        ..      LSLS     r0,r0,#31
        0x0800148a:    d02d        -.      BEQ      0x80014e8 ; HAL_RCC_ClockConfig + 188
        0x0800148c:    4930        0I      LDR      r1,[pc,#192] ; [0x8001550] = 0x40023808
        0x0800148e:    6868        hh      LDR      r0,[r5,#4]
        0x08001490:    3908        .9      SUBS     r1,r1,#8
        0x08001492:    2801        .(      CMP      r0,#1
        0x08001494:    d012        ..      BEQ      0x80014bc ; HAL_RCC_ClockConfig + 144
        0x08001496:    2802        .(      CMP      r0,#2
        0x08001498:    d013        ..      BEQ      0x80014c2 ; HAL_RCC_ClockConfig + 150
        0x0800149a:    2803        .(      CMP      r0,#3
        0x0800149c:    d011        ..      BEQ      0x80014c2 ; HAL_RCC_ClockConfig + 150
        0x0800149e:    6809        .h      LDR      r1,[r1,#0]
        0x080014a0:    0789        ..      LSLS     r1,r1,#30
        0x080014a2:    2900        .)      CMP      r1,#0
        0x080014a4:    da2d        -.      BGE      0x8001502 ; HAL_RCC_ClockConfig + 214
        0x080014a6:    6821        !h      LDR      r1,[r4,#0]
        0x080014a8:    f0210103    !...    BIC      r1,r1,#3
        0x080014ac:    4301        .C      ORRS     r1,r1,r0
        0x080014ae:    6021        !`      STR      r1,[r4,#0]
        0x080014b0:    f7ffff1c    ....    BL       HAL_GetTick ; 0x80012ec
        0x080014b4:    4681        .F      MOV      r9,r0
        0x080014b6:    f2413a88    A..:    MOV      r10,#0x1388
        0x080014ba:    e00e        ..      B        0x80014da ; HAL_RCC_ClockConfig + 174
        0x080014bc:    6809        .h      LDR      r1,[r1,#0]
        0x080014be:    0389        ..      LSLS     r1,r1,#14
        0x080014c0:    e7ef        ..      B        0x80014a2 ; HAL_RCC_ClockConfig + 118
        0x080014c2:    6809        .h      LDR      r1,[r1,#0]
        0x080014c4:    0189        ..      LSLS     r1,r1,#6
        0x080014c6:    e7ec        ..      B        0x80014a2 ; HAL_RCC_ClockConfig + 118
        0x080014c8:    f7ffff10    ....    BL       HAL_GetTick ; 0x80012ec
        0x080014cc:    eba00109    ....    SUB      r1,r0,r9
        0x080014d0:    4551        QE      CMP      r1,r10
        0x080014d2:    d902        ..      BLS      0x80014da ; HAL_RCC_ClockConfig + 174
        0x080014d4:    2003        .       MOVS     r0,#3
        0x080014d6:    e8bd87f0    ....    POP      {r4-r10,pc}
        0x080014da:    6820         h      LDR      r0,[r4,#0]
        0x080014dc:    6869        ih      LDR      r1,[r5,#4]
        0x080014de:    f000000c    ....    AND      r0,r0,#0xc
        0x080014e2:    ebb00f81    ....    CMP      r0,r1,LSL #2
        0x080014e6:    d1ef        ..      BNE      0x80014c8 ; HAL_RCC_ClockConfig + 156
        0x080014e8:    f8d81000    ....    LDR      r1,[r8,#0]
        0x080014ec:    4640        @F      MOV      r0,r8
        0x080014ee:    f0010107    ....    AND      r1,r1,#7
        0x080014f2:    42b1        .B      CMP      r1,r6
        0x080014f4:    d907        ..      BLS      0x8001506 ; HAL_RCC_ClockConfig + 218
        0x080014f6:    7007        .p      STRB     r7,[r0,#0]
        0x080014f8:    6800        .h      LDR      r0,[r0,#0]
        0x080014fa:    f0000007    ....    AND      r0,r0,#7
        0x080014fe:    42b0        .B      CMP      r0,r6
        0x08001500:    d001        ..      BEQ      0x8001506 ; HAL_RCC_ClockConfig + 218
        0x08001502:    2001        .       MOVS     r0,#1
        0x08001504:    e7e7        ..      B        0x80014d6 ; HAL_RCC_ClockConfig + 170
        0x08001506:    7828        (x      LDRB     r0,[r5,#0]
        0x08001508:    0740        @.      LSLS     r0,r0,#29
        0x0800150a:    d505        ..      BPL      0x8001518 ; HAL_RCC_ClockConfig + 236
        0x0800150c:    6820         h      LDR      r0,[r4,#0]
        0x0800150e:    68e9        .h      LDR      r1,[r5,#0xc]
        0x08001510:    f42050e0     ..P    BIC      r0,r0,#0x1c00
        0x08001514:    4308        .C      ORRS     r0,r0,r1
        0x08001516:    6020         `      STR      r0,[r4,#0]
        0x08001518:    7828        (x      LDRB     r0,[r5,#0]
        0x0800151a:    0700        ..      LSLS     r0,r0,#28
        0x0800151c:    d506        ..      BPL      0x800152c ; HAL_RCC_ClockConfig + 256
        0x0800151e:    6820         h      LDR      r0,[r4,#0]
        0x08001520:    6929        )i      LDR      r1,[r5,#0x10]
        0x08001522:    f4204060     .`@    BIC      r0,r0,#0xe000
        0x08001526:    ea4000c1    @...    ORR      r0,r0,r1,LSL #3
        0x0800152a:    6020         `      STR      r0,[r4,#0]
        0x0800152c:    f000f838    ..8.    BL       HAL_RCC_GetSysClockFreq ; 0x80015a0
        0x08001530:    6821        !h      LDR      r1,[r4,#0]
        0x08001532:    4a08        .J      LDR      r2,[pc,#32] ; [0x8001554] = 0x8003294
        0x08001534:    f3c11103    ....    UBFX     r1,r1,#4,#4
        0x08001538:    5c51        Q\      LDRB     r1,[r2,r1]
        0x0800153a:    40c8        .@      LSRS     r0,r0,r1
        0x0800153c:    4906        .I      LDR      r1,[pc,#24] ; [0x8001558] = 0x2000000c
        0x0800153e:    6008        .`      STR      r0,[r1,#0]
        0x08001540:    4806        .H      LDR      r0,[pc,#24] ; [0x800155c] = 0x20000004
        0x08001542:    6800        .h      LDR      r0,[r0,#0]
        0x08001544:    f7fffefa    ....    BL       HAL_InitTick ; 0x800133c
        0x08001548:    2000        .       MOVS     r0,#0
        0x0800154a:    e7c4        ..      B        0x80014d6 ; HAL_RCC_ClockConfig + 170
    $d
        0x0800154c:    40023c00    .<.@    DCD    1073888256
        0x08001550:    40023808    .8.@    DCD    1073887240
        0x08001554:    08003294    .2..    DCD    134230676
        0x08001558:    2000000c    ...     DCD    536870924
        0x0800155c:    20000004    ...     DCD    536870916
    $t
    i.HAL_RCC_GetPCLK1Freq
    HAL_RCC_GetPCLK1Freq
        0x08001560:    4804        .H      LDR      r0,[pc,#16] ; [0x8001574] = 0x2000000c
        0x08001562:    4905        .I      LDR      r1,[pc,#20] ; [0x8001578] = 0x40023808
        0x08001564:    6800        .h      LDR      r0,[r0,#0]
        0x08001566:    6809        .h      LDR      r1,[r1,#0]
        0x08001568:    4a04        .J      LDR      r2,[pc,#16] ; [0x800157c] = 0x80032a4
        0x0800156a:    f3c12182    ...!    UBFX     r1,r1,#10,#3
        0x0800156e:    5c51        Q\      LDRB     r1,[r2,r1]
        0x08001570:    40c8        .@      LSRS     r0,r0,r1
        0x08001572:    4770        pG      BX       lr
    $d
        0x08001574:    2000000c    ...     DCD    536870924
        0x08001578:    40023808    .8.@    DCD    1073887240
        0x0800157c:    080032a4    .2..    DCD    134230692
    $t
    i.HAL_RCC_GetPCLK2Freq
    HAL_RCC_GetPCLK2Freq
        0x08001580:    4804        .H      LDR      r0,[pc,#16] ; [0x8001594] = 0x2000000c
        0x08001582:    4905        .I      LDR      r1,[pc,#20] ; [0x8001598] = 0x40023808
        0x08001584:    6800        .h      LDR      r0,[r0,#0]
        0x08001586:    6809        .h      LDR      r1,[r1,#0]
        0x08001588:    4a04        .J      LDR      r2,[pc,#16] ; [0x800159c] = 0x80032a4
        0x0800158a:    f3c13142    ..B1    UBFX     r1,r1,#13,#3
        0x0800158e:    5c51        Q\      LDRB     r1,[r2,r1]
        0x08001590:    40c8        .@      LSRS     r0,r0,r1
        0x08001592:    4770        pG      BX       lr
    $d
        0x08001594:    2000000c    ...     DCD    536870924
        0x08001598:    40023808    .8.@    DCD    1073887240
        0x0800159c:    080032a4    .2..    DCD    134230692
    $t
    i.HAL_RCC_GetSysClockFreq
    HAL_RCC_GetSysClockFreq
        0x080015a0:    4815        .H      LDR      r0,[pc,#84] ; [0x80015f8] = 0x40023808
        0x080015a2:    b510        ..      PUSH     {r4,lr}
        0x080015a4:    6800        .h      LDR      r0,[r0,#0]
        0x080015a6:    f010020c    ....    ANDS     r2,r0,#0xc
        0x080015aa:    4814        .H      LDR      r0,[pc,#80] ; [0x80015fc] = 0xf42400
        0x080015ac:    d013        ..      BEQ      0x80015d6 ; HAL_RCC_GetSysClockFreq + 54
        0x080015ae:    1041        A.      ASRS     r1,r0,#1
        0x080015b0:    2a04        .*      CMP      r2,#4
        0x080015b2:    d00f        ..      BEQ      0x80015d4 ; HAL_RCC_GetSysClockFreq + 52
        0x080015b4:    2a08        .*      CMP      r2,#8
        0x080015b6:    d10e        ..      BNE      0x80015d6 ; HAL_RCC_GetSysClockFreq + 54
        0x080015b8:    4c0f        .L      LDR      r4,[pc,#60] ; [0x80015f8] = 0x40023808
        0x080015ba:    1f24        $.      SUBS     r4,r4,#4
        0x080015bc:    6822        "h      LDR      r2,[r4,#0]
        0x080015be:    6823        #h      LDR      r3,[r4,#0]
