tangbaishu/Personal/MDK-ARM/Out/STM32F407ZGT6_Embedded_V1.asm
        0x080015c0:    f002023f    ..?.    AND      r2,r2,#0x3f
        0x080015c4:    025b        [.      LSLS     r3,r3,#9
        0x080015c6:    d507        ..      BPL      0x80015d8 ; HAL_RCC_GetSysClockFreq + 56
        0x080015c8:    6820         h      LDR      r0,[r4,#0]
        0x080015ca:    f3c01088    ....    UBFX     r0,r0,#6,#9
        0x080015ce:    fba00101    ....    UMULL    r0,r1,r0,r1
        0x080015d2:    e006        ..      B        0x80015e2 ; HAL_RCC_GetSysClockFreq + 66
        0x080015d4:    4608        .F      MOV      r0,r1
        0x080015d6:    bd10        ..      POP      {r4,pc}
        0x080015d8:    6821        !h      LDR      r1,[r4,#0]
        0x080015da:    f3c11188    ....    UBFX     r1,r1,#6,#9
        0x080015de:    fba10100    ....    UMULL    r0,r1,r1,r0
        0x080015e2:    2300        .#      MOVS     r3,#0
        0x080015e4:    f7fefdee    ....    BL       __aeabi_uldivmod ; 0x80001c4
        0x080015e8:    6821        !h      LDR      r1,[r4,#0]
        0x080015ea:    f3c14101    ...A    UBFX     r1,r1,#16,#2
        0x080015ee:    1c49        I.      ADDS     r1,r1,#1
        0x080015f0:    0049        I.      LSLS     r1,r1,#1
        0x080015f2:    fbb0f0f1    ....    UDIV     r0,r0,r1
        0x080015f6:    bd10        ..      POP      {r4,pc}
    $d
        0x080015f8:    40023808    .8.@    DCD    1073887240
        0x080015fc:    00f42400    .$..    DCD    16000000
    $t
    i.HAL_RCC_OscConfig
    HAL_RCC_OscConfig
        0x08001600:    e92d4ff8    -..O    PUSH     {r3-r11,lr}
        0x08001604:    0004        ..      MOVS     r4,r0
        0x08001606:    d06e        n.      BEQ      0x80016e6 ; HAL_RCC_OscConfig + 230
        0x08001608:    7820         x      LDRB     r0,[r4,#0]
        0x0800160a:    f8df934c    ..L.    LDR      r9,[pc,#844] ; [0x8001958] = 0x40023804
        0x0800160e:    07c0        ..      LSLS     r0,r0,#31
        0x08001610:    f1a90504    ....    SUB      r5,r9,#4
        0x08001614:    d04a        J.      BEQ      0x80016ac ; HAL_RCC_OscConfig + 172
        0x08001616:    f1090004    ....    ADD      r0,r9,#4
        0x0800161a:    6801        .h      LDR      r1,[r0,#0]
        0x0800161c:    f3c10181    ....    UBFX     r1,r1,#2,#2
        0x08001620:    2901        .)      CMP      r1,#1
        0x08001622:    d008        ..      BEQ      0x8001636 ; HAL_RCC_OscConfig + 54
        0x08001624:    6800        .h      LDR      r0,[r0,#0]
        0x08001626:    f3c00081    ....    UBFX     r0,r0,#2,#2
        0x0800162a:    2802        .(      CMP      r0,#2
        0x0800162c:    d10a        ..      BNE      0x8001644 ; HAL_RCC_OscConfig + 68
        0x0800162e:    f8d90000    ....    LDR      r0,[r9,#0]
        0x08001632:    0240        @.      LSLS     r0,r0,#9
        0x08001634:    d506        ..      BPL      0x8001644 ; HAL_RCC_OscConfig + 68
        0x08001636:    6828        (h      LDR      r0,[r5,#0]
        0x08001638:    0380        ..      LSLS     r0,r0,#14
        0x0800163a:    d537        7.      BPL      0x80016ac ; HAL_RCC_OscConfig + 172
        0x0800163c:    6860        `h      LDR      r0,[r4,#4]
        0x0800163e:    2800        .(      CMP      r0,#0
        0x08001640:    d0e1        ..      BEQ      0x8001606 ; HAL_RCC_OscConfig + 6
        0x08001642:    e033        3.      B        0x80016ac ; HAL_RCC_OscConfig + 172
        0x08001644:    6860        `h      LDR      r0,[r4,#4]
        0x08001646:    f5b03f80    ...?    CMP      r0,#0x10000
        0x0800164a:    d010        ..      BEQ      0x800166e ; HAL_RCC_OscConfig + 110
        0x0800164c:    f5b02fa0    .../    CMP      r0,#0x50000
        0x08001650:    6828        (h      LDR      r0,[r5,#0]
        0x08001652:    d010        ..      BEQ      0x8001676 ; HAL_RCC_OscConfig + 118
        0x08001654:    f4203080     ..0    BIC      r0,r0,#0x10000
        0x08001658:    6028        (`      STR      r0,[r5,#0]
        0x0800165a:    6828        (h      LDR      r0,[r5,#0]
        0x0800165c:    f4202080     ..     BIC      r0,r0,#0x40000
        0x08001660:    6028        (`      STR      r0,[r5,#0]
        0x08001662:    6860        `h      LDR      r0,[r4,#4]
        0x08001664:    b1a8        ..      CBZ      r0,0x8001692 ; HAL_RCC_OscConfig + 146
        0x08001666:    f7fffe41    ..A.    BL       HAL_GetTick ; 0x80012ec
        0x0800166a:    4606        .F      MOV      r6,r0
        0x0800166c:    e00d        ..      B        0x800168a ; HAL_RCC_OscConfig + 138
        0x0800166e:    6828        (h      LDR      r0,[r5,#0]
        0x08001670:    f4403080    @..0    ORR      r0,r0,#0x10000
        0x08001674:    e7f4        ..      B        0x8001660 ; HAL_RCC_OscConfig + 96
        0x08001676:    f4402080    @..     ORR      r0,r0,#0x40000
        0x0800167a:    6028        (`      STR      r0,[r5,#0]
        0x0800167c:    e7f7        ..      B        0x800166e ; HAL_RCC_OscConfig + 110
        0x0800167e:    bf00        ..      NOP      
        0x08001680:    f7fffe34    ..4.    BL       HAL_GetTick ; 0x80012ec
        0x08001684:    1b80        ..      SUBS     r0,r0,r6
        0x08001686:    2864        d(      CMP      r0,#0x64
        0x08001688:    d873        s.      BHI      0x8001772 ; HAL_RCC_OscConfig + 370
        0x0800168a:    6828        (h      LDR      r0,[r5,#0]
        0x0800168c:    0380        ..      LSLS     r0,r0,#14
        0x0800168e:    d5f7        ..      BPL      0x8001680 ; HAL_RCC_OscConfig + 128
        0x08001690:    e00c        ..      B        0x80016ac ; HAL_RCC_OscConfig + 172
        0x08001692:    f7fffe2b    ..+.    BL       HAL_GetTick ; 0x80012ec
        0x08001696:    4606        .F      MOV      r6,r0
        0x08001698:    e005        ..      B        0x80016a6 ; HAL_RCC_OscConfig + 166
        0x0800169a:    bf00        ..      NOP      
        0x0800169c:    f7fffe26    ..&.    BL       HAL_GetTick ; 0x80012ec
        0x080016a0:    1b80        ..      SUBS     r0,r0,r6
        0x080016a2:    2864        d(      CMP      r0,#0x64
        0x080016a4:    d8f0        ..      BHI      0x8001688 ; HAL_RCC_OscConfig + 136
        0x080016a6:    6828        (h      LDR      r0,[r5,#0]
        0x080016a8:    0380        ..      LSLS     r0,r0,#14
        0x080016aa:    d4f7        ..      BMI      0x800169c ; HAL_RCC_OscConfig + 156
        0x080016ac:    7820         x      LDRB     r0,[r4,#0]
        0x080016ae:    f8df82ac    ....    LDR      r8,[pc,#684] ; [0x800195c] = 0x42470000
        0x080016b2:    0780        ..      LSLS     r0,r0,#30
        0x080016b4:    f04f0a00    O...    MOV      r10,#0
        0x080016b8:    d53e        >.      BPL      0x8001738 ; HAL_RCC_OscConfig + 312
        0x080016ba:    48a7        .H      LDR      r0,[pc,#668] ; [0x8001958] = 0x40023804
        0x080016bc:    1d00        ..      ADDS     r0,r0,#4
        0x080016be:    6801        .h      LDR      r1,[r0,#0]
        0x080016c0:    f0110f0c    ....    TST      r1,#0xc
        0x080016c4:    d008        ..      BEQ      0x80016d8 ; HAL_RCC_OscConfig + 216
        0x080016c6:    6800        .h      LDR      r0,[r0,#0]
        0x080016c8:    f3c00081    ....    UBFX     r0,r0,#2,#2
        0x080016cc:    2802        .(      CMP      r0,#2
        0x080016ce:    d10b        ..      BNE      0x80016e8 ; HAL_RCC_OscConfig + 232
        0x080016d0:    f8d90000    ....    LDR      r0,[r9,#0]
        0x080016d4:    0240        @.      LSLS     r0,r0,#9
        0x080016d6:    d407        ..      BMI      0x80016e8 ; HAL_RCC_OscConfig + 232
        0x080016d8:    6828        (h      LDR      r0,[r5,#0]
        0x080016da:    0780        ..      LSLS     r0,r0,#30
        0x080016dc:    d516        ..      BPL      0x800170c ; HAL_RCC_OscConfig + 268
        0x080016de:    68e0        .h      LDR      r0,[r4,#0xc]
        0x080016e0:    2801        .(      CMP      r0,#1
        0x080016e2:    d100        ..      BNE      0x80016e6 ; HAL_RCC_OscConfig + 230
        0x080016e4:    e012        ..      B        0x800170c ; HAL_RCC_OscConfig + 268
        0x080016e6:    e133        3.      B        0x8001950 ; HAL_RCC_OscConfig + 848
        0x080016e8:    68e0        .h      LDR      r0,[r4,#0xc]
        0x080016ea:    b1b8        ..      CBZ      r0,0x800171c ; HAL_RCC_OscConfig + 284
        0x080016ec:    2001        .       MOVS     r0,#1
        0x080016ee:    f8c80000    ....    STR      r0,[r8,#0]
        0x080016f2:    f7fffdfb    ....    BL       HAL_GetTick ; 0x80012ec
        0x080016f6:    4606        .F      MOV      r6,r0
        0x080016f8:    e005        ..      B        0x8001706 ; HAL_RCC_OscConfig + 262
        0x080016fa:    bf00        ..      NOP      
        0x080016fc:    f7fffdf6    ....    BL       HAL_GetTick ; 0x80012ec
        0x08001700:    1b80        ..      SUBS     r0,r0,r6
        0x08001702:    2802        .(      CMP      r0,#2
        0x08001704:    d8c0        ..      BHI      0x8001688 ; HAL_RCC_OscConfig + 136
        0x08001706:    6828        (h      LDR      r0,[r5,#0]
        0x08001708:    0780        ..      LSLS     r0,r0,#30
        0x0800170a:    d5f7        ..      BPL      0x80016fc ; HAL_RCC_OscConfig + 252
        0x0800170c:    6828        (h      LDR      r0,[r5,#0]
        0x0800170e:    6921        !i      LDR      r1,[r4,#0x10]
        0x08001710:    f02000f8     ...    BIC      r0,r0,#0xf8
        0x08001714:    ea4000c1    @...    ORR      r0,r0,r1,LSL #3
        0x08001718:    6028        (`      STR      r0,[r5,#0]
        0x0800171a:    e00d        ..      B        0x8001738 ; HAL_RCC_OscConfig + 312
        0x0800171c:    f8c8a000    ....    STR      r10,[r8,#0]
        0x08001720:    f7fffde4    ....    BL       HAL_GetTick ; 0x80012ec
        0x08001724:    4606        .F      MOV      r6,r0
        0x08001726:    e004        ..      B        0x8001732 ; HAL_RCC_OscConfig + 306
        0x08001728:    f7fffde0    ....    BL       HAL_GetTick ; 0x80012ec
        0x0800172c:    1b80        ..      SUBS     r0,r0,r6
        0x0800172e:    2802        .(      CMP      r0,#2
        0x08001730:    d81f        ..      BHI      0x8001772 ; HAL_RCC_OscConfig + 370
        0x08001732:    6828        (h      LDR      r0,[r5,#0]
        0x08001734:    0780        ..      LSLS     r0,r0,#30
        0x08001736:    d4f7        ..      BMI      0x8001728 ; HAL_RCC_OscConfig + 296
        0x08001738:    7820         x      LDRB     r0,[r4,#0]
        0x0800173a:    0700        ..      LSLS     r0,r0,#28
        0x0800173c:    d522        ".      BPL      0x8001784 ; HAL_RCC_OscConfig + 388
        0x0800173e:    4f86        .O      LDR      r7,[pc,#536] ; [0x8001958] = 0x40023804
        0x08001740:    4887        .H      LDR      r0,[pc,#540] ; [0x8001960] = 0x42470e80
        0x08001742:    6961        ai      LDR      r1,[r4,#0x14]
        0x08001744:    3770        p7      ADDS     r7,r7,#0x70
        0x08001746:    b171        q.      CBZ      r1,0x8001766 ; HAL_RCC_OscConfig + 358
        0x08001748:    2101        .!      MOVS     r1,#1
        0x0800174a:    6001        .`      STR      r1,[r0,#0]
        0x0800174c:    f7fffdce    ....    BL       HAL_GetTick ; 0x80012ec
        0x08001750:    4606        .F      MOV      r6,r0
        0x08001752:    e004        ..      B        0x800175e ; HAL_RCC_OscConfig + 350
        0x08001754:    f7fffdca    ....    BL       HAL_GetTick ; 0x80012ec
        0x08001758:    1b80        ..      SUBS     r0,r0,r6
        0x0800175a:    2802        .(      CMP      r0,#2
        0x0800175c:    d809        ..      BHI      0x8001772 ; HAL_RCC_OscConfig + 370
        0x0800175e:    6838        8h      LDR      r0,[r7,#0]
        0x08001760:    0780        ..      LSLS     r0,r0,#30
        0x08001762:    d5f7        ..      BPL      0x8001754 ; HAL_RCC_OscConfig + 340
        0x08001764:    e00e        ..      B        0x8001784 ; HAL_RCC_OscConfig + 388
        0x08001766:    f8c0a000    ....    STR      r10,[r0,#0]
        0x0800176a:    f7fffdbf    ....    BL       HAL_GetTick ; 0x80012ec
        0x0800176e:    4606        .F      MOV      r6,r0
        0x08001770:    e005        ..      B        0x800177e ; HAL_RCC_OscConfig + 382
        0x08001772:    e082        ..      B        0x800187a ; HAL_RCC_OscConfig + 634
        0x08001774:    f7fffdba    ....    BL       HAL_GetTick ; 0x80012ec
        0x08001778:    1b80        ..      SUBS     r0,r0,r6
        0x0800177a:    2802        .(      CMP      r0,#2
        0x0800177c:    d87d        }.      BHI      0x800187a ; HAL_RCC_OscConfig + 634
        0x0800177e:    6838        8h      LDR      r0,[r7,#0]
        0x08001780:    0780        ..      LSLS     r0,r0,#30
        0x08001782:    d4f7        ..      BMI      0x8001774 ; HAL_RCC_OscConfig + 372
        0x08001784:    7820         x      LDRB     r0,[r4,#0]
        0x08001786:    0740        @.      LSLS     r0,r0,#29
        0x08001788:    d568        h.      BPL      0x800185c ; HAL_RCC_OscConfig + 604
        0x0800178a:    f8dfb1cc    ....    LDR      r11,[pc,#460] ; [0x8001958] = 0x40023804
        0x0800178e:    2700        .'      MOVS     r7,#0
        0x08001790:    f10b0b3c    ..<.    ADD      r11,r11,#0x3c
        0x08001794:    f8db0000    ....    LDR      r0,[r11,#0]
        0x08001798:    00c0        ..      LSLS     r0,r0,#3
        0x0800179a:    d40b        ..      BMI      0x80017b4 ; HAL_RCC_OscConfig + 436
        0x0800179c:    f8db1000    ....    LDR      r1,[r11,#0]
        0x080017a0:    f0415180    A..Q    ORR      r1,r1,#0x10000000
        0x080017a4:    f8cb1000    ....    STR      r1,[r11,#0]
        0x080017a8:    f8db0000    ....    LDR      r0,[r11,#0]
        0x080017ac:    2701        .'      MOVS     r7,#1
        0x080017ae:    f0005080    ...P    AND      r0,r0,#0x10000000
        0x080017b2:    9000        ..      STR      r0,[sp,#0]
        0x080017b4:    4e6b        kN      LDR      r6,[pc,#428] ; [0x8001964] = 0x40007000
        0x080017b6:    6830        0h      LDR      r0,[r6,#0]
        0x080017b8:    05c0        ..      LSLS     r0,r0,#23
        0x080017ba:    d410        ..      BMI      0x80017de ; HAL_RCC_OscConfig + 478
        0x080017bc:    6830        0h      LDR      r0,[r6,#0]
        0x080017be:    f4407080    @..p    ORR      r0,r0,#0x100
        0x080017c2:    6030        0`      STR      r0,[r6,#0]
        0x080017c4:    f7fffd92    ....    BL       HAL_GetTick ; 0x80012ec
        0x080017c8:    9000        ..      STR      r0,[sp,#0]
        0x080017ca:    e005        ..      B        0x80017d8 ; HAL_RCC_OscConfig + 472
        0x080017cc:    f7fffd8e    ....    BL       HAL_GetTick ; 0x80012ec
        0x080017d0:    9900        ..      LDR      r1,[sp,#0]
        0x080017d2:    1a40        @.      SUBS     r0,r0,r1
        0x080017d4:    2802        .(      CMP      r0,#2
        0x080017d6:    d850        P.      BHI      0x800187a ; HAL_RCC_OscConfig + 634
        0x080017d8:    6830        0h      LDR      r0,[r6,#0]
        0x080017da:    05c0        ..      LSLS     r0,r0,#23
        0x080017dc:    d5f6        ..      BPL      0x80017cc ; HAL_RCC_OscConfig + 460
        0x080017de:    4e5e        ^N      LDR      r6,[pc,#376] ; [0x8001958] = 0x40023804
        0x080017e0:    68a0        .h      LDR      r0,[r4,#8]
        0x080017e2:    366c        l6      ADDS     r6,r6,#0x6c
        0x080017e4:    2801        .(      CMP      r0,#1
        0x080017e6:    d00f        ..      BEQ      0x8001808 ; HAL_RCC_OscConfig + 520
        0x080017e8:    2805        .(      CMP      r0,#5
        0x080017ea:    6830        0h      LDR      r0,[r6,#0]
        0x080017ec:    d010        ..      BEQ      0x8001810 ; HAL_RCC_OscConfig + 528
        0x080017ee:    f0200001     ...    BIC      r0,r0,#1
        0x080017f2:    6030        0`      STR      r0,[r6,#0]
        0x080017f4:    6830        0h      LDR      r0,[r6,#0]
        0x080017f6:    f0200004     ...    BIC      r0,r0,#4
        0x080017fa:    6030        0`      STR      r0,[r6,#0]
        0x080017fc:    68a0        .h      LDR      r0,[r4,#8]
        0x080017fe:    b1b8        ..      CBZ      r0,0x8001830 ; HAL_RCC_OscConfig + 560
        0x08001800:    f7fffd74    ..t.    BL       HAL_GetTick ; 0x80012ec
        0x08001804:    9000        ..      STR      r0,[sp,#0]
        0x08001806:    e00f        ..      B        0x8001828 ; HAL_RCC_OscConfig + 552
        0x08001808:    6830        0h      LDR      r0,[r6,#0]
        0x0800180a:    f0400001    @...    ORR      r0,r0,#1
        0x0800180e:    e7f4        ..      B        0x80017fa ; HAL_RCC_OscConfig + 506
        0x08001810:    f0400004    @...    ORR      r0,r0,#4
        0x08001814:    6030        0`      STR      r0,[r6,#0]
        0x08001816:    e7f7        ..      B        0x8001808 ; HAL_RCC_OscConfig + 520
        0x08001818:    f7fffd68    ..h.    BL       HAL_GetTick ; 0x80012ec
        0x0800181c:    9900        ..      LDR      r1,[sp,#0]
        0x0800181e:    1a41        A.      SUBS     r1,r0,r1
        0x08001820:    f2413088    A..0    MOV      r0,#0x1388
        0x08001824:    4281        .B      CMP      r1,r0
        0x08001826:    d866        f.      BHI      0x80018f6 ; HAL_RCC_OscConfig + 758
        0x08001828:    6830        0h      LDR      r0,[r6,#0]
        0x0800182a:    0780        ..      LSLS     r0,r0,#30
        0x0800182c:    d5f4        ..      BPL      0x8001818 ; HAL_RCC_OscConfig + 536
        0x0800182e:    e00e        ..      B        0x800184e ; HAL_RCC_OscConfig + 590
        0x08001830:    f7fffd5c    ..\.    BL       HAL_GetTick ; 0x80012ec
        0x08001834:    9000        ..      STR      r0,[sp,#0]
        0x08001836:    e007        ..      B        0x8001848 ; HAL_RCC_OscConfig + 584
        0x08001838:    f7fffd58    ..X.    BL       HAL_GetTick ; 0x80012ec
        0x0800183c:    9900        ..      LDR      r1,[sp,#0]
        0x0800183e:    1a41        A.      SUBS     r1,r0,r1
        0x08001840:    f2413088    A..0    MOV      r0,#0x1388
        0x08001844:    4281        .B      CMP      r1,r0
        0x08001846:    d856        V.      BHI      0x80018f6 ; HAL_RCC_OscConfig + 758
        0x08001848:    6830        0h      LDR      r0,[r6,#0]
        0x0800184a:    0780        ..      LSLS     r0,r0,#30
        0x0800184c:    d4f4        ..      BMI      0x8001838 ; HAL_RCC_OscConfig + 568
        0x0800184e:    b12f        /.      CBZ      r7,0x800185c ; HAL_RCC_OscConfig + 604
        0x08001850:    f8db1000    ....    LDR      r1,[r11,#0]
        0x08001854:    f0215180    !..Q    BIC      r1,r1,#0x10000000
        0x08001858:    f8cb1000    ....    STR      r1,[r11,#0]
        0x0800185c:    69a0        .i      LDR      r0,[r4,#0x18]
        0x0800185e:    b3c8        ..      CBZ      r0,0x80018d4 ; HAL_RCC_OscConfig + 724
        0x08001860:    493d        =I      LDR      r1,[pc,#244] ; [0x8001958] = 0x40023804
        0x08001862:    1d09        ..      ADDS     r1,r1,#4
        0x08001864:    6809        .h      LDR      r1,[r1,#0]
        0x08001866:    f3c10181    ....    UBFX     r1,r1,#2,#2
        0x0800186a:    2902        .)      CMP      r1,#2
        0x0800186c:    d04a        J.      BEQ      0x8001904 ; HAL_RCC_OscConfig + 772
        0x0800186e:    2802        .(      CMP      r0,#2
        0x08001870:    4650        PF      MOV      r0,r10
        0x08001872:    d007        ..      BEQ      0x8001884 ; HAL_RCC_OscConfig + 644
        0x08001874:    f8c80060    ..`.    STR      r0,[r8,#0x60]
        0x08001878:    e000        ..      B        0x800187c ; HAL_RCC_OscConfig + 636
        0x0800187a:    e03c        <.      B        0x80018f6 ; HAL_RCC_OscConfig + 758
        0x0800187c:    f7fffd36    ..6.    BL       HAL_GetTick ; 0x80012ec
        0x08001880:    4604        .F      MOV      r4,r0
        0x08001882:    e03b        ;.      B        0x80018fc ; HAL_RCC_OscConfig + 764
        0x08001884:    4647        GF      MOV      r7,r8
        0x08001886:    f8c80060    ..`.    STR      r0,[r8,#0x60]
        0x0800188a:    f7fffd2f    ../.    BL       HAL_GetTick ; 0x80012ec
        0x0800188e:    4606        .F      MOV      r6,r0
        0x08001890:    e005        ..      B        0x800189e ; HAL_RCC_OscConfig + 670
        0x08001892:    bf00        ..      NOP      
        0x08001894:    f7fffd2a    ..*.    BL       HAL_GetTick ; 0x80012ec
        0x08001898:    1b80        ..      SUBS     r0,r0,r6
        0x0800189a:    2802        .(      CMP      r0,#2
        0x0800189c:    d82b        +.      BHI      0x80018f6 ; HAL_RCC_OscConfig + 758
        0x0800189e:    6828        (h      LDR      r0,[r5,#0]
        0x080018a0:    0180        ..      LSLS     r0,r0,#6
        0x080018a2:    d4f7        ..      BMI      0x8001894 ; HAL_RCC_OscConfig + 660
        0x080018a4:    e9d40107    ....    LDRD     r0,r1,[r4,#0x1c]
        0x080018a8:    4308        .C      ORRS     r0,r0,r1
        0x080018aa:    6aa1        .j      LDR      r1,[r4,#0x28]
        0x080018ac:    4a2e        .J      LDR      r2,[pc,#184] ; [0x8001968] = 0xffff0000
        0x080018ae:    0849        I.      LSRS     r1,r1,#1
        0x080018b0:    eb024101    ...A    ADD      r1,r2,r1,LSL #16
        0x080018b4:    6a62        bj      LDR      r2,[r4,#0x24]
        0x080018b6:    ea411182    A...    ORR      r1,r1,r2,LSL #6
        0x080018ba:    4308        .C      ORRS     r0,r0,r1
        0x080018bc:    f894102c    ..,.    LDRB     r1,[r4,#0x2c]
        0x080018c0:    ea406101    @..a    ORR      r1,r0,r1,LSL #24
        0x080018c4:    f8c91000    ....    STR      r1,[r9,#0]
        0x080018c8:    2001        .       MOVS     r0,#1
        0x080018ca:    6638        8f      STR      r0,[r7,#0x60]
        0x080018cc:    f7fffd0e    ....    BL       HAL_GetTick ; 0x80012ec
        0x080018d0:    4604        .F      MOV      r4,r0
        0x080018d2:    e006        ..      B        0x80018e2 ; HAL_RCC_OscConfig + 738
        0x080018d4:    e03e        >.      B        0x8001954 ; HAL_RCC_OscConfig + 852
        0x080018d6:    bf00        ..      NOP      
        0x080018d8:    f7fffd08    ....    BL       HAL_GetTick ; 0x80012ec
        0x080018dc:    1b00        ..      SUBS     r0,r0,r4
        0x080018de:    2802        .(      CMP      r0,#2
        0x080018e0:    d809        ..      BHI      0x80018f6 ; HAL_RCC_OscConfig + 758
        0x080018e2:    6828        (h      LDR      r0,[r5,#0]
        0x080018e4:    0180        ..      LSLS     r0,r0,#6
        0x080018e6:    d5f7        ..      BPL      0x80018d8 ; HAL_RCC_OscConfig + 728
        0x080018e8:    e034        4.      B        0x8001954 ; HAL_RCC_OscConfig + 852
        0x080018ea:    bf00        ..      NOP      
        0x080018ec:    f7fffcfe    ....    BL       HAL_GetTick ; 0x80012ec
        0x080018f0:    1b00        ..      SUBS     r0,r0,r4
        0x080018f2:    2802        .(      CMP      r0,#2
        0x080018f4:    d902        ..      BLS      0x80018fc ; HAL_RCC_OscConfig + 764
        0x080018f6:    2003        .       MOVS     r0,#3
        0x080018f8:    e8bd8ff8    ....    POP      {r3-r11,pc}
        0x080018fc:    6828        (h      LDR      r0,[r5,#0]
        0x080018fe:    0180        ..      LSLS     r0,r0,#6
        0x08001900:    d4f4        ..      BMI      0x80018ec ; HAL_RCC_OscConfig + 748
        0x08001902:    e027        '.      B        0x8001954 ; HAL_RCC_OscConfig + 852
        0x08001904:    2801        .(      CMP      r0,#1
        0x08001906:    d0f7        ..      BEQ      0x80018f8 ; HAL_RCC_OscConfig + 760
        0x08001908:    f8d90000    ....    LDR      r0,[r9,#0]
        0x0800190c:    69e2        .i      LDR      r2,[r4,#0x1c]
        0x0800190e:    f4000180    ....    AND      r1,r0,#0x400000
        0x08001912:    4291        .B      CMP      r1,r2
