tangbaishu/Personal/MDK-ARM/Out/STM32F407ZGT6_Embedded_V1.asm
        0x08001914:    d11c        ..      BNE      0x8001950 ; HAL_RCC_OscConfig + 848
        0x08001916:    6a22        "j      LDR      r2,[r4,#0x20]
        0x08001918:    f000013f    ..?.    AND      r1,r0,#0x3f
        0x0800191c:    4291        .B      CMP      r1,r2
        0x0800191e:    d117        ..      BNE      0x8001950 ; HAL_RCC_OscConfig + 848
        0x08001920:    f64771c0    G..q    MOV      r1,#0x7fc0
        0x08001924:    6a62        bj      LDR      r2,[r4,#0x24]
        0x08001926:    4001        .@      ANDS     r1,r1,r0
        0x08001928:    ebb11f82    ....    CMP      r1,r2,LSL #6
        0x0800192c:    d110        ..      BNE      0x8001950 ; HAL_RCC_OscConfig + 848
        0x0800192e:    6aa2        .j      LDR      r2,[r4,#0x28]
        0x08001930:    f04f33ff    O..3    MOV      r3,#0xffffffff
        0x08001934:    f4003140    ..@1    AND      r1,r0,#0x30000
        0x08001938:    eb030252    ..R.    ADD      r2,r3,r2,LSR #1
        0x0800193c:    ebb14f02    ...O    CMP      r1,r2,LSL #16
        0x08001940:    d106        ..      BNE      0x8001950 ; HAL_RCC_OscConfig + 848
        0x08001942:    f894102c    ..,.    LDRB     r1,[r4,#0x2c]
        0x08001946:    f0006070    ..p`    AND      r0,r0,#0xf000000
        0x0800194a:    ebb06f01    ...o    CMP      r0,r1,LSL #24
        0x0800194e:    d001        ..      BEQ      0x8001954 ; HAL_RCC_OscConfig + 852
        0x08001950:    2001        .       MOVS     r0,#1
        0x08001952:    e7d1        ..      B        0x80018f8 ; HAL_RCC_OscConfig + 760
        0x08001954:    2000        .       MOVS     r0,#0
        0x08001956:    e7cf        ..      B        0x80018f8 ; HAL_RCC_OscConfig + 760
    $d
        0x08001958:    40023804    .8.@    DCD    1073887236
        0x0800195c:    42470000    ..GB    DCD    1111949312
        0x08001960:    42470e80    ..GB    DCD    1111953024
        0x08001964:    40007000    .p.@    DCD    1073770496
        0x08001968:    ffff0000    ....    DCD    4294901760
    $t
    i.HAL_SYSTICK_Config
    HAL_SYSTICK_Config
        0x0800196c:    b510        ..      PUSH     {r4,lr}
        0x0800196e:    1e40        @.      SUBS     r0,r0,#1
        0x08001970:    f1b07f80    ....    CMP      r0,#0x1000000
        0x08001974:    d301        ..      BCC      0x800197a ; HAL_SYSTICK_Config + 14
        0x08001976:    2001        .       MOVS     r0,#1
        0x08001978:    bd10        ..      POP      {r4,pc}
        0x0800197a:    f04f24e0    O..$    MOV      r4,#0xe000e000
        0x0800197e:    6160        `a      STR      r0,[r4,#0x14]
        0x08001980:    210f        .!      MOVS     r1,#0xf
        0x08001982:    1760        `.      ASRS     r0,r4,#29
        0x08001984:    f000ff2c    ..,.    BL       __NVIC_SetPriority ; 0x80027e0
        0x08001988:    2000        .       MOVS     r0,#0
        0x0800198a:    61a0        .a      STR      r0,[r4,#0x18]
        0x0800198c:    2007        .       MOVS     r0,#7
        0x0800198e:    6120         a      STR      r0,[r4,#0x10]
        0x08001990:    2000        .       MOVS     r0,#0
        0x08001992:    bd10        ..      POP      {r4,pc}
    i.HAL_UARTEx_RxEventCallback
    HAL_UARTEx_RxEventCallback
        0x08001994:    4770        pG      BX       lr
    i.HAL_UART_DMAStop
    HAL_UART_DMAStop
        0x08001996:    b510        ..      PUSH     {r4,lr}
        0x08001998:    4604        .F      MOV      r4,r0
        0x0800199a:    6800        .h      LDR      r0,[r0,#0]
        0x0800199c:    6940        @i      LDR      r0,[r0,#0x14]
        0x0800199e:    f8941041    ..A.    LDRB     r1,[r4,#0x41]
        0x080019a2:    f3c010c0    ....    UBFX     r0,r0,#7,#1
        0x080019a6:    2921        !)      CMP      r1,#0x21
        0x080019a8:    d111        ..      BNE      0x80019ce ; HAL_UART_DMAStop + 56
        0x080019aa:    b180        ..      CBZ      r0,0x80019ce ; HAL_UART_DMAStop + 56
        0x080019ac:    6820         h      LDR      r0,[r4,#0]
        0x080019ae:    3014        .0      ADDS     r0,r0,#0x14
        0x080019b0:    e8501f00    P...    LDREX    r1,[r0]
        0x080019b4:    f0210180    !...    BIC      r1,r1,#0x80
        0x080019b8:    e8401200    @...    STREX    r2,r1,[r0]
        0x080019bc:    2a00        .*      CMP      r2,#0
        0x080019be:    d1f5        ..      BNE      0x80019ac ; HAL_UART_DMAStop + 22
        0x080019c0:    6ba0        .k      LDR      r0,[r4,#0x38]
        0x080019c2:    b108        ..      CBZ      r0,0x80019c8 ; HAL_UART_DMAStop + 50
        0x080019c4:    f7fff924    ..$.    BL       HAL_DMA_Abort ; 0x8000c10
        0x080019c8:    4620         F      MOV      r0,r4
        0x080019ca:    f000fd13    ....    BL       UART_EndTxTransfer ; 0x80023f4
        0x080019ce:    6820         h      LDR      r0,[r4,#0]
        0x080019d0:    6940        @i      LDR      r0,[r0,#0x14]
        0x080019d2:    f8941042    ..B.    LDRB     r1,[r4,#0x42]
        0x080019d6:    f3c01080    ....    UBFX     r0,r0,#6,#1
        0x080019da:    2922        ")      CMP      r1,#0x22
        0x080019dc:    d111        ..      BNE      0x8001a02 ; HAL_UART_DMAStop + 108
        0x080019de:    b180        ..      CBZ      r0,0x8001a02 ; HAL_UART_DMAStop + 108
        0x080019e0:    6820         h      LDR      r0,[r4,#0]
        0x080019e2:    3014        .0      ADDS     r0,r0,#0x14
        0x080019e4:    e8501f00    P...    LDREX    r1,[r0]
        0x080019e8:    f0210140    !.@.    BIC      r1,r1,#0x40
        0x080019ec:    e8401200    @...    STREX    r2,r1,[r0]
        0x080019f0:    2a00        .*      CMP      r2,#0
        0x080019f2:    d1f5        ..      BNE      0x80019e0 ; HAL_UART_DMAStop + 74
        0x080019f4:    6be0        .k      LDR      r0,[r4,#0x3c]
        0x080019f6:    b108        ..      CBZ      r0,0x80019fc ; HAL_UART_DMAStop + 102
        0x080019f8:    f7fff90a    ....    BL       HAL_DMA_Abort ; 0x8000c10
        0x080019fc:    4620         F      MOV      r0,r4
        0x080019fe:    f000fcd2    ....    BL       UART_EndRxTransfer ; 0x80023a6
        0x08001a02:    2000        .       MOVS     r0,#0
        0x08001a04:    bd10        ..      POP      {r4,pc}
    i.HAL_UART_ErrorCallback
    HAL_UART_ErrorCallback
        0x08001a06:    4770        pG      BX       lr
    i.HAL_UART_IRQHandler
    HAL_UART_IRQHandler
        0x08001a08:    b5f8        ..      PUSH     {r3-r7,lr}
        0x08001a0a:    6801        .h      LDR      r1,[r0,#0]
        0x08001a0c:    4604        .F      MOV      r4,r0
        0x08001a0e:    6808        .h      LDR      r0,[r1,#0]
        0x08001a10:    68ca        .h      LDR      r2,[r1,#0xc]
        0x08001a12:    694b        Ki      LDR      r3,[r1,#0x14]
        0x08001a14:    f0100f0f    ....    TST      r0,#0xf
        0x08001a18:    f04f0500    O...    MOV      r5,#0
        0x08001a1c:    d059        Y.      BEQ      0x8001ad2 ; HAL_UART_IRQHandler + 202
        0x08001a1e:    f0030601    ....    AND      r6,r3,#1
        0x08001a22:    f4027790    ...w    AND      r7,r2,#0x120
        0x08001a26:    4337        7C      ORRS     r7,r7,r6
        0x08001a28:    d065        e.      BEQ      0x8001af6 ; HAL_UART_IRQHandler + 238
        0x08001a2a:    07c1        ..      LSLS     r1,r0,#31
        0x08001a2c:    d005        ..      BEQ      0x8001a3a ; HAL_UART_IRQHandler + 50
        0x08001a2e:    05d1        ..      LSLS     r1,r2,#23
        0x08001a30:    d503        ..      BPL      0x8001a3a ; HAL_UART_IRQHandler + 50
        0x08001a32:    6c61        al      LDR      r1,[r4,#0x44]
        0x08001a34:    f0410101    A...    ORR      r1,r1,#1
        0x08001a38:    6461        ad      STR      r1,[r4,#0x44]
        0x08001a3a:    0741        A.      LSLS     r1,r0,#29
        0x08001a3c:    d505        ..      BPL      0x8001a4a ; HAL_UART_IRQHandler + 66
        0x08001a3e:    07d9        ..      LSLS     r1,r3,#31
        0x08001a40:    d003        ..      BEQ      0x8001a4a ; HAL_UART_IRQHandler + 66
        0x08001a42:    6c61        al      LDR      r1,[r4,#0x44]
        0x08001a44:    f0410102    A...    ORR      r1,r1,#2
        0x08001a48:    6461        ad      STR      r1,[r4,#0x44]
        0x08001a4a:    0781        ..      LSLS     r1,r0,#30
        0x08001a4c:    d505        ..      BPL      0x8001a5a ; HAL_UART_IRQHandler + 82
        0x08001a4e:    07d9        ..      LSLS     r1,r3,#31
        0x08001a50:    d003        ..      BEQ      0x8001a5a ; HAL_UART_IRQHandler + 82
        0x08001a52:    6c61        al      LDR      r1,[r4,#0x44]
        0x08001a54:    f0410104    A...    ORR      r1,r1,#4
        0x08001a58:    6461        ad      STR      r1,[r4,#0x44]
        0x08001a5a:    0701        ..      LSLS     r1,r0,#28
        0x08001a5c:    d507        ..      BPL      0x8001a6e ; HAL_UART_IRQHandler + 102
        0x08001a5e:    f0020120    .. .    AND      r1,r2,#0x20
        0x08001a62:    4331        1C      ORRS     r1,r1,r6
        0x08001a64:    d003        ..      BEQ      0x8001a6e ; HAL_UART_IRQHandler + 102
        0x08001a66:    6c61        al      LDR      r1,[r4,#0x44]
        0x08001a68:    f0410108    A...    ORR      r1,r1,#8
        0x08001a6c:    6461        ad      STR      r1,[r4,#0x44]
        0x08001a6e:    6c61        al      LDR      r1,[r4,#0x44]
        0x08001a70:    2900        .)      CMP      r1,#0
        0x08001a72:    d03a        :.      BEQ      0x8001aea ; HAL_UART_IRQHandler + 226
        0x08001a74:    0680        ..      LSLS     r0,r0,#26
        0x08001a76:    d504        ..      BPL      0x8001a82 ; HAL_UART_IRQHandler + 122
        0x08001a78:    0690        ..      LSLS     r0,r2,#26
        0x08001a7a:    d502        ..      BPL      0x8001a82 ; HAL_UART_IRQHandler + 122
        0x08001a7c:    4620         F      MOV      r0,r4
        0x08001a7e:    f000fcc7    ....    BL       UART_Receive_IT ; 0x8002410
        0x08001a82:    6820         h      LDR      r0,[r4,#0]
        0x08001a84:    6940        @i      LDR      r0,[r0,#0x14]
        0x08001a86:    6c61        al      LDR      r1,[r4,#0x44]
        0x08001a88:    f3c01080    ....    UBFX     r0,r0,#6,#1
        0x08001a8c:    0709        ..      LSLS     r1,r1,#28
        0x08001a8e:    d400        ..      BMI      0x8001a92 ; HAL_UART_IRQHandler + 138
        0x08001a90:    b360        `.      CBZ      r0,0x8001aec ; HAL_UART_IRQHandler + 228
        0x08001a92:    4620         F      MOV      r0,r4
        0x08001a94:    f000fc87    ....    BL       UART_EndRxTransfer ; 0x80023a6
        0x08001a98:    6820         h      LDR      r0,[r4,#0]
        0x08001a9a:    6940        @i      LDR      r0,[r0,#0x14]
        0x08001a9c:    0640        @.      LSLS     r0,r0,#25
        0x08001a9e:    d521        !.      BPL      0x8001ae4 ; HAL_UART_IRQHandler + 220
        0x08001aa0:    6820         h      LDR      r0,[r4,#0]
        0x08001aa2:    3014        .0      ADDS     r0,r0,#0x14
        0x08001aa4:    e8501f00    P...    LDREX    r1,[r0]
        0x08001aa8:    f0210140    !.@.    BIC      r1,r1,#0x40
        0x08001aac:    e8401200    @...    STREX    r2,r1,[r0]
        0x08001ab0:    2a00        .*      CMP      r2,#0
        0x08001ab2:    d1f5        ..      BNE      0x8001aa0 ; HAL_UART_IRQHandler + 152
        0x08001ab4:    6be0        .k      LDR      r0,[r4,#0x3c]
        0x08001ab6:    b1a8        ..      CBZ      r0,0x8001ae4 ; HAL_UART_IRQHandler + 220
        0x08001ab8:    496e        nI      LDR      r1,[pc,#440] ; [0x8001c74] = 0x800225d
        0x08001aba:    6501        .e      STR      r1,[r0,#0x50]
        0x08001abc:    6be0        .k      LDR      r0,[r4,#0x3c]
        0x08001abe:    f7fff8f0    ....    BL       HAL_DMA_Abort_IT ; 0x8000ca2
        0x08001ac2:    2800        .(      CMP      r0,#0
        0x08001ac4:    d011        ..      BEQ      0x8001aea ; HAL_UART_IRQHandler + 226
        0x08001ac6:    6be0        .k      LDR      r0,[r4,#0x3c]
        0x08001ac8:    6d01        .m      LDR      r1,[r0,#0x50]
        0x08001aca:    b001        ..      ADD      sp,sp,#4
        0x08001acc:    e8bd40f0    ...@    POP      {r4-r7,lr}
        0x08001ad0:    4708        .G      BX       r1
        0x08001ad2:    0683        ..      LSLS     r3,r0,#26
        0x08001ad4:    d50f        ..      BPL      0x8001af6 ; HAL_UART_IRQHandler + 238
        0x08001ad6:    0693        ..      LSLS     r3,r2,#26
        0x08001ad8:    d50d        ..      BPL      0x8001af6 ; HAL_UART_IRQHandler + 238
        0x08001ada:    4620         F      MOV      r0,r4
        0x08001adc:    e8bd40f8    ...@    POP      {r3-r7,lr}
        0x08001ae0:    f000bc96    ....    B.W      UART_Receive_IT ; 0x8002410
        0x08001ae4:    4620         F      MOV      r0,r4
        0x08001ae6:    f7ffff8e    ....    BL       HAL_UART_ErrorCallback ; 0x8001a06
        0x08001aea:    bdf8        ..      POP      {r3-r7,pc}
        0x08001aec:    4620         F      MOV      r0,r4
        0x08001aee:    f7ffff8a    ....    BL       HAL_UART_ErrorCallback ; 0x8001a06
        0x08001af2:    6465        ed      STR      r5,[r4,#0x44]
        0x08001af4:    bdf8        ..      POP      {r3-r7,pc}
        0x08001af6:    6b26        &k      LDR      r6,[r4,#0x30]
        0x08001af8:    2320         #      MOVS     r3,#0x20
        0x08001afa:    2e01        ..      CMP      r6,#1
        0x08001afc:    d17d        }.      BNE      0x8001bfa ; HAL_UART_IRQHandler + 498
        0x08001afe:    06c6        ..      LSLS     r6,r0,#27
        0x08001b00:    d57b        {.      BPL      0x8001bfa ; HAL_UART_IRQHandler + 498
        0x08001b02:    06d6        ..      LSLS     r6,r2,#27
        0x08001b04:    d579        y.      BPL      0x8001bfa ; HAL_UART_IRQHandler + 498
        0x08001b06:    6808        .h      LDR      r0,[r1,#0]
        0x08001b08:    6848        Hh      LDR      r0,[r1,#4]
        0x08001b0a:    9000        ..      STR      r0,[sp,#0]
        0x08001b0c:    6948        Hi      LDR      r0,[r1,#0x14]
        0x08001b0e:    f04f0602    O...    MOV      r6,#2
        0x08001b12:    0640        @.      LSLS     r0,r0,#25
        0x08001b14:    d541        A.      BPL      0x8001b9a ; HAL_UART_IRQHandler + 402
        0x08001b16:    6be1        .k      LDR      r1,[r4,#0x3c]
        0x08001b18:    6808        .h      LDR      r0,[r1,#0]
        0x08001b1a:    6840        @h      LDR      r0,[r0,#4]
        0x08001b1c:    0400        ..      LSLS     r0,r0,#16
        0x08001b1e:    0c00        ..      LSRS     r0,r0,#16
        0x08001b20:    d0e8        ..      BEQ      0x8001af4 ; HAL_UART_IRQHandler + 236
        0x08001b22:    8da2        ..      LDRH     r2,[r4,#0x2c]
        0x08001b24:    4282        .B      CMP      r2,r0
        0x08001b26:    d9e5        ..      BLS      0x8001af4 ; HAL_UART_IRQHandler + 236
        0x08001b28:    85e0        ..      STRH     r0,[r4,#0x2e]
        0x08001b2a:    69c8        .i      LDR      r0,[r1,#0x1c]
        0x08001b2c:    f5b07f80    ....    CMP      r0,#0x100
        0x08001b30:    d02d        -.      BEQ      0x8001b8e ; HAL_UART_IRQHandler + 390
        0x08001b32:    6820         h      LDR      r0,[r4,#0]
        0x08001b34:    300c        .0      ADDS     r0,r0,#0xc
        0x08001b36:    e8501f00    P...    LDREX    r1,[r0]
        0x08001b3a:    f4217180    !..q    BIC      r1,r1,#0x100
        0x08001b3e:    e8401200    @...    STREX    r2,r1,[r0]
        0x08001b42:    2a00        .*      CMP      r2,#0
        0x08001b44:    d1f5        ..      BNE      0x8001b32 ; HAL_UART_IRQHandler + 298
        0x08001b46:    6820         h      LDR      r0,[r4,#0]
        0x08001b48:    3014        .0      ADDS     r0,r0,#0x14
        0x08001b4a:    e8501f00    P...    LDREX    r1,[r0]
        0x08001b4e:    f0210101    !...    BIC      r1,r1,#1
        0x08001b52:    e8401200    @...    STREX    r2,r1,[r0]
        0x08001b56:    2a00        .*      CMP      r2,#0
        0x08001b58:    d1f5        ..      BNE      0x8001b46 ; HAL_UART_IRQHandler + 318
        0x08001b5a:    6820         h      LDR      r0,[r4,#0]
        0x08001b5c:    3014        .0      ADDS     r0,r0,#0x14
        0x08001b5e:    e8501f00    P...    LDREX    r1,[r0]
        0x08001b62:    f0210140    !.@.    BIC      r1,r1,#0x40
        0x08001b66:    e8401200    @...    STREX    r2,r1,[r0]
        0x08001b6a:    2a00        .*      CMP      r2,#0
        0x08001b6c:    d1f5        ..      BNE      0x8001b5a ; HAL_UART_IRQHandler + 338
        0x08001b6e:    f8843042    ..B0    STRB     r3,[r4,#0x42]
        0x08001b72:    6325        %c      STR      r5,[r4,#0x30]
        0x08001b74:    6820         h      LDR      r0,[r4,#0]
        0x08001b76:    300c        .0      ADDS     r0,r0,#0xc
        0x08001b78:    e8501f00    P...    LDREX    r1,[r0]
        0x08001b7c:    f0210110    !...    BIC      r1,r1,#0x10
        0x08001b80:    e8401200    @...    STREX    r2,r1,[r0]
        0x08001b84:    2a00        .*      CMP      r2,#0
        0x08001b86:    d1f5        ..      BNE      0x8001b74 ; HAL_UART_IRQHandler + 364
        0x08001b88:    6be0        .k      LDR      r0,[r4,#0x3c]
        0x08001b8a:    f7fff841    ..A.    BL       HAL_DMA_Abort ; 0x8000c10
        0x08001b8e:    6366        fc      STR      r6,[r4,#0x34]
        0x08001b90:    8da0        ..      LDRH     r0,[r4,#0x2c]
        0x08001b92:    8de1        ..      LDRH     r1,[r4,#0x2e]
        0x08001b94:    1a40        @.      SUBS     r0,r0,r1
        0x08001b96:    b281        ..      UXTH     r1,r0
        0x08001b98:    e02a        *.      B        0x8001bf0 ; HAL_UART_IRQHandler + 488
        0x08001b9a:    8da0        ..      LDRH     r0,[r4,#0x2c]
        0x08001b9c:    8de1        ..      LDRH     r1,[r4,#0x2e]
        0x08001b9e:    1a40        @.      SUBS     r0,r0,r1
        0x08001ba0:    b281        ..      UXTH     r1,r0
        0x08001ba2:    8de0        ..      LDRH     r0,[r4,#0x2e]
        0x08001ba4:    2800        .(      CMP      r0,#0
        0x08001ba6:    d0a5        ..      BEQ      0x8001af4 ; HAL_UART_IRQHandler + 236
        0x08001ba8:    2900        .)      CMP      r1,#0
        0x08001baa:    d0a3        ..      BEQ      0x8001af4 ; HAL_UART_IRQHandler + 236
        0x08001bac:    6822        "h      LDR      r2,[r4,#0]
        0x08001bae:    320c        .2      ADDS     r2,r2,#0xc
        0x08001bb0:    e8520f00    R...    LDREX    r0,[r2]
        0x08001bb4:    f4207090     ..p    BIC      r0,r0,#0x120
        0x08001bb8:    e8420700    B...    STREX    r7,r0,[r2]
        0x08001bbc:    2f00        ./      CMP      r7,#0
        0x08001bbe:    d1f5        ..      BNE      0x8001bac ; HAL_UART_IRQHandler + 420
        0x08001bc0:    6820         h      LDR      r0,[r4,#0]
        0x08001bc2:    3014        .0      ADDS     r0,r0,#0x14
        0x08001bc4:    e8502f00    P../    LDREX    r2,[r0]
        0x08001bc8:    f0220201    "...    BIC      r2,r2,#1
        0x08001bcc:    e8402700    @..'    STREX    r7,r2,[r0]
        0x08001bd0:    2f00        ./      CMP      r7,#0
        0x08001bd2:    d1f5        ..      BNE      0x8001bc0 ; HAL_UART_IRQHandler + 440
        0x08001bd4:    f8843042    ..B0    STRB     r3,[r4,#0x42]
        0x08001bd8:    6325        %c      STR      r5,[r4,#0x30]
        0x08001bda:    6820         h      LDR      r0,[r4,#0]
        0x08001bdc:    300c        .0      ADDS     r0,r0,#0xc
        0x08001bde:    e8502f00    P../    LDREX    r2,[r0]
        0x08001be2:    f0220210    "...    BIC      r2,r2,#0x10
        0x08001be6:    e8402300    @..#    STREX    r3,r2,[r0]
        0x08001bea:    2b00        .+      CMP      r3,#0
        0x08001bec:    d1f5        ..      BNE      0x8001bda ; HAL_UART_IRQHandler + 466
        0x08001bee:    6366        fc      STR      r6,[r4,#0x34]
        0x08001bf0:    4620         F      MOV      r0,r4
        0x08001bf2:    f7fffecf    ....    BL       HAL_UARTEx_RxEventCallback ; 0x8001994
        0x08001bf6:    bdf8        ..      POP      {r3-r7,pc}
        0x08001bf8:    e7ff        ..      B        0x8001bfa ; HAL_UART_IRQHandler + 498
        0x08001bfa:    0605        ..      LSLS     r5,r0,#24
        0x08001bfc:    d52b        +.      BPL      0x8001c56 ; HAL_UART_IRQHandler + 590
        0x08001bfe:    0615        ..      LSLS     r5,r2,#24
        0x08001c00:    d529        ).      BPL      0x8001c56 ; HAL_UART_IRQHandler + 590
        0x08001c02:    f8940041    ..A.    LDRB     r0,[r4,#0x41]
        0x08001c06:    2821        !(      CMP      r0,#0x21
        0x08001c08:    d1f5        ..      BNE      0x8001bf6 ; HAL_UART_IRQHandler + 494
        0x08001c0a:    68a0        .h      LDR      r0,[r4,#8]
        0x08001c0c:    f5b05f80    ..._    CMP      r0,#0x1000
        0x08001c10:    d101        ..      BNE      0x8001c16 ; HAL_UART_IRQHandler + 526
        0x08001c12:    6920         i      LDR      r0,[r4,#0x10]
        0x08001c14:    b1b0        ..      CBZ      r0,0x8001c44 ; HAL_UART_IRQHandler + 572
        0x08001c16:    6a20         j      LDR      r0,[r4,#0x20]
        0x08001c18:    1c41        A.      ADDS     r1,r0,#1
        0x08001c1a:    6221        !b      STR      r1,[r4,#0x20]
        0x08001c1c:    6821        !h      LDR      r1,[r4,#0]
        0x08001c1e:    7800        .x      LDRB     r0,[r0,#0]
        0x08001c20:    6048        H`      STR      r0,[r1,#4]
        0x08001c22:    8ce0        ..      LDRH     r0,[r4,#0x26]
        0x08001c24:    1e40        @.      SUBS     r0,r0,#1
        0x08001c26:    0400        ..      LSLS     r0,r0,#16
        0x08001c28:    0c00        ..      LSRS     r0,r0,#16
        0x08001c2a:    84e0        ..      STRH     r0,[r4,#0x26]
        0x08001c2c:    d1e3        ..      BNE      0x8001bf6 ; HAL_UART_IRQHandler + 494
        0x08001c2e:    6820         h      LDR      r0,[r4,#0]
        0x08001c30:    68c1        .h      LDR      r1,[r0,#0xc]
        0x08001c32:    f0210180    !...    BIC      r1,r1,#0x80
        0x08001c36:    60c1        .`      STR      r1,[r0,#0xc]
        0x08001c38:    6820         h      LDR      r0,[r4,#0]
        0x08001c3a:    68c1        .h      LDR      r1,[r0,#0xc]
        0x08001c3c:    f0410140    A.@.    ORR      r1,r1,#0x40
        0x08001c40:    60c1        .`      STR      r1,[r0,#0xc]
        0x08001c42:    e7d8        ..      B        0x8001bf6 ; HAL_UART_IRQHandler + 494
        0x08001c44:    6a20         j      LDR      r0,[r4,#0x20]
        0x08001c46:    8800        ..      LDRH     r0,[r0,#0]
        0x08001c48:    f3c00008    ....    UBFX     r0,r0,#0,#9
        0x08001c4c:    6048        H`      STR      r0,[r1,#4]
        0x08001c4e:    6a20         j      LDR      r0,[r4,#0x20]
        0x08001c50:    1c80        ..      ADDS     r0,r0,#2
        0x08001c52:    6220         b      STR      r0,[r4,#0x20]
        0x08001c54:    e7e5        ..      B        0x8001c22 ; HAL_UART_IRQHandler + 538
        0x08001c56:    0640        @.      LSLS     r0,r0,#25
        0x08001c58:    d5cd        ..      BPL      0x8001bf6 ; HAL_UART_IRQHandler + 494
        0x08001c5a:    0650        P.      LSLS     r0,r2,#25
        0x08001c5c:    d5cb        ..      BPL      0x8001bf6 ; HAL_UART_IRQHandler + 494
        0x08001c5e:    68ca        .h      LDR      r2,[r1,#0xc]
        0x08001c60:    4620         F      MOV      r0,r4
        0x08001c62:    f0220240    ".@.    BIC      r2,r2,#0x40
        0x08001c66:    60ca        .`      STR      r2,[r1,#0xc]
        0x08001c68:    f8843041    ..A0    STRB     r3,[r4,#0x41]
        0x08001c6c:    f000f932    ..2.    BL       HAL_UART_TxCpltCallback ; 0x8001ed4
        0x08001c70:    e7c1        ..      B        0x8001bf6 ; HAL_UART_IRQHandler + 494
    $d
        0x08001c72:    0000        ..      DCW    0
        0x08001c74:    0800225d    ]"..    DCD    134226525
    $t
    i.HAL_UART_Init
