tangbaishu/Personal/MDK-ARM/Out/STM32F407ZGT6_Embedded_V1.asm
    HAL_UART_Init
        0x08001c78:    b570        p.      PUSH     {r4-r6,lr}
        0x08001c7a:    0004        ..      MOVS     r4,r0
        0x08001c7c:    d004        ..      BEQ      0x8001c88 ; HAL_UART_Init + 16
        0x08001c7e:    f8940041    ..A.    LDRB     r0,[r4,#0x41]
        0x08001c82:    2500        .%      MOVS     r5,#0
        0x08001c84:    b110        ..      CBZ      r0,0x8001c8c ; HAL_UART_Init + 20
        0x08001c86:    e006        ..      B        0x8001c96 ; HAL_UART_Init + 30
        0x08001c88:    2001        .       MOVS     r0,#1
        0x08001c8a:    bd70        p.      POP      {r4-r6,pc}
        0x08001c8c:    f8845040    ..@P    STRB     r5,[r4,#0x40]
        0x08001c90:    4620         F      MOV      r0,r4
        0x08001c92:    f000f823    ..#.    BL       HAL_UART_MspInit ; 0x8001cdc
        0x08001c96:    2024        $       MOVS     r0,#0x24
        0x08001c98:    f8840041    ..A.    STRB     r0,[r4,#0x41]
        0x08001c9c:    6820         h      LDR      r0,[r4,#0]
        0x08001c9e:    68c1        .h      LDR      r1,[r0,#0xc]
        0x08001ca0:    f4215100    !..Q    BIC      r1,r1,#0x2000
        0x08001ca4:    60c1        .`      STR      r1,[r0,#0xc]
        0x08001ca6:    4620         F      MOV      r0,r4
        0x08001ca8:    f000fc14    ....    BL       UART_SetConfig ; 0x80024d4
        0x08001cac:    6820         h      LDR      r0,[r4,#0]
        0x08001cae:    6901        .i      LDR      r1,[r0,#0x10]
        0x08001cb0:    f4214190    !..A    BIC      r1,r1,#0x4800
        0x08001cb4:    6101        .a      STR      r1,[r0,#0x10]
        0x08001cb6:    6820         h      LDR      r0,[r4,#0]
        0x08001cb8:    6941        Ai      LDR      r1,[r0,#0x14]
        0x08001cba:    f021012a    !.*.    BIC      r1,r1,#0x2a
        0x08001cbe:    6141        Aa      STR      r1,[r0,#0x14]
        0x08001cc0:    6820         h      LDR      r0,[r4,#0]
        0x08001cc2:    68c1        .h      LDR      r1,[r0,#0xc]
        0x08001cc4:    f4415100    A..Q    ORR      r1,r1,#0x2000
        0x08001cc8:    60c1        .`      STR      r1,[r0,#0xc]
        0x08001cca:    6465        ed      STR      r5,[r4,#0x44]
        0x08001ccc:    2020                MOVS     r0,#0x20
        0x08001cce:    f8840041    ..A.    STRB     r0,[r4,#0x41]
        0x08001cd2:    f8840042    ..B.    STRB     r0,[r4,#0x42]
        0x08001cd6:    6365        ec      STR      r5,[r4,#0x34]
        0x08001cd8:    2000        .       MOVS     r0,#0
        0x08001cda:    bd70        p.      POP      {r4-r6,pc}
    i.HAL_UART_MspInit
    HAL_UART_MspInit
        0x08001cdc:    b570        p.      PUSH     {r4-r6,lr}
        0x08001cde:    b086        ..      SUB      sp,sp,#0x18
        0x08001ce0:    4604        .F      MOV      r4,r0
        0x08001ce2:    2114        .!      MOVS     r1,#0x14
        0x08001ce4:    4668        hF      MOV      r0,sp
        0x08001ce6:    f7fefad5    ....    BL       __aeabi_memclr ; 0x8000294
        0x08001cea:    4e23        #N      LDR      r6,[pc,#140] ; [0x8001d78] = 0x40011000
        0x08001cec:    6822        "h      LDR      r2,[r4,#0]
        0x08001cee:    2100        .!      MOVS     r1,#0
        0x08001cf0:    4822        "H      LDR      r0,[pc,#136] ; [0x8001d7c] = 0x40023830
        0x08001cf2:    2302        .#      MOVS     r3,#2
        0x08001cf4:    2403        .$      MOVS     r4,#3
        0x08001cf6:    2507        .%      MOVS     r5,#7
        0x08001cf8:    42b2        .B      CMP      r2,r6
        0x08001cfa:    d11a        ..      BNE      0x8001d32 ; HAL_UART_MspInit + 86
        0x08001cfc:    4a1f        .J      LDR      r2,[pc,#124] ; [0x8001d7c] = 0x40023830
        0x08001cfe:    3214        .2      ADDS     r2,r2,#0x14
        0x08001d00:    6816        .h      LDR      r6,[r2,#0]
        0x08001d02:    f0460610    F...    ORR      r6,r6,#0x10
        0x08001d06:    6016        .`      STR      r6,[r2,#0]
        0x08001d08:    6812        .h      LDR      r2,[r2,#0]
        0x08001d0a:    f0020210    ....    AND      r2,r2,#0x10
        0x08001d0e:    9205        ..      STR      r2,[sp,#0x14]
        0x08001d10:    6802        .h      LDR      r2,[r0,#0]
        0x08001d12:    f0420201    B...    ORR      r2,r2,#1
        0x08001d16:    6002        .`      STR      r2,[r0,#0]
        0x08001d18:    6800        .h      LDR      r0,[r0,#0]
        0x08001d1a:    aa02        ..      ADD      r2,sp,#8
        0x08001d1c:    f0000001    ....    AND      r0,r0,#1
        0x08001d20:    9005        ..      STR      r0,[sp,#0x14]
        0x08001d22:    e8820032    ..2.    STM      r2,{r1,r4,r5}
        0x08001d26:    0260        `.      LSLS     r0,r4,#9
        0x08001d28:    e9cd0300    ....    STRD     r0,r3,[sp,#0]
        0x08001d2c:    4669        iF      MOV      r1,sp
        0x08001d2e:    4814        .H      LDR      r0,[pc,#80] ; [0x8001d80] = 0x40020000
        0x08001d30:    e01d        ..      B        0x8001d6e ; HAL_UART_MspInit + 146
        0x08001d32:    4e14        .N      LDR      r6,[pc,#80] ; [0x8001d84] = 0x40004800
        0x08001d34:    42b2        .B      CMP      r2,r6
        0x08001d36:    d11c        ..      BNE      0x8001d72 ; HAL_UART_MspInit + 150
        0x08001d38:    4a10        .J      LDR      r2,[pc,#64] ; [0x8001d7c] = 0x40023830
        0x08001d3a:    3210        .2      ADDS     r2,r2,#0x10
        0x08001d3c:    6816        .h      LDR      r6,[r2,#0]
        0x08001d3e:    f4462680    F..&    ORR      r6,r6,#0x40000
        0x08001d42:    6016        .`      STR      r6,[r2,#0]
        0x08001d44:    6812        .h      LDR      r2,[r2,#0]
        0x08001d46:    f4022280    ..."    AND      r2,r2,#0x40000
        0x08001d4a:    9205        ..      STR      r2,[sp,#0x14]
        0x08001d4c:    6802        .h      LDR      r2,[r0,#0]
        0x08001d4e:    f0420202    B...    ORR      r2,r2,#2
        0x08001d52:    6002        .`      STR      r2,[r0,#0]
        0x08001d54:    6800        .h      LDR      r0,[r0,#0]
        0x08001d56:    aa02        ..      ADD      r2,sp,#8
        0x08001d58:    f0000002    ....    AND      r0,r0,#2
        0x08001d5c:    9005        ..      STR      r0,[sp,#0x14]
        0x08001d5e:    e8820032    ..2.    STM      r2,{r1,r4,r5}
        0x08001d62:    f44f6040    O.@`    MOV      r0,#0xc00
        0x08001d66:    e9cd0300    ....    STRD     r0,r3,[sp,#0]
        0x08001d6a:    4669        iF      MOV      r1,sp
        0x08001d6c:    4806        .H      LDR      r0,[pc,#24] ; [0x8001d88] = 0x40020400
        0x08001d6e:    f7fff9b7    ....    BL       HAL_GPIO_Init ; 0x80010e0
        0x08001d72:    b006        ..      ADD      sp,sp,#0x18
        0x08001d74:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x08001d76:    0000        ..      DCW    0
        0x08001d78:    40011000    ...@    DCD    1073811456
        0x08001d7c:    40023830    08.@    DCD    1073887280
        0x08001d80:    40020000    ...@    DCD    1073872896
        0x08001d84:    40004800    .H.@    DCD    1073760256
        0x08001d88:    40020400    ...@    DCD    1073873920
    $t
    i.HAL_UART_Receive
    HAL_UART_Receive
        0x08001d8c:    e92d4ff8    -..O    PUSH     {r3-r11,lr}
        0x08001d90:    4604        .F      MOV      r4,r0
        0x08001d92:    f8900042    ..B.    LDRB     r0,[r0,#0x42]
        0x08001d96:    469a        .F      MOV      r10,r3
        0x08001d98:    4616        .F      MOV      r6,r2
        0x08001d9a:    460d        .F      MOV      r5,r1
        0x08001d9c:    2820         (      CMP      r0,#0x20
        0x08001d9e:    d002        ..      BEQ      0x8001da6 ; HAL_UART_Receive + 26
        0x08001da0:    2002        .       MOVS     r0,#2
        0x08001da2:    e8bd8ff8    ....    POP      {r3-r11,pc}
        0x08001da6:    b1b5        ..      CBZ      r5,0x8001dd6 ; HAL_UART_Receive + 74
        0x08001da8:    b1ae        ..      CBZ      r6,0x8001dd6 ; HAL_UART_Receive + 74
        0x08001daa:    2000        .       MOVS     r0,#0
        0x08001dac:    6460        `d      STR      r0,[r4,#0x44]
        0x08001dae:    2122        "!      MOVS     r1,#0x22
        0x08001db0:    f8841042    ..B.    STRB     r1,[r4,#0x42]
        0x08001db4:    6320         c      STR      r0,[r4,#0x30]
        0x08001db6:    f7fffa99    ....    BL       HAL_GetTick ; 0x80012ec
        0x08001dba:    85a6        ..      STRH     r6,[r4,#0x2c]
        0x08001dbc:    4681        .F      MOV      r9,r0
        0x08001dbe:    85e6        ..      STRH     r6,[r4,#0x2e]
        0x08001dc0:    68a0        .h      LDR      r0,[r4,#8]
        0x08001dc2:    f44f5880    O..X    MOV      r8,#0x1000
        0x08001dc6:    2720         '      MOVS     r7,#0x20
        0x08001dc8:    4540        @E      CMP      r0,r8
        0x08001dca:    d101        ..      BNE      0x8001dd0 ; HAL_UART_Receive + 68
        0x08001dcc:    6920         i      LDR      r0,[r4,#0x10]
        0x08001dce:    b120         .      CBZ      r0,0x8001dda ; HAL_UART_Receive + 78
        0x08001dd0:    462e        .F      MOV      r6,r5
        0x08001dd2:    2500        .%      MOVS     r5,#0
        0x08001dd4:    e029        ).      B        0x8001e2a ; HAL_UART_Receive + 158
        0x08001dd6:    2001        .       MOVS     r0,#1
        0x08001dd8:    e7e3        ..      B        0x8001da2 ; HAL_UART_Receive + 22
        0x08001dda:    2600        .&      MOVS     r6,#0
        0x08001ddc:    e025        %.      B        0x8001e2a ; HAL_UART_Receive + 158
        0x08001dde:    464b        KF      MOV      r3,r9
        0x08001de0:    2200        ."      MOVS     r2,#0
        0x08001de2:    2120         !      MOVS     r1,#0x20
        0x08001de4:    4620         F      MOV      r0,r4
        0x08001de6:    f8cda000    ....    STR      r10,[sp,#0]
        0x08001dea:    f000fc41    ..A.    BL       UART_WaitOnFlagUntilTimeout ; 0x8002670
        0x08001dee:    b118        ..      CBZ      r0,0x8001df8 ; HAL_UART_Receive + 108
        0x08001df0:    f8847042    ..Bp    STRB     r7,[r4,#0x42]
        0x08001df4:    2003        .       MOVS     r0,#3
        0x08001df6:    e7d4        ..      B        0x8001da2 ; HAL_UART_Receive + 22
        0x08001df8:    b126        &.      CBZ      r6,0x8001e04 ; HAL_UART_Receive + 120
        0x08001dfa:    68a0        .h      LDR      r0,[r4,#8]
        0x08001dfc:    4540        @E      CMP      r0,r8
        0x08001dfe:    d01a        ..      BEQ      0x8001e36 ; HAL_UART_Receive + 170
        0x08001e00:    b138        8.      CBZ      r0,0x8001e12 ; HAL_UART_Receive + 134
        0x08001e02:    e008        ..      B        0x8001e16 ; HAL_UART_Receive + 138
        0x08001e04:    6820         h      LDR      r0,[r4,#0]
        0x08001e06:    6840        @h      LDR      r0,[r0,#4]
        0x08001e08:    f3c00008    ....    UBFX     r0,r0,#0,#9
        0x08001e0c:    f8250b02    %...    STRH     r0,[r5],#2
        0x08001e10:    e008        ..      B        0x8001e24 ; HAL_UART_Receive + 152
        0x08001e12:    6920         i      LDR      r0,[r4,#0x10]
        0x08001e14:    b178        x.      CBZ      r0,0x8001e36 ; HAL_UART_Receive + 170
        0x08001e16:    6820         h      LDR      r0,[r4,#0]
        0x08001e18:    6840        @h      LDR      r0,[r0,#4]
        0x08001e1a:    f000007f    ....    AND      r0,r0,#0x7f
        0x08001e1e:    bf00        ..      NOP      
        0x08001e20:    f8060b01    ....    STRB     r0,[r6],#1
        0x08001e24:    8de0        ..      LDRH     r0,[r4,#0x2e]
        0x08001e26:    1e40        @.      SUBS     r0,r0,#1
        0x08001e28:    85e0        ..      STRH     r0,[r4,#0x2e]
        0x08001e2a:    8de0        ..      LDRH     r0,[r4,#0x2e]
        0x08001e2c:    2800        .(      CMP      r0,#0
        0x08001e2e:    d1d6        ..      BNE      0x8001dde ; HAL_UART_Receive + 82
        0x08001e30:    f8847042    ..Bp    STRB     r7,[r4,#0x42]
        0x08001e34:    e7b5        ..      B        0x8001da2 ; HAL_UART_Receive + 22
        0x08001e36:    6820         h      LDR      r0,[r4,#0]
        0x08001e38:    6840        @h      LDR      r0,[r0,#4]
        0x08001e3a:    e7f1        ..      B        0x8001e20 ; HAL_UART_Receive + 148
    i.HAL_UART_Receive_DMA
    HAL_UART_Receive_DMA
        0x08001e3c:    f8903042    ..B0    LDRB     r3,[r0,#0x42]
        0x08001e40:    2b20         +      CMP      r3,#0x20
        0x08001e42:    d001        ..      BEQ      0x8001e48 ; HAL_UART_Receive_DMA + 12
        0x08001e44:    2002        .       MOVS     r0,#2
        0x08001e46:    4770        pG      BX       lr
        0x08001e48:    b121        !.      CBZ      r1,0x8001e54 ; HAL_UART_Receive_DMA + 24
        0x08001e4a:    b11a        ..      CBZ      r2,0x8001e54 ; HAL_UART_Receive_DMA + 24
        0x08001e4c:    2300        .#      MOVS     r3,#0
        0x08001e4e:    6303        .c      STR      r3,[r0,#0x30]
        0x08001e50:    f000bbc6    ....    B.W      UART_Start_Receive_DMA ; 0x80025e0
        0x08001e54:    2001        .       MOVS     r0,#1
        0x08001e56:    4770        pG      BX       lr
    i.HAL_UART_RxCpltCallback
    HAL_UART_RxCpltCallback
        0x08001e58:    4770        pG      BX       lr
    i.HAL_UART_RxHalfCpltCallback
    HAL_UART_RxHalfCpltCallback
        0x08001e5a:    4770        pG      BX       lr
    i.HAL_UART_Transmit_DMA
    HAL_UART_Transmit_DMA
        0x08001e5c:    b570        p.      PUSH     {r4-r6,lr}
        0x08001e5e:    4604        .F      MOV      r4,r0
        0x08001e60:    f8900041    ..A.    LDRB     r0,[r0,#0x41]
        0x08001e64:    2820         (      CMP      r0,#0x20
        0x08001e66:    d001        ..      BEQ      0x8001e6c ; HAL_UART_Transmit_DMA + 16
        0x08001e68:    2002        .       MOVS     r0,#2
        0x08001e6a:    bd70        p.      POP      {r4-r6,pc}
        0x08001e6c:    b349        I.      CBZ      r1,0x8001ec2 ; HAL_UART_Transmit_DMA + 102
        0x08001e6e:    b342        B.      CBZ      r2,0x8001ec2 ; HAL_UART_Transmit_DMA + 102
        0x08001e70:    6221        !b      STR      r1,[r4,#0x20]
        0x08001e72:    84a2        ..      STRH     r2,[r4,#0x24]
        0x08001e74:    84e2        ..      STRH     r2,[r4,#0x26]
        0x08001e76:    2000        .       MOVS     r0,#0
        0x08001e78:    6460        `d      STR      r0,[r4,#0x44]
        0x08001e7a:    2321        !#      MOVS     r3,#0x21
        0x08001e7c:    f8843041    ..A0    STRB     r3,[r4,#0x41]
        0x08001e80:    6ba5        .k      LDR      r5,[r4,#0x38]
        0x08001e82:    4b11        .K      LDR      r3,[pc,#68] ; [0x8001ec8] = 0x800235b
        0x08001e84:    63eb        .c      STR      r3,[r5,#0x3c]
        0x08001e86:    6ba5        .k      LDR      r5,[r4,#0x38]
        0x08001e88:    4b10        .K      LDR      r3,[pc,#64] ; [0x8001ecc] = 0x800239d
        0x08001e8a:    642b        +d      STR      r3,[r5,#0x40]
        0x08001e8c:    6ba5        .k      LDR      r5,[r4,#0x38]
        0x08001e8e:    4b10        .K      LDR      r3,[pc,#64] ; [0x8001ed0] = 0x800226d
        0x08001e90:    64eb        .d      STR      r3,[r5,#0x4c]
        0x08001e92:    6ba3        .k      LDR      r3,[r4,#0x38]
        0x08001e94:    6518        .e      STR      r0,[r3,#0x50]
        0x08001e96:    6825        %h      LDR      r5,[r4,#0]
        0x08001e98:    4613        .F      MOV      r3,r2
        0x08001e9a:    1d2a        *.      ADDS     r2,r5,#4
        0x08001e9c:    6ba0        .k      LDR      r0,[r4,#0x38]
        0x08001e9e:    f7fff84d    ..M.    BL       HAL_DMA_Start_IT ; 0x8000f3c
        0x08001ea2:    6821        !h      LDR      r1,[r4,#0]
        0x08001ea4:    f06f0040    o.@.    MVN      r0,#0x40
        0x08001ea8:    6008        .`      STR      r0,[r1,#0]
        0x08001eaa:    6820         h      LDR      r0,[r4,#0]
        0x08001eac:    3014        .0      ADDS     r0,r0,#0x14
        0x08001eae:    e8501f00    P...    LDREX    r1,[r0]
        0x08001eb2:    f0410180    A...    ORR      r1,r1,#0x80
        0x08001eb6:    e8401200    @...    STREX    r2,r1,[r0]
        0x08001eba:    2a00        .*      CMP      r2,#0
        0x08001ebc:    d1f5        ..      BNE      0x8001eaa ; HAL_UART_Transmit_DMA + 78
        0x08001ebe:    2000        .       MOVS     r0,#0
        0x08001ec0:    bd70        p.      POP      {r4-r6,pc}
        0x08001ec2:    2001        .       MOVS     r0,#1
        0x08001ec4:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x08001ec6:    0000        ..      DCW    0
        0x08001ec8:    0800235b    [#..    DCD    134226779
        0x08001ecc:    0800239d    .#..    DCD    134226845
        0x08001ed0:    0800226d    m"..    DCD    134226541
    $t
    i.HAL_UART_TxCpltCallback
    HAL_UART_TxCpltCallback
        0x08001ed4:    4770        pG      BX       lr
    i.HAL_UART_TxHalfCpltCallback
    HAL_UART_TxHalfCpltCallback
        0x08001ed6:    4770        pG      BX       lr
    i.HardFault_Handler
    HardFault_Handler
        0x08001ed8:    e7fe        ..      B        HardFault_Handler ; 0x8001ed8
    i.LED_Driver_Check
    LED_Driver_Check
        0x08001eda:    b510        ..      PUSH     {r4,lr}
        0x08001edc:    f000f826    ..&.    BL       LED_Driver_Init ; 0x8001f2c
        0x08001ee0:    2000        .       MOVS     r0,#0
        0x08001ee2:    f000f85f    .._.    BL       LED_Driver_ON ; 0x8001fa4
        0x08001ee6:    2001        .       MOVS     r0,#1
        0x08001ee8:    f000f85c    ..\.    BL       LED_Driver_ON ; 0x8001fa4
        0x08001eec:    f44f747a    O.zt    MOV      r4,#0x3e8
        0x08001ef0:    4620         F      MOV      r0,r4
        0x08001ef2:    f7fff85b    ..[.    BL       HAL_Delay ; 0x8000fac
        0x08001ef6:    2000        .       MOVS     r0,#0
        0x08001ef8:    f000f844    ..D.    BL       LED_Driver_OFF ; 0x8001f84
        0x08001efc:    2001        .       MOVS     r0,#1
        0x08001efe:    f000f841    ..A.    BL       LED_Driver_OFF ; 0x8001f84
        0x08001f02:    4620         F      MOV      r0,r4
        0x08001f04:    f7fff852    ..R.    BL       HAL_Delay ; 0x8000fac
        0x08001f08:    2000        .       MOVS     r0,#0
        0x08001f0a:    f000f85b    ..[.    BL       LED_Driver_Turn ; 0x8001fc4
        0x08001f0e:    2001        .       MOVS     r0,#1
        0x08001f10:    f000f858    ..X.    BL       LED_Driver_Turn ; 0x8001fc4
        0x08001f14:    4620         F      MOV      r0,r4
        0x08001f16:    f7fff849    ..I.    BL       HAL_Delay ; 0x8000fac
        0x08001f1a:    2000        .       MOVS     r0,#0
        0x08001f1c:    f000f832    ..2.    BL       LED_Driver_OFF ; 0x8001f84
        0x08001f20:    e8bd4010    ...@    POP      {r4,lr}
        0x08001f24:    2001        .       MOVS     r0,#1
        0x08001f26:    f000b82d    ..-.    B.W      LED_Driver_OFF ; 0x8001f84
        0x08001f2a:    0000        ..      MOVS     r0,r0
    i.LED_Driver_Init
    LED_Driver_Init
        0x08001f2c:    4813        .H      LDR      r0,[pc,#76] ; [0x8001f7c] = 0x40023830
        0x08001f2e:    b500        ..      PUSH     {lr}
        0x08001f30:    6802        .h      LDR      r2,[r0,#0]
        0x08001f32:    b087        ..      SUB      sp,sp,#0x1c
        0x08001f34:    2100        .!      MOVS     r1,#0
        0x08001f36:    f0420220    B. .    ORR      r2,r2,#0x20
        0x08001f3a:    6002        .`      STR      r2,[r0,#0]
        0x08001f3c:    6802        .h      LDR      r2,[r0,#0]
        0x08001f3e:    f0020220    .. .    AND      r2,r2,#0x20
        0x08001f42:    9205        ..      STR      r2,[sp,#0x14]
        0x08001f44:    6802        .h      LDR      r2,[r0,#0]
        0x08001f46:    f0420220    B. .    ORR      r2,r2,#0x20
        0x08001f4a:    6002        .`      STR      r2,[r0,#0]
        0x08001f4c:    6800        .h      LDR      r0,[r0,#0]
        0x08001f4e:    f0000020    .. .    AND      r0,r0,#0x20
        0x08001f52:    9005        ..      STR      r0,[sp,#0x14]
        0x08001f54:    2001        .       MOVS     r0,#1
        0x08001f56:    9001        ..      STR      r0,[sp,#4]
        0x08001f58:    f44f60c0    O..`    MOV      r0,#0x600
        0x08001f5c:    9000        ..      STR      r0,[sp,#0]
        0x08001f5e:    2003        .       MOVS     r0,#3
        0x08001f60:    e9cd1002    ....    STRD     r1,r0,[sp,#8]
        0x08001f64:    4669        iF      MOV      r1,sp
        0x08001f66:    4806        .H      LDR      r0,[pc,#24] ; [0x8001f80] = 0x40021400
        0x08001f68:    f7fff8ba    ....    BL       HAL_GPIO_Init ; 0x80010e0
        0x08001f6c:    2000        .       MOVS     r0,#0
        0x08001f6e:    f000f809    ....    BL       LED_Driver_OFF ; 0x8001f84
        0x08001f72:    2001        .       MOVS     r0,#1
        0x08001f74:    f000f806    ....    BL       LED_Driver_OFF ; 0x8001f84
        0x08001f78:    b007        ..      ADD      sp,sp,#0x1c
        0x08001f7a:    bd00        ..      POP      {pc}
    $d
        0x08001f7c:    40023830    08.@    DCD    1073887280
        0x08001f80:    40021400    ...@    DCD    1073878016
    $t
    i.LED_Driver_OFF
    LED_Driver_OFF
        0x08001f84:    4b06        .K      LDR      r3,[pc,#24] ; [0x8001fa0] = 0x40021400
        0x08001f86:    b130        0.      CBZ      r0,0x8001f96 ; LED_Driver_OFF + 18
        0x08001f88:    2801        .(      CMP      r0,#1
        0x08001f8a:    d107        ..      BNE      0x8001f9c ; LED_Driver_OFF + 24
        0x08001f8c:    2201        ."      MOVS     r2,#1
        0x08001f8e:    0281        ..      LSLS     r1,r0,#10
        0x08001f90:    4618        .F      MOV      r0,r3
        0x08001f92:    f7ffb9a5    ....    B        HAL_GPIO_WritePin ; 0x80012e0
        0x08001f96:    2201        ."      MOVS     r2,#1
        0x08001f98:    0251        Q.      LSLS     r1,r2,#9
        0x08001f9a:    e7f9        ..      B        0x8001f90 ; LED_Driver_OFF + 12
        0x08001f9c:    4770        pG      BX       lr
    $d
        0x08001f9e:    0000        ..      DCW    0
        0x08001fa0:    40021400    ...@    DCD    1073878016
    $t
    i.LED_Driver_ON
    LED_Driver_ON
        0x08001fa4:    4b06        .K      LDR      r3,[pc,#24] ; [0x8001fc0] = 0x40021400
        0x08001fa6:    b130        0.      CBZ      r0,0x8001fb6 ; LED_Driver_ON + 18
        0x08001fa8:    2801        .(      CMP      r0,#1
        0x08001faa:    d108        ..      BNE      0x8001fbe ; LED_Driver_ON + 26
        0x08001fac:    2200        ."      MOVS     r2,#0
        0x08001fae:    0281        ..      LSLS     r1,r0,#10
        0x08001fb0:    4618        .F      MOV      r0,r3
        0x08001fb2:    f7ffb995    ....    B        HAL_GPIO_WritePin ; 0x80012e0
        0x08001fb6:    2200        ."      MOVS     r2,#0
        0x08001fb8:    f44f7100    O..q    MOV      r1,#0x200
        0x08001fbc:    e7f8        ..      B        0x8001fb0 ; LED_Driver_ON + 12
        0x08001fbe:    4770        pG      BX       lr
    $d
        0x08001fc0:    40021400    ...@    DCD    1073878016
    $t
    i.LED_Driver_Turn
    LED_Driver_Turn
        0x08001fc4:    4a05        .J      LDR      r2,[pc,#20] ; [0x8001fdc] = 0x40021400
        0x08001fc6:    b128        (.      CBZ      r0,0x8001fd4 ; LED_Driver_Turn + 16
        0x08001fc8:    2801        .(      CMP      r0,#1
        0x08001fca:    d106        ..      BNE      0x8001fda ; LED_Driver_Turn + 22
        0x08001fcc:    0281        ..      LSLS     r1,r0,#10
        0x08001fce:    4610        .F      MOV      r0,r2
        0x08001fd0:    f7ffb97e    ..~.    B        HAL_GPIO_TogglePin ; 0x80012d0
        0x08001fd4:    f44f7100    O..q    MOV      r1,#0x200
        0x08001fd8:    e7f9        ..      B        0x8001fce ; LED_Driver_Turn + 10
