tangbaishu/Personal/MDK-ARM/Out/STM32F407ZGT6_Embedded_V1.asm
        0x08001fda:    4770        pG      BX       lr
    $d
        0x08001fdc:    40021400    ...@    DCD    1073878016
    $t
    i.MemManage_Handler
    MemManage_Handler
        0x08001fe0:    e7fe        ..      B        MemManage_Handler ; 0x8001fe0
    i.NMI_Handler
    NMI_Handler
        0x08001fe2:    e7fe        ..      B        NMI_Handler ; 0x8001fe2
    i.PendSV_Handler
    PendSV_Handler
        0x08001fe4:    4770        pG      BX       lr
    i.SVC_Handler
    SVC_Handler
        0x08001fe6:    4770        pG      BX       lr
    i.SysTick_Handler
    SysTick_Handler
        0x08001fe8:    b510        ..      PUSH     {r4,lr}
        0x08001fea:    f7fff985    ....    BL       HAL_IncTick ; 0x80012f8
        0x08001fee:    e8bd4010    ...@    POP      {r4,lr}
        0x08001ff2:    f7febd39    ..9.    B        DMA_UART1_Buff_ckeck ; 0x8000a68
        0x08001ff6:    0000        ..      MOVS     r0,r0
    i.SystemClock_Config
    SystemClock_Config
        0x08001ff8:    b530        0.      PUSH     {r4,r5,lr}
        0x08001ffa:    b093        ..      SUB      sp,sp,#0x4c
        0x08001ffc:    2130        0!      MOVS     r1,#0x30
        0x08001ffe:    4668        hF      MOV      r0,sp
        0x08002000:    f7fef948    ..H.    BL       __aeabi_memclr ; 0x8000294
        0x08002004:    2114        .!      MOVS     r1,#0x14
        0x08002006:    a80c        ..      ADD      r0,sp,#0x30
        0x08002008:    f7fef944    ..D.    BL       __aeabi_memclr ; 0x8000294
        0x0800200c:    481d        .H      LDR      r0,[pc,#116] ; [0x8002084] = 0x40023840
        0x0800200e:    2500        .%      MOVS     r5,#0
        0x08002010:    6801        .h      LDR      r1,[r0,#0]
        0x08002012:    f0415180    A..Q    ORR      r1,r1,#0x10000000
        0x08002016:    6001        .`      STR      r1,[r0,#0]
        0x08002018:    6800        .h      LDR      r0,[r0,#0]
        0x0800201a:    f0005080    ...P    AND      r0,r0,#0x10000000
        0x0800201e:    9011        ..      STR      r0,[sp,#0x44]
        0x08002020:    4819        .H      LDR      r0,[pc,#100] ; [0x8002088] = 0x40007000
        0x08002022:    6801        .h      LDR      r1,[r0,#0]
        0x08002024:    f4414180    A..A    ORR      r1,r1,#0x4000
        0x08002028:    6001        .`      STR      r1,[r0,#0]
        0x0800202a:    6800        .h      LDR      r0,[r0,#0]
        0x0800202c:    2402        .$      MOVS     r4,#2
        0x0800202e:    f4004080    ...@    AND      r0,r0,#0x4000
        0x08002032:    9011        ..      STR      r0,[sp,#0x44]
        0x08002034:    2001        .       MOVS     r0,#1
        0x08002036:    9000        ..      STR      r0,[sp,#0]
        0x08002038:    0400        ..      LSLS     r0,r0,#16
        0x0800203a:    9001        ..      STR      r0,[sp,#4]
        0x0800203c:    0180        ..      LSLS     r0,r0,#6
        0x0800203e:    e9cd4006    ...@    STRD     r4,r0,[sp,#0x18]
        0x08002042:    aa08        ..      ADD      r2,sp,#0x20
        0x08002044:    2004        .       MOVS     r0,#4
        0x08002046:    21a8        .!      MOVS     r1,#0xa8
        0x08002048:    e8820013    ....    STM      r2,{r0,r1,r4}
        0x0800204c:    900b        ..      STR      r0,[sp,#0x2c]
        0x0800204e:    4668        hF      MOV      r0,sp
        0x08002050:    f7fffad6    ....    BL       HAL_RCC_OscConfig ; 0x8001600
        0x08002054:    b108        ..      CBZ      r0,0x800205a ; SystemClock_Config + 98
        0x08002056:    b672        r.      CPSID    i
        0x08002058:    e7fe        ..      B        0x8002058 ; SystemClock_Config + 96
        0x0800205a:    a90c        ..      ADD      r1,sp,#0x30
        0x0800205c:    200f        .       MOVS     r0,#0xf
        0x0800205e:    e8810031    ..1.    STM      r1,{r0,r4,r5}
        0x08002062:    f44f50a0    O..P    MOV      r0,#0x1400
        0x08002066:    900f        ..      STR      r0,[sp,#0x3c]
        0x08002068:    f44f5080    O..P    MOV      r0,#0x1000
        0x0800206c:    9010        ..      STR      r0,[sp,#0x40]
        0x0800206e:    2105        .!      MOVS     r1,#5
        0x08002070:    a80c        ..      ADD      r0,sp,#0x30
        0x08002072:    f7fff9db    ....    BL       HAL_RCC_ClockConfig ; 0x800142c
        0x08002076:    2800        .(      CMP      r0,#0
        0x08002078:    d001        ..      BEQ      0x800207e ; SystemClock_Config + 134
        0x0800207a:    b672        r.      CPSID    i
        0x0800207c:    e7fe        ..      B        0x800207c ; SystemClock_Config + 132
        0x0800207e:    b013        ..      ADD      sp,sp,#0x4c
        0x08002080:    bd30        0.      POP      {r4,r5,pc}
    $d
        0x08002082:    0000        ..      DCW    0
        0x08002084:    40023840    @8.@    DCD    1073887296
        0x08002088:    40007000    .p.@    DCD    1073770496
    $t
    i.SystemInit
    SystemInit
        0x0800208c:    4805        .H      LDR      r0,[pc,#20] ; [0x80020a4] = 0xe000ed88
        0x0800208e:    6801        .h      LDR      r1,[r0,#0]
        0x08002090:    f4410170    A.p.    ORR      r1,r1,#0xf00000
        0x08002094:    6001        .`      STR      r1,[r0,#0]
        0x08002096:    4903        .I      LDR      r1,[pc,#12] ; [0x80020a4] = 0xe000ed88
        0x08002098:    f04f6000    O..`    MOV      r0,#0x8000000
        0x0800209c:    3980        .9      SUBS     r1,r1,#0x80
        0x0800209e:    6008        .`      STR      r0,[r1,#0]
        0x080020a0:    4770        pG      BX       lr
    $d
        0x080020a2:    0000        ..      DCW    0
        0x080020a4:    e000ed88    ....    DCD    3758157192
    $t
    i.TIM7_IRQHandler
    TIM7_IRQHandler
        0x080020a8:    4806        .H      LDR      r0,[pc,#24] ; [0x80020c4] = 0x40001410
        0x080020aa:    6801        .h      LDR      r1,[r0,#0]
        0x080020ac:    07c9        ..      LSLS     r1,r1,#31
        0x080020ae:    d007        ..      BEQ      0x80020c0 ; TIM7_IRQHandler + 24
        0x080020b0:    4905        .I      LDR      r1,[pc,#20] ; [0x80020c8] = 0x20000010
        0x080020b2:    680a        .h      LDR      r2,[r1,#0]
        0x080020b4:    1c52        R.      ADDS     r2,r2,#1
        0x080020b6:    600a        .`      STR      r2,[r1,#0]
        0x080020b8:    6801        .h      LDR      r1,[r0,#0]
        0x080020ba:    f0210101    !...    BIC      r1,r1,#1
        0x080020be:    6001        .`      STR      r1,[r0,#0]
        0x080020c0:    4770        pG      BX       lr
    $d
        0x080020c2:    0000        ..      DCW    0
        0x080020c4:    40001410    ...@    DCD    1073746960
        0x080020c8:    20000010    ...     DCD    536870928
    $t
    i.UART1_Driver_Init
    UART1_Driver_Init
        0x080020cc:    480f        .H      LDR      r0,[pc,#60] ; [0x800210c] = 0x20000a5c
        0x080020ce:    b510        ..      PUSH     {r4,lr}
        0x080020d0:    490d        .I      LDR      r1,[pc,#52] ; [0x8002108] = 0x40011000
        0x080020d2:    6001        .`      STR      r1,[r0,#0]
        0x080020d4:    f44f2161    O.a!    MOV      r1,#0xe1000
        0x080020d8:    6041        A`      STR      r1,[r0,#4]
        0x080020da:    2100        .!      MOVS     r1,#0
        0x080020dc:    6081        .`      STR      r1,[r0,#8]
        0x080020de:    220c        ."      MOVS     r2,#0xc
        0x080020e0:    60c1        .`      STR      r1,[r0,#0xc]
        0x080020e2:    e9c01204    ....    STRD     r1,r2,[r0,#0x10]
        0x080020e6:    6181        .a      STR      r1,[r0,#0x18]
        0x080020e8:    61c1        .a      STR      r1,[r0,#0x1c]
        0x080020ea:    f7fffdc5    ....    BL       HAL_UART_Init ; 0x8001c78
        0x080020ee:    b108        ..      CBZ      r0,0x80020f4 ; UART1_Driver_Init + 40
        0x080020f0:    f7fefd8c    ....    BL       Error_Handler ; 0x8000c0c
        0x080020f4:    2200        ."      MOVS     r2,#0
        0x080020f6:    2107        .!      MOVS     r1,#7
        0x080020f8:    2025        %       MOVS     r0,#0x25
        0x080020fa:    f7fff965    ..e.    BL       HAL_NVIC_SetPriority ; 0x80013c8
        0x080020fe:    e8bd4010    ...@    POP      {r4,lr}
        0x08002102:    2025        %       MOVS     r0,#0x25
        0x08002104:    f7ffb952    ..R.    B        HAL_NVIC_EnableIRQ ; 0x80013ac
    $d
        0x08002108:    40011000    ...@    DCD    1073811456
        0x0800210c:    20000a5c    \..     DCD    536873564
    $t
    i.UART3_DMA_Driver_Init
    UART3_DMA_Driver_Init
        0x08002110:    e92d4ff8    -..O    PUSH     {r3-r11,lr}
        0x08002114:    482d        -H      LDR      r0,[pc,#180] ; [0x80021cc] = 0x40023830
        0x08002116:    2500        .%      MOVS     r5,#0
        0x08002118:    6801        .h      LDR      r1,[r0,#0]
        0x0800211a:    f4411100    A...    ORR      r1,r1,#0x200000
        0x0800211e:    6001        .`      STR      r1,[r0,#0]
        0x08002120:    6800        .h      LDR      r0,[r0,#0]
        0x08002122:    f4001000    ....    AND      r0,r0,#0x200000
        0x08002126:    9000        ..      STR      r0,[sp,#0]
        0x08002128:    f000f856    ..V.    BL       UART3_Driver_Init ; 0x80021d8
        0x0800212c:    4c29        )L      LDR      r4,[pc,#164] ; [0x80021d4] = 0x20000bac
        0x0800212e:    4828        (H      LDR      r0,[pc,#160] ; [0x80021d0] = 0x40026058
        0x08002130:    f04f0803    O...    MOV      r8,#3
        0x08002134:    6020         `      STR      r0,[r4,#0]
        0x08002136:    f04f6000    O..`    MOV      r0,#0x8000000
        0x0800213a:    6060        ``      STR      r0,[r4,#4]
        0x0800213c:    e9c4850a    ....    STRD     r8,r5,[r4,#0x28]
        0x08002140:    61a5        .a      STR      r5,[r4,#0x18]
        0x08002142:    61e5        .a      STR      r5,[r4,#0x1c]
        0x08002144:    f44f6980    O..i    MOV      r9,#0x400
        0x08002148:    6325        %c      STR      r5,[r4,#0x30]
        0x0800214a:    e9c49504    ....    STRD     r9,r5,[r4,#0x10]
        0x0800214e:    2040        @       MOVS     r0,#0x40
        0x08002150:    e9c40502    ....    STRD     r0,r5,[r4,#8]
        0x08002154:    2704        .'      MOVS     r7,#4
        0x08002156:    f44f3a00    O..:    MOV      r10,#0x20000
        0x0800215a:    e9c4a708    ....    STRD     r10,r7,[r4,#0x20]
        0x0800215e:    4620         F      MOV      r0,r4
        0x08002160:    f7fefe82    ....    BL       HAL_DMA_Init ; 0x8000e68
        0x08002164:    f1a40648    ..H.    SUB      r6,r4,#0x48
        0x08002168:    4819        .H      LDR      r0,[pc,#100] ; [0x80021d0] = 0x40026058
        0x0800216a:    63b4        .c      STR      r4,[r6,#0x38]
        0x0800216c:    63a6        .c      STR      r6,[r4,#0x38]
        0x0800216e:    3460        `4      ADDS     r4,r4,#0x60
        0x08002170:    3830        08      SUBS     r0,r0,#0x30
        0x08002172:    6020         `      STR      r0,[r4,#0]
        0x08002174:    05f8        ..      LSLS     r0,r7,#23
        0x08002176:    e9c40501    ....    STRD     r0,r5,[r4,#4]
        0x0800217a:    e9c4850a    ....    STRD     r8,r5,[r4,#0x28]
        0x0800217e:    61a5        .a      STR      r5,[r4,#0x18]
        0x08002180:    61e5        .a      STR      r5,[r4,#0x1c]
        0x08002182:    6325        %c      STR      r5,[r4,#0x30]
        0x08002184:    e9c49504    ....    STRD     r9,r5,[r4,#0x10]
        0x08002188:    60e5        .`      STR      r5,[r4,#0xc]
        0x0800218a:    e9c4a708    ....    STRD     r10,r7,[r4,#0x20]
        0x0800218e:    4620         F      MOV      r0,r4
        0x08002190:    f7fefe6a    ..j.    BL       HAL_DMA_Init ; 0x8000e68
        0x08002194:    63f4        .c      STR      r4,[r6,#0x3c]
        0x08002196:    2201        ."      MOVS     r2,#1
        0x08002198:    2109        .!      MOVS     r1,#9
        0x0800219a:    200e        .       MOVS     r0,#0xe
        0x0800219c:    63a6        .c      STR      r6,[r4,#0x38]
        0x0800219e:    f7fff913    ....    BL       HAL_NVIC_SetPriority ; 0x80013c8
        0x080021a2:    200e        .       MOVS     r0,#0xe
        0x080021a4:    f7fff902    ....    BL       HAL_NVIC_EnableIRQ ; 0x80013ac
        0x080021a8:    2202        ."      MOVS     r2,#2
        0x080021aa:    2109        .!      MOVS     r1,#9
        0x080021ac:    200c        .       MOVS     r0,#0xc
        0x080021ae:    f7fff90b    ....    BL       HAL_NVIC_SetPriority ; 0x80013c8
        0x080021b2:    200c        .       MOVS     r0,#0xc
        0x080021b4:    f7fff8fa    ....    BL       HAL_NVIC_EnableIRQ ; 0x80013ac
        0x080021b8:    2100        .!      MOVS     r1,#0
        0x080021ba:    4630        0F      MOV      r0,r6
        0x080021bc:    f7fffbeb    ....    BL       HAL_UART_DMAStop ; 0x8001996
        0x080021c0:    4630        0F      MOV      r0,r6
        0x080021c2:    e8bd4ff8    ...O    POP      {r3-r11,lr}
        0x080021c6:    2101        .!      MOVS     r1,#1
        0x080021c8:    f7ffbbe5    ....    B        HAL_UART_DMAStop ; 0x8001996
    $d
        0x080021cc:    40023830    08.@    DCD    1073887280
        0x080021d0:    40026058    X`.@    DCD    1073897560
        0x080021d4:    20000bac    ...     DCD    536873900
    $t
    i.UART3_Driver_Init
    UART3_Driver_Init
        0x080021d8:    4811        .H      LDR      r0,[pc,#68] ; [0x8002220] = 0x40023840
        0x080021da:    b508        ..      PUSH     {r3,lr}
        0x080021dc:    6802        .h      LDR      r2,[r0,#0]
        0x080021de:    2100        .!      MOVS     r1,#0
        0x080021e0:    f4422280    B.."    ORR      r2,r2,#0x40000
        0x080021e4:    6002        .`      STR      r2,[r0,#0]
        0x080021e6:    6800        .h      LDR      r0,[r0,#0]
        0x080021e8:    4a0e        .J      LDR      r2,[pc,#56] ; [0x8002224] = 0x40004800
        0x080021ea:    f4002080    ...     AND      r0,r0,#0x40000
        0x080021ee:    9000        ..      STR      r0,[sp,#0]
        0x080021f0:    480d        .H      LDR      r0,[pc,#52] ; [0x8002228] = 0x20000b64
        0x080021f2:    6002        .`      STR      r2,[r0,#0]
        0x080021f4:    f44f32e1    O..2    MOV      r2,#0x1c200
        0x080021f8:    6042        B`      STR      r2,[r0,#4]
        0x080021fa:    220c        ."      MOVS     r2,#0xc
        0x080021fc:    61c1        .a      STR      r1,[r0,#0x1c]
        0x080021fe:    e9c01204    ....    STRD     r1,r2,[r0,#0x10]
        0x08002202:    60c1        .`      STR      r1,[r0,#0xc]
        0x08002204:    6081        .`      STR      r1,[r0,#8]
        0x08002206:    6181        .a      STR      r1,[r0,#0x18]
        0x08002208:    f7fffd36    ..6.    BL       HAL_UART_Init ; 0x8001c78
        0x0800220c:    2200        ."      MOVS     r2,#0
        0x0800220e:    2109        .!      MOVS     r1,#9
        0x08002210:    2027        '       MOVS     r0,#0x27
        0x08002212:    f7fff8d9    ....    BL       HAL_NVIC_SetPriority ; 0x80013c8
        0x08002216:    e8bd4008    ...@    POP      {r3,lr}
        0x0800221a:    2027        '       MOVS     r0,#0x27
        0x0800221c:    f7ffb8c6    ....    B        HAL_NVIC_EnableIRQ ; 0x80013ac
    $d
        0x08002220:    40023840    @8.@    DCD    1073887296
        0x08002224:    40004800    .H.@    DCD    1073760256
        0x08002228:    20000b64    d..     DCD    536873828
    $t
    i.UART3_Receive_Data_Wait
    UART3_Receive_Data_Wait
        0x0800222c:    4613        .F      MOV      r3,r2
        0x0800222e:    460a        .F      MOV      r2,r1
        0x08002230:    b510        ..      PUSH     {r4,lr}
        0x08002232:    4601        .F      MOV      r1,r0
        0x08002234:    4803        .H      LDR      r0,[pc,#12] ; [0x8002244] = 0x20000a5c
        0x08002236:    f7fffda9    ....    BL       HAL_UART_Receive ; 0x8001d8c
        0x0800223a:    4903        .I      LDR      r1,[pc,#12] ; [0x8002248] = 0x20000c6c
        0x0800223c:    2001        .       MOVS     r0,#1
        0x0800223e:    f8810066    ..f.    STRB     r0,[r1,#0x66]
        0x08002242:    bd10        ..      POP      {r4,pc}
    $d
        0x08002244:    20000a5c    \..     DCD    536873564
        0x08002248:    20000c6c    l..     DCD    536874092
    $t
    i.UART3_Send_Hex_Data
    UART3_Send_Hex_Data
        0x0800224c:    460a        .F      MOV      r2,r1
        0x0800224e:    4601        .F      MOV      r1,r0
        0x08002250:    4801        .H      LDR      r0,[pc,#4] ; [0x8002258] = 0x20000b64
        0x08002252:    f7ffbe03    ....    B.W      HAL_UART_Transmit_DMA ; 0x8001e5c
    $d
        0x08002256:    0000        ..      DCW    0
        0x08002258:    20000b64    d..     DCD    536873828
    $t
    i.UART_DMAAbortOnError
    UART_DMAAbortOnError
        0x0800225c:    b510        ..      PUSH     {r4,lr}
        0x0800225e:    6b80        .k      LDR      r0,[r0,#0x38]
        0x08002260:    2100        .!      MOVS     r1,#0
        0x08002262:    85c1        ..      STRH     r1,[r0,#0x2e]
        0x08002264:    84c1        ..      STRH     r1,[r0,#0x26]
        0x08002266:    f7fffbce    ....    BL       HAL_UART_ErrorCallback ; 0x8001a06
        0x0800226a:    bd10        ..      POP      {r4,pc}
    i.UART_DMAError
    UART_DMAError
        0x0800226c:    b570        p.      PUSH     {r4-r6,lr}
        0x0800226e:    6b84        .k      LDR      r4,[r0,#0x38]
        0x08002270:    6820         h      LDR      r0,[r4,#0]
        0x08002272:    6940        @i      LDR      r0,[r0,#0x14]
        0x08002274:    f8941041    ..A.    LDRB     r1,[r4,#0x41]
        0x08002278:    f3c010c0    ....    UBFX     r0,r0,#7,#1
        0x0800227c:    2500        .%      MOVS     r5,#0
        0x0800227e:    2921        !)      CMP      r1,#0x21
        0x08002280:    d104        ..      BNE      0x800228c ; UART_DMAError + 32
        0x08002282:    b118        ..      CBZ      r0,0x800228c ; UART_DMAError + 32
        0x08002284:    84e5        ..      STRH     r5,[r4,#0x26]
        0x08002286:    4620         F      MOV      r0,r4
        0x08002288:    f000f8b4    ....    BL       UART_EndTxTransfer ; 0x80023f4
        0x0800228c:    6820         h      LDR      r0,[r4,#0]
        0x0800228e:    6940        @i      LDR      r0,[r0,#0x14]
        0x08002290:    f8941042    ..B.    LDRB     r1,[r4,#0x42]
        0x08002294:    f3c01080    ....    UBFX     r0,r0,#6,#1
        0x08002298:    2922        ")      CMP      r1,#0x22
        0x0800229a:    d104        ..      BNE      0x80022a6 ; UART_DMAError + 58
        0x0800229c:    b118        ..      CBZ      r0,0x80022a6 ; UART_DMAError + 58
        0x0800229e:    85e5        ..      STRH     r5,[r4,#0x2e]
        0x080022a0:    4620         F      MOV      r0,r4
        0x080022a2:    f000f880    ....    BL       UART_EndRxTransfer ; 0x80023a6
        0x080022a6:    6c60        `l      LDR      r0,[r4,#0x44]
        0x080022a8:    f0400010    @...    ORR      r0,r0,#0x10
        0x080022ac:    6460        `d      STR      r0,[r4,#0x44]
        0x080022ae:    4620         F      MOV      r0,r4
        0x080022b0:    f7fffba9    ....    BL       HAL_UART_ErrorCallback ; 0x8001a06
        0x080022b4:    bd70        p.      POP      {r4-r6,pc}
    i.UART_DMAReceiveCplt
    UART_DMAReceiveCplt
        0x080022b6:    b510        ..      PUSH     {r4,lr}
        0x080022b8:    4601        .F      MOV      r1,r0
        0x080022ba:    6b80        .k      LDR      r0,[r0,#0x38]
        0x080022bc:    6809        .h      LDR      r1,[r1,#0]
        0x080022be:    6809        .h      LDR      r1,[r1,#0]
        0x080022c0:    f04f0200    O...    MOV      r2,#0
        0x080022c4:    05c9        ..      LSLS     r1,r1,#23
        0x080022c6:    d42e        ..      BMI      0x8002326 ; UART_DMAReceiveCplt + 112
        0x080022c8:    85c2        ..      STRH     r2,[r0,#0x2e]
        0x080022ca:    6801        .h      LDR      r1,[r0,#0]
        0x080022cc:    310c        .1      ADDS     r1,r1,#0xc
        0x080022ce:    e8513f00    Q..?    LDREX    r3,[r1]
        0x080022d2:    f4237380    #..s    BIC      r3,r3,#0x100
        0x080022d6:    e8413400    A..4    STREX    r4,r3,[r1]
        0x080022da:    2c00        .,      CMP      r4,#0
        0x080022dc:    d1f5        ..      BNE      0x80022ca ; UART_DMAReceiveCplt + 20
        0x080022de:    6801        .h      LDR      r1,[r0,#0]
        0x080022e0:    3114        .1      ADDS     r1,r1,#0x14
        0x080022e2:    e8513f00    Q..?    LDREX    r3,[r1]
        0x080022e6:    f0230301    #...    BIC      r3,r3,#1
        0x080022ea:    e8413400    A..4    STREX    r4,r3,[r1]
        0x080022ee:    2c00        .,      CMP      r4,#0
        0x080022f0:    d1f5        ..      BNE      0x80022de ; UART_DMAReceiveCplt + 40
        0x080022f2:    6801        .h      LDR      r1,[r0,#0]
        0x080022f4:    3114        .1      ADDS     r1,r1,#0x14
        0x080022f6:    e8513f00    Q..?    LDREX    r3,[r1]
        0x080022fa:    f0230340    #.@.    BIC      r3,r3,#0x40
        0x080022fe:    e8413400    A..4    STREX    r4,r3,[r1]
        0x08002302:    2c00        .,      CMP      r4,#0
        0x08002304:    d1f5        ..      BNE      0x80022f2 ; UART_DMAReceiveCplt + 60
        0x08002306:    2120         !      MOVS     r1,#0x20
        0x08002308:    f8801042    ..B.    STRB     r1,[r0,#0x42]
        0x0800230c:    6b01        .k      LDR      r1,[r0,#0x30]
        0x0800230e:    2901        .)      CMP      r1,#1
        0x08002310:    d109        ..      BNE      0x8002326 ; UART_DMAReceiveCplt + 112
        0x08002312:    6801        .h      LDR      r1,[r0,#0]
        0x08002314:    310c        .1      ADDS     r1,r1,#0xc
        0x08002316:    e8513f00    Q..?    LDREX    r3,[r1]
        0x0800231a:    f0230310    #...    BIC      r3,r3,#0x10
        0x0800231e:    e8413400    A..4    STREX    r4,r3,[r1]
        0x08002322:    2c00        .,      CMP      r4,#0
        0x08002324:    d1f5        ..      BNE      0x8002312 ; UART_DMAReceiveCplt + 92
        0x08002326:    6342        Bc      STR      r2,[r0,#0x34]
        0x08002328:    6b01        .k      LDR      r1,[r0,#0x30]
        0x0800232a:    2901        .)      CMP      r1,#1
        0x0800232c:    d002        ..      BEQ      0x8002334 ; UART_DMAReceiveCplt + 126
        0x0800232e:    f7fffd93    ....    BL       HAL_UART_RxCpltCallback ; 0x8001e58
        0x08002332:    bd10        ..      POP      {r4,pc}
        0x08002334:    8d81        ..      LDRH     r1,[r0,#0x2c]
        0x08002336:    f7fffb2d    ..-.    BL       HAL_UARTEx_RxEventCallback ; 0x8001994
        0x0800233a:    bd10        ..      POP      {r4,pc}
    i.UART_DMARxHalfCplt
    UART_DMARxHalfCplt
        0x0800233c:    b510        ..      PUSH     {r4,lr}
        0x0800233e:    6b80        .k      LDR      r0,[r0,#0x38]
        0x08002340:    2101        .!      MOVS     r1,#1
        0x08002342:    6341        Ac      STR      r1,[r0,#0x34]
        0x08002344:    6b01        .k      LDR      r1,[r0,#0x30]
        0x08002346:    2901        .)      CMP      r1,#1
        0x08002348:    d002        ..      BEQ      0x8002350 ; UART_DMARxHalfCplt + 20
        0x0800234a:    f7fffd86    ....    BL       HAL_UART_RxHalfCpltCallback ; 0x8001e5a
        0x0800234e:    bd10        ..      POP      {r4,pc}
        0x08002350:    8d81        ..      LDRH     r1,[r0,#0x2c]
        0x08002352:    0849        I.      LSRS     r1,r1,#1
        0x08002354:    f7fffb1e    ....    BL       HAL_UARTEx_RxEventCallback ; 0x8001994
        0x08002358:    bd10        ..      POP      {r4,pc}
    i.UART_DMATransmitCplt
    UART_DMATransmitCplt
        0x0800235a:    b510        ..      PUSH     {r4,lr}
        0x0800235c:    4601        .F      MOV      r1,r0
