tangbaishu/Personal/MDK-ARM/Out/STM32F407ZGT6_Embedded_V1.asm
        0x0800235e:    6b80        .k      LDR      r0,[r0,#0x38]
        0x08002360:    6809        .h      LDR      r1,[r1,#0]
        0x08002362:    6809        .h      LDR      r1,[r1,#0]
        0x08002364:    05c9        ..      LSLS     r1,r1,#23
        0x08002366:    d416        ..      BMI      0x8002396 ; UART_DMATransmitCplt + 60
        0x08002368:    2100        .!      MOVS     r1,#0
        0x0800236a:    84c1        ..      STRH     r1,[r0,#0x26]
        0x0800236c:    6801        .h      LDR      r1,[r0,#0]
        0x0800236e:    3114        .1      ADDS     r1,r1,#0x14
        0x08002370:    e8512f00    Q../    LDREX    r2,[r1]
        0x08002374:    f0220280    "...    BIC      r2,r2,#0x80
        0x08002378:    e8412300    A..#    STREX    r3,r2,[r1]
        0x0800237c:    2b00        .+      CMP      r3,#0
        0x0800237e:    d1f5        ..      BNE      0x800236c ; UART_DMATransmitCplt + 18
        0x08002380:    6801        .h      LDR      r1,[r0,#0]
        0x08002382:    310c        .1      ADDS     r1,r1,#0xc
        0x08002384:    e8512f00    Q../    LDREX    r2,[r1]
        0x08002388:    f0420240    B.@.    ORR      r2,r2,#0x40
        0x0800238c:    e8412300    A..#    STREX    r3,r2,[r1]
        0x08002390:    2b00        .+      CMP      r3,#0
        0x08002392:    d1f5        ..      BNE      0x8002380 ; UART_DMATransmitCplt + 38
        0x08002394:    bd10        ..      POP      {r4,pc}
        0x08002396:    f7fffd9d    ....    BL       HAL_UART_TxCpltCallback ; 0x8001ed4
        0x0800239a:    bd10        ..      POP      {r4,pc}
    i.UART_DMATxHalfCplt
    UART_DMATxHalfCplt
        0x0800239c:    b510        ..      PUSH     {r4,lr}
        0x0800239e:    6b80        .k      LDR      r0,[r0,#0x38]
        0x080023a0:    f7fffd99    ....    BL       HAL_UART_TxHalfCpltCallback ; 0x8001ed6
        0x080023a4:    bd10        ..      POP      {r4,pc}
    i.UART_EndRxTransfer
    UART_EndRxTransfer
        0x080023a6:    6801        .h      LDR      r1,[r0,#0]
        0x080023a8:    310c        .1      ADDS     r1,r1,#0xc
        0x080023aa:    e8512f00    Q../    LDREX    r2,[r1]
        0x080023ae:    f4227290    "..r    BIC      r2,r2,#0x120
        0x080023b2:    e8412300    A..#    STREX    r3,r2,[r1]
        0x080023b6:    2b00        .+      CMP      r3,#0
        0x080023b8:    d1f5        ..      BNE      UART_EndRxTransfer ; 0x80023a6
        0x080023ba:    6801        .h      LDR      r1,[r0,#0]
        0x080023bc:    3114        .1      ADDS     r1,r1,#0x14
        0x080023be:    e8512f00    Q../    LDREX    r2,[r1]
        0x080023c2:    f0220201    "...    BIC      r2,r2,#1
        0x080023c6:    e8412300    A..#    STREX    r3,r2,[r1]
        0x080023ca:    2b00        .+      CMP      r3,#0
        0x080023cc:    d1f5        ..      BNE      0x80023ba ; UART_EndRxTransfer + 20
        0x080023ce:    6b01        .k      LDR      r1,[r0,#0x30]
        0x080023d0:    2901        .)      CMP      r1,#1
        0x080023d2:    d109        ..      BNE      0x80023e8 ; UART_EndRxTransfer + 66
        0x080023d4:    6801        .h      LDR      r1,[r0,#0]
        0x080023d6:    310c        .1      ADDS     r1,r1,#0xc
        0x080023d8:    e8512f00    Q../    LDREX    r2,[r1]
        0x080023dc:    f0220210    "...    BIC      r2,r2,#0x10
        0x080023e0:    e8412300    A..#    STREX    r3,r2,[r1]
        0x080023e4:    2b00        .+      CMP      r3,#0
        0x080023e6:    d1f5        ..      BNE      0x80023d4 ; UART_EndRxTransfer + 46
        0x080023e8:    2120         !      MOVS     r1,#0x20
        0x080023ea:    f8801042    ..B.    STRB     r1,[r0,#0x42]
        0x080023ee:    2100        .!      MOVS     r1,#0
        0x080023f0:    6301        .c      STR      r1,[r0,#0x30]
        0x080023f2:    4770        pG      BX       lr
    i.UART_EndTxTransfer
    UART_EndTxTransfer
        0x080023f4:    6801        .h      LDR      r1,[r0,#0]
        0x080023f6:    310c        .1      ADDS     r1,r1,#0xc
        0x080023f8:    e8512f00    Q../    LDREX    r2,[r1]
        0x080023fc:    f02202c0    "...    BIC      r2,r2,#0xc0
        0x08002400:    e8412300    A..#    STREX    r3,r2,[r1]
        0x08002404:    2b00        .+      CMP      r3,#0
        0x08002406:    d1f5        ..      BNE      UART_EndTxTransfer ; 0x80023f4
        0x08002408:    2120         !      MOVS     r1,#0x20
        0x0800240a:    f8801041    ..A.    STRB     r1,[r0,#0x41]
        0x0800240e:    4770        pG      BX       lr
    i.UART_Receive_IT
    UART_Receive_IT
        0x08002410:    b508        ..      PUSH     {r3,lr}
        0x08002412:    f8901042    ..B.    LDRB     r1,[r0,#0x42]
        0x08002416:    2922        ")      CMP      r1,#0x22
        0x08002418:    d001        ..      BEQ      0x800241e ; UART_Receive_IT + 14
        0x0800241a:    2002        .       MOVS     r0,#2
        0x0800241c:    bd08        ..      POP      {r3,pc}
        0x0800241e:    6882        .h      LDR      r2,[r0,#8]
        0x08002420:    f44f5380    O..S    MOV      r3,#0x1000
        0x08002424:    429a        .B      CMP      r2,r3
        0x08002426:    d101        ..      BNE      0x800242c ; UART_Receive_IT + 28
        0x08002428:    6901        .i      LDR      r1,[r0,#0x10]
        0x0800242a:    b121        !.      CBZ      r1,0x8002436 ; UART_Receive_IT + 38
        0x0800242c:    6a81        .j      LDR      r1,[r0,#0x28]
        0x0800242e:    429a        .B      CMP      r2,r3
        0x08002430:    d01b        ..      BEQ      0x800246a ; UART_Receive_IT + 90
        0x08002432:    b14a        J.      CBZ      r2,0x8002448 ; UART_Receive_IT + 56
        0x08002434:    e00a        ..      B        0x800244c ; UART_Receive_IT + 60
        0x08002436:    6802        .h      LDR      r2,[r0,#0]
        0x08002438:    6a81        .j      LDR      r1,[r0,#0x28]
        0x0800243a:    6852        Rh      LDR      r2,[r2,#4]
        0x0800243c:    f3c20208    ....    UBFX     r2,r2,#0,#9
        0x08002440:    800a        ..      STRH     r2,[r1,#0]
        0x08002442:    6a81        .j      LDR      r1,[r0,#0x28]
        0x08002444:    1c89        ..      ADDS     r1,r1,#2
        0x08002446:    e008        ..      B        0x800245a ; UART_Receive_IT + 74
        0x08002448:    6902        .i      LDR      r2,[r0,#0x10]
        0x0800244a:    b172        r.      CBZ      r2,0x800246a ; UART_Receive_IT + 90
        0x0800244c:    6802        .h      LDR      r2,[r0,#0]
        0x0800244e:    6852        Rh      LDR      r2,[r2,#4]
        0x08002450:    f002027f    ....    AND      r2,r2,#0x7f
        0x08002454:    700a        .p      STRB     r2,[r1,#0]
        0x08002456:    6a81        .j      LDR      r1,[r0,#0x28]
        0x08002458:    1c49        I.      ADDS     r1,r1,#1
        0x0800245a:    6281        .b      STR      r1,[r0,#0x28]
        0x0800245c:    8dc1        ..      LDRH     r1,[r0,#0x2e]
        0x0800245e:    1e49        I.      SUBS     r1,r1,#1
        0x08002460:    0409        ..      LSLS     r1,r1,#16
        0x08002462:    0c09        ..      LSRS     r1,r1,#16
        0x08002464:    85c1        ..      STRH     r1,[r0,#0x2e]
        0x08002466:    d003        ..      BEQ      0x8002470 ; UART_Receive_IT + 96
        0x08002468:    e01b        ..      B        0x80024a2 ; UART_Receive_IT + 146
        0x0800246a:    6802        .h      LDR      r2,[r0,#0]
        0x0800246c:    6852        Rh      LDR      r2,[r2,#4]
        0x0800246e:    e7f1        ..      B        0x8002454 ; UART_Receive_IT + 68
        0x08002470:    6801        .h      LDR      r1,[r0,#0]
        0x08002472:    68ca        .h      LDR      r2,[r1,#0xc]
        0x08002474:    f0220220    ". .    BIC      r2,r2,#0x20
        0x08002478:    60ca        .`      STR      r2,[r1,#0xc]
        0x0800247a:    6801        .h      LDR      r1,[r0,#0]
        0x0800247c:    68ca        .h      LDR      r2,[r1,#0xc]
        0x0800247e:    f4227280    "..r    BIC      r2,r2,#0x100
        0x08002482:    60ca        .`      STR      r2,[r1,#0xc]
        0x08002484:    6801        .h      LDR      r1,[r0,#0]
        0x08002486:    694a        Ji      LDR      r2,[r1,#0x14]
        0x08002488:    f0220201    "...    BIC      r2,r2,#1
        0x0800248c:    614a        Ja      STR      r2,[r1,#0x14]
        0x0800248e:    2120         !      MOVS     r1,#0x20
        0x08002490:    f8801042    ..B.    STRB     r1,[r0,#0x42]
        0x08002494:    2100        .!      MOVS     r1,#0
        0x08002496:    6341        Ac      STR      r1,[r0,#0x34]
        0x08002498:    6b02        .k      LDR      r2,[r0,#0x30]
        0x0800249a:    2a01        .*      CMP      r2,#1
        0x0800249c:    d003        ..      BEQ      0x80024a6 ; UART_Receive_IT + 150
        0x0800249e:    f7fffcdb    ....    BL       HAL_UART_RxCpltCallback ; 0x8001e58
        0x080024a2:    2000        .       MOVS     r0,#0
        0x080024a4:    bd08        ..      POP      {r3,pc}
        0x080024a6:    6301        .c      STR      r1,[r0,#0x30]
        0x080024a8:    6801        .h      LDR      r1,[r0,#0]
        0x080024aa:    310c        .1      ADDS     r1,r1,#0xc
        0x080024ac:    e8512f00    Q../    LDREX    r2,[r1]
        0x080024b0:    f0220210    "...    BIC      r2,r2,#0x10
        0x080024b4:    e8412300    A..#    STREX    r3,r2,[r1]
        0x080024b8:    2b00        .+      CMP      r3,#0
        0x080024ba:    d1f5        ..      BNE      0x80024a8 ; UART_Receive_IT + 152
        0x080024bc:    6801        .h      LDR      r1,[r0,#0]
        0x080024be:    680a        .h      LDR      r2,[r1,#0]
        0x080024c0:    06d2        ..      LSLS     r2,r2,#27
        0x080024c2:    d502        ..      BPL      0x80024ca ; UART_Receive_IT + 186
        0x080024c4:    680a        .h      LDR      r2,[r1,#0]
        0x080024c6:    6849        Ih      LDR      r1,[r1,#4]
        0x080024c8:    9100        ..      STR      r1,[sp,#0]
        0x080024ca:    8d81        ..      LDRH     r1,[r0,#0x2c]
        0x080024cc:    f7fffa62    ..b.    BL       HAL_UARTEx_RxEventCallback ; 0x8001994
        0x080024d0:    e7e7        ..      B        0x80024a2 ; UART_Receive_IT + 146
        0x080024d2:    0000        ..      MOVS     r0,r0
    i.UART_SetConfig
    UART_SetConfig
        0x080024d4:    b570        p.      PUSH     {r4-r6,lr}
        0x080024d6:    4604        .F      MOV      r4,r0
        0x080024d8:    6800        .h      LDR      r0,[r0,#0]
        0x080024da:    6901        .i      LDR      r1,[r0,#0x10]
        0x080024dc:    68e2        .h      LDR      r2,[r4,#0xc]
        0x080024de:    f4215140    !.@Q    BIC      r1,r1,#0x3000
        0x080024e2:    4311        .C      ORRS     r1,r1,r2
        0x080024e4:    6101        .a      STR      r1,[r0,#0x10]
        0x080024e6:    6921        !i      LDR      r1,[r4,#0x10]
        0x080024e8:    68a0        .h      LDR      r0,[r4,#8]
        0x080024ea:    69e2        .i      LDR      r2,[r4,#0x1c]
        0x080024ec:    4308        .C      ORRS     r0,r0,r1
        0x080024ee:    6961        ai      LDR      r1,[r4,#0x14]
        0x080024f0:    4311        .C      ORRS     r1,r1,r2
        0x080024f2:    4308        .C      ORRS     r0,r0,r1
        0x080024f4:    6821        !h      LDR      r1,[r4,#0]
        0x080024f6:    68ca        .h      LDR      r2,[r1,#0xc]
        0x080024f8:    f249630c    I..c    MOV      r3,#0x960c
        0x080024fc:    439a        .C      BICS     r2,r2,r3
        0x080024fe:    4302        .C      ORRS     r2,r2,r0
        0x08002500:    60ca        .`      STR      r2,[r1,#0xc]
        0x08002502:    6820         h      LDR      r0,[r4,#0]
        0x08002504:    6941        Ai      LDR      r1,[r0,#0x14]
        0x08002506:    69a2        .i      LDR      r2,[r4,#0x18]
        0x08002508:    f4217140    !.@q    BIC      r1,r1,#0x300
        0x0800250c:    4311        .C      ORRS     r1,r1,r2
        0x0800250e:    6141        Aa      STR      r1,[r0,#0x14]
        0x08002510:    4931        1I      LDR      r1,[pc,#196] ; [0x80025d8] = 0x40011000
        0x08002512:    6820         h      LDR      r0,[r4,#0]
        0x08002514:    4288        .B      CMP      r0,r1
        0x08002516:    d002        ..      BEQ      0x800251e ; UART_SetConfig + 74
        0x08002518:    4930        0I      LDR      r1,[pc,#192] ; [0x80025dc] = 0x40011400
        0x0800251a:    4288        .B      CMP      r0,r1
        0x0800251c:    d102        ..      BNE      0x8002524 ; UART_SetConfig + 80
        0x0800251e:    f7fff82f    ../.    BL       HAL_RCC_GetPCLK2Freq ; 0x8001580
        0x08002522:    e001        ..      B        0x8002528 ; UART_SetConfig + 84
        0x08002524:    f7fff81c    ....    BL       HAL_RCC_GetPCLK1Freq ; 0x8001560
        0x08002528:    69e2        .i      LDR      r2,[r4,#0x1c]
        0x0800252a:    2300        .#      MOVS     r3,#0
        0x0800252c:    2119        .!      MOVS     r1,#0x19
        0x0800252e:    2564        d%      MOVS     r5,#0x64
        0x08002530:    2632        2&      MOVS     r6,#0x32
        0x08002532:    f5b24f00    ...O    CMP      r2,#0x8000
        0x08002536:    6862        bh      LDR      r2,[r4,#4]
        0x08002538:    d028        (.      BEQ      0x800258c ; UART_SetConfig + 184
        0x0800253a:    fba00101    ....    UMULL    r0,r1,r0,r1
        0x0800253e:    0f93        ..      LSRS     r3,r2,#30
        0x08002540:    0092        ..      LSLS     r2,r2,#2
        0x08002542:    f7fdfe3f    ..?.    BL       __aeabi_uldivmod ; 0x80001c4
        0x08002546:    4601        .F      MOV      r1,r0
        0x08002548:    fbb0f0f5    ....    UDIV     r0,r0,r5
        0x0800254c:    f06f0218    o...    MVN      r2,#0x18
        0x08002550:    4350        PC      MULS     r0,r2,r0
        0x08002552:    eb010080    ....    ADD      r0,r1,r0,LSL #2
        0x08002556:    eb061000    ....    ADD      r0,r6,r0,LSL #4
        0x0800255a:    fbb0f0f5    ....    UDIV     r0,r0,r5
        0x0800255e:    f00002f0    ....    AND      r2,r0,#0xf0
        0x08002562:    fbb1f0f5    ....    UDIV     r0,r1,r5
        0x08002566:    eb021200    ....    ADD      r2,r2,r0,LSL #4
        0x0800256a:    fbb1f0f5    ....    UDIV     r0,r1,r5
        0x0800256e:    f06f0318    o...    MVN      r3,#0x18
        0x08002572:    4358        XC      MULS     r0,r3,r0
        0x08002574:    eb010080    ....    ADD      r0,r1,r0,LSL #2
        0x08002578:    eb061000    ....    ADD      r0,r6,r0,LSL #4
        0x0800257c:    fbb0f0f5    ....    UDIV     r0,r0,r5
        0x08002580:    f000000f    ....    AND      r0,r0,#0xf
        0x08002584:    6821        !h      LDR      r1,[r4,#0]
        0x08002586:    4410        .D      ADD      r0,r0,r2
        0x08002588:    6088        .`      STR      r0,[r1,#8]
        0x0800258a:    bd70        p.      POP      {r4-r6,pc}
        0x0800258c:    fba00101    ....    UMULL    r0,r1,r0,r1
        0x08002590:    1892        ..      ADDS     r2,r2,r2
        0x08002592:    415b        [A      ADCS     r3,r3,r3
        0x08002594:    f7fdfe16    ....    BL       __aeabi_uldivmod ; 0x80001c4
        0x08002598:    4601        .F      MOV      r1,r0
        0x0800259a:    fbb0f0f5    ....    UDIV     r0,r0,r5
        0x0800259e:    0102        ..      LSLS     r2,r0,#4
        0x080025a0:    fbb1f0f5    ....    UDIV     r0,r1,r5
        0x080025a4:    f06f0318    o...    MVN      r3,#0x18
        0x080025a8:    4358        XC      MULS     r0,r3,r0
        0x080025aa:    eb010080    ....    ADD      r0,r1,r0,LSL #2
        0x080025ae:    eb0600c0    ....    ADD      r0,r6,r0,LSL #3
        0x080025b2:    fbb0f0f5    ....    UDIV     r0,r0,r5
        0x080025b6:    f00000f8    ....    AND      r0,r0,#0xf8
        0x080025ba:    eb020240    ..@.    ADD      r2,r2,r0,LSL #1
        0x080025be:    fbb1f0f5    ....    UDIV     r0,r1,r5
        0x080025c2:    4358        XC      MULS     r0,r3,r0
        0x080025c4:    eb010080    ....    ADD      r0,r1,r0,LSL #2
        0x080025c8:    eb0600c0    ....    ADD      r0,r6,r0,LSL #3
        0x080025cc:    fbb0f0f5    ....    UDIV     r0,r0,r5
        0x080025d0:    f0000007    ....    AND      r0,r0,#7
        0x080025d4:    e7d6        ..      B        0x8002584 ; UART_SetConfig + 176
    $d
        0x080025d6:    0000        ..      DCW    0
        0x080025d8:    40011000    ...@    DCD    1073811456
        0x080025dc:    40011400    ...@    DCD    1073812480
    $t
    i.UART_Start_Receive_DMA
    UART_Start_Receive_DMA
        0x080025e0:    b538        8.      PUSH     {r3-r5,lr}
        0x080025e2:    6281        .b      STR      r1,[r0,#0x28]
        0x080025e4:    4604        .F      MOV      r4,r0
        0x080025e6:    8582        ..      STRH     r2,[r0,#0x2c]
        0x080025e8:    2000        .       MOVS     r0,#0
        0x080025ea:    4613        .F      MOV      r3,r2
        0x080025ec:    6460        `d      STR      r0,[r4,#0x44]
        0x080025ee:    2222        ""      MOVS     r2,#0x22
        0x080025f0:    f8842042    ..B     STRB     r2,[r4,#0x42]
        0x080025f4:    6be5        .k      LDR      r5,[r4,#0x3c]
        0x080025f6:    4a1b        .J      LDR      r2,[pc,#108] ; [0x8002664] = 0x80022b7
        0x080025f8:    63ea        .c      STR      r2,[r5,#0x3c]
        0x080025fa:    6be5        .k      LDR      r5,[r4,#0x3c]
        0x080025fc:    4a1a        .J      LDR      r2,[pc,#104] ; [0x8002668] = 0x800233d
        0x080025fe:    642a        *d      STR      r2,[r5,#0x40]
        0x08002600:    6be5        .k      LDR      r5,[r4,#0x3c]
        0x08002602:    4a1a        .J      LDR      r2,[pc,#104] ; [0x800266c] = 0x800226d
        0x08002604:    64ea        .d      STR      r2,[r5,#0x4c]
        0x08002606:    6be2        .k      LDR      r2,[r4,#0x3c]
        0x08002608:    6510        .e      STR      r0,[r2,#0x50]
        0x0800260a:    460a        .F      MOV      r2,r1
        0x0800260c:    6821        !h      LDR      r1,[r4,#0]
        0x0800260e:    6be0        .k      LDR      r0,[r4,#0x3c]
        0x08002610:    1d09        ..      ADDS     r1,r1,#4
        0x08002612:    f7fefc93    ....    BL       HAL_DMA_Start_IT ; 0x8000f3c
        0x08002616:    6820         h      LDR      r0,[r4,#0]
        0x08002618:    6801        .h      LDR      r1,[r0,#0]
        0x0800261a:    6840        @h      LDR      r0,[r0,#4]
        0x0800261c:    9000        ..      STR      r0,[sp,#0]
        0x0800261e:    6920         i      LDR      r0,[r4,#0x10]
        0x08002620:    b148        H.      CBZ      r0,0x8002636 ; UART_Start_Receive_DMA + 86
        0x08002622:    6820         h      LDR      r0,[r4,#0]
        0x08002624:    300c        .0      ADDS     r0,r0,#0xc
        0x08002626:    e8501f00    P...    LDREX    r1,[r0]
        0x0800262a:    f4417180    A..q    ORR      r1,r1,#0x100
        0x0800262e:    e8401200    @...    STREX    r2,r1,[r0]
        0x08002632:    2a00        .*      CMP      r2,#0
        0x08002634:    d1f5        ..      BNE      0x8002622 ; UART_Start_Receive_DMA + 66
        0x08002636:    6820         h      LDR      r0,[r4,#0]
        0x08002638:    3014        .0      ADDS     r0,r0,#0x14
        0x0800263a:    e8501f00    P...    LDREX    r1,[r0]
        0x0800263e:    f0410101    A...    ORR      r1,r1,#1
        0x08002642:    e8401200    @...    STREX    r2,r1,[r0]
        0x08002646:    2a00        .*      CMP      r2,#0
        0x08002648:    d1f5        ..      BNE      0x8002636 ; UART_Start_Receive_DMA + 86
        0x0800264a:    6820         h      LDR      r0,[r4,#0]
        0x0800264c:    3014        .0      ADDS     r0,r0,#0x14
        0x0800264e:    e8501f00    P...    LDREX    r1,[r0]
        0x08002652:    f0410140    A.@.    ORR      r1,r1,#0x40
        0x08002656:    e8401200    @...    STREX    r2,r1,[r0]
        0x0800265a:    2a00        .*      CMP      r2,#0
        0x0800265c:    d1f5        ..      BNE      0x800264a ; UART_Start_Receive_DMA + 106
        0x0800265e:    2000        .       MOVS     r0,#0
        0x08002660:    bd38        8.      POP      {r3-r5,pc}
    $d
        0x08002662:    0000        ..      DCW    0
        0x08002664:    080022b7    ."..    DCD    134226615
        0x08002668:    0800233d    =#..    DCD    134226749
        0x0800266c:    0800226d    m"..    DCD    134226541
    $t
    i.UART_WaitOnFlagUntilTimeout
    UART_WaitOnFlagUntilTimeout
        0x08002670:    e92d43f8    -..C    PUSH     {r3-r9,lr}
        0x08002674:    4698        .F      MOV      r8,r3
        0x08002676:    4617        .F      MOV      r7,r2
        0x08002678:    460d        .F      MOV      r5,r1
        0x0800267a:    4604        .F      MOV      r4,r0
        0x0800267c:    9e08        ..      LDR      r6,[sp,#0x20]
        0x0800267e:    e024        $.      B        0x80026ca ; UART_WaitOnFlagUntilTimeout + 90
        0x08002680:    1c70        p.      ADDS     r0,r6,#1
        0x08002682:    d022        ".      BEQ      0x80026ca ; UART_WaitOnFlagUntilTimeout + 90
        0x08002684:    f7fefe32    ..2.    BL       HAL_GetTick ; 0x80012ec
        0x08002688:    eba00008    ....    SUB      r0,r0,r8
        0x0800268c:    42b0        .B      CMP      r0,r6
        0x0800268e:    d81a        ..      BHI      0x80026c6 ; UART_WaitOnFlagUntilTimeout + 86
        0x08002690:    b1ce        ..      CBZ      r6,0x80026c6 ; UART_WaitOnFlagUntilTimeout + 86
        0x08002692:    6820         h      LDR      r0,[r4,#0]
        0x08002694:    68c1        .h      LDR      r1,[r0,#0xc]
        0x08002696:    0749        I.      LSLS     r1,r1,#29
        0x08002698:    d517        ..      BPL      0x80026ca ; UART_WaitOnFlagUntilTimeout + 90
        0x0800269a:    2d80        .-      CMP      r5,#0x80
        0x0800269c:    d015        ..      BEQ      0x80026ca ; UART_WaitOnFlagUntilTimeout + 90
        0x0800269e:    2d40        @-      CMP      r5,#0x40
        0x080026a0:    d013        ..      BEQ      0x80026ca ; UART_WaitOnFlagUntilTimeout + 90
        0x080026a2:    6801        .h      LDR      r1,[r0,#0]
        0x080026a4:    43c9        .C      MVNS     r1,r1
        0x080026a6:    0709        ..      LSLS     r1,r1,#28
        0x080026a8:    d40f        ..      BMI      0x80026ca ; UART_WaitOnFlagUntilTimeout + 90
        0x080026aa:    6801        .h      LDR      r1,[r0,#0]
        0x080026ac:    2500        .%      MOVS     r5,#0
        0x080026ae:    6840        @h      LDR      r0,[r0,#4]
        0x080026b0:    9000        ..      STR      r0,[sp,#0]
        0x080026b2:    4620         F      MOV      r0,r4
        0x080026b4:    f7fffe77    ..w.    BL       UART_EndRxTransfer ; 0x80023a6
        0x080026b8:    2008        .       MOVS     r0,#8
        0x080026ba:    6460        `d      STR      r0,[r4,#0x44]
        0x080026bc:    f8845040    ..@P    STRB     r5,[r4,#0x40]
        0x080026c0:    2001        .       MOVS     r0,#1
        0x080026c2:    e8bd83f8    ....    POP      {r3-r9,pc}
        0x080026c6:    2003        .       MOVS     r0,#3
        0x080026c8:    e7fb        ..      B        0x80026c2 ; UART_WaitOnFlagUntilTimeout + 82
        0x080026ca:    6820         h      LDR      r0,[r4,#0]
        0x080026cc:    6800        .h      LDR      r0,[r0,#0]
        0x080026ce:    ea350000    5...    BICS     r0,r5,r0
        0x080026d2:    d004        ..      BEQ      0x80026de ; UART_WaitOnFlagUntilTimeout + 110
        0x080026d4:    2000        .       MOVS     r0,#0
        0x080026d6:    42b8        .B      CMP      r0,r7
        0x080026d8:    d0d2        ..      BEQ      0x8002680 ; UART_WaitOnFlagUntilTimeout + 16
        0x080026da:    2000        .       MOVS     r0,#0
        0x080026dc:    e7f1        ..      B        0x80026c2 ; UART_WaitOnFlagUntilTimeout + 82
