tangbaishu/Personal/MDK-ARM/Out/STM32F407ZGT6_Embedded_V1.asm
        0x080026de:    2001        .       MOVS     r0,#1
        0x080026e0:    e7f9        ..      B        0x80026d6 ; UART_WaitOnFlagUntilTimeout + 102
        0x080026e2:    0000        ..      MOVS     r0,r0
    i.USART1_IRQHandler
    USART1_IRQHandler
        0x080026e4:    b5f8        ..      PUSH     {r3-r7,lr}
        0x080026e6:    4c1f        .L      LDR      r4,[pc,#124] ; [0x8002764] = 0x20000a5c
        0x080026e8:    6820         h      LDR      r0,[r4,#0]
        0x080026ea:    6801        .h      LDR      r1,[r0,#0]
        0x080026ec:    f1a4050c    ....    SUB      r5,r4,#0xc
        0x080026f0:    0689        ..      LSLS     r1,r1,#26
        0x080026f2:    f04f0601    O...    MOV      r6,#1
        0x080026f6:    d50f        ..      BPL      0x8002718 ; USART1_IRQHandler + 52
        0x080026f8:    6840        @h      LDR      r0,[r0,#4]
        0x080026fa:    6869        ih      LDR      r1,[r5,#4]
        0x080026fc:    7008        .p      STRB     r0,[r1,#0]
        0x080026fe:    722e        .r      STRB     r6,[r5,#8]
        0x08002700:    706e        np      STRB     r6,[r5,#1]
        0x08002702:    6820         h      LDR      r0,[r4,#0]
        0x08002704:    68c1        .h      LDR      r1,[r0,#0xc]
        0x08002706:    f0410110    A...    ORR      r1,r1,#0x10
        0x0800270a:    60c1        .`      STR      r1,[r0,#0xc]
        0x0800270c:    6869        ih      LDR      r1,[r5,#4]
        0x0800270e:    2264        d"      MOVS     r2,#0x64
        0x08002710:    4620         F      MOV      r0,r4
        0x08002712:    1c49        I.      ADDS     r1,r1,#1
        0x08002714:    f7fffb92    ....    BL       HAL_UART_Receive_DMA ; 0x8001e3c
        0x08002718:    2000        .       MOVS     r0,#0
        0x0800271a:    f7fffc53    ..S.    BL       LED_Driver_Turn ; 0x8001fc4
        0x0800271e:    4811        .H      LDR      r0,[pc,#68] ; [0x8002764] = 0x20000a5c
        0x08002720:    f7fff972    ..r.    BL       HAL_UART_IRQHandler ; 0x8001a08
        0x08002724:    6820         h      LDR      r0,[r4,#0]
        0x08002726:    6801        .h      LDR      r1,[r0,#0]
        0x08002728:    06c9        ..      LSLS     r1,r1,#27
        0x0800272a:    d51a        ..      BPL      0x8002762 ; USART1_IRQHandler + 126
        0x0800272c:    6be2        .k      LDR      r2,[r4,#0x3c]
        0x0800272e:    7a29        )z      LDRB     r1,[r5,#8]
        0x08002730:    6812        .h      LDR      r2,[r2,#0]
        0x08002732:    6852        Rh      LDR      r2,[r2,#4]
        0x08002734:    2700        .'      MOVS     r7,#0
        0x08002736:    f1c20264    ..d.    RSB      r2,r2,#0x64
        0x0800273a:    4411        .D      ADD      r1,r1,r2
        0x0800273c:    7229        )r      STRB     r1,[r5,#8]
        0x0800273e:    6801        .h      LDR      r1,[r0,#0]
        0x08002740:    6841        Ah      LDR      r1,[r0,#4]
        0x08002742:    9100        ..      STR      r1,[sp,#0]
        0x08002744:    68c1        .h      LDR      r1,[r0,#0xc]
        0x08002746:    f0210110    !...    BIC      r1,r1,#0x10
        0x0800274a:    60c1        .`      STR      r1,[r0,#0xc]
        0x0800274c:    4639        9F      MOV      r1,r7
        0x0800274e:    4805        .H      LDR      r0,[pc,#20] ; [0x8002764] = 0x20000a5c
        0x08002750:    f7fff921    ..!.    BL       HAL_UART_DMAStop ; 0x8001996
        0x08002754:    6820         h      LDR      r0,[r4,#0]
        0x08002756:    68c1        .h      LDR      r1,[r0,#0xc]
        0x08002758:    f0410120    A. .    ORR      r1,r1,#0x20
        0x0800275c:    60c1        .`      STR      r1,[r0,#0xc]
        0x0800275e:    702e        .p      STRB     r6,[r5,#0]
        0x08002760:    706f        op      STRB     r7,[r5,#1]
        0x08002762:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x08002764:    20000a5c    \..     DCD    536873564
    $t
    i.USART3_IRQHandler
    USART3_IRQHandler
        0x08002768:    4905        .I      LDR      r1,[pc,#20] ; [0x8002780] = 0x20000c6d
        0x0800276a:    b510        ..      PUSH     {r4,lr}
        0x0800276c:    2263        c"      MOVS     r2,#0x63
        0x0800276e:    f2a11009    ....    SUB      r0,r1,#0x109
        0x08002772:    f7fffb63    ..c.    BL       HAL_UART_Receive_DMA ; 0x8001e3c
        0x08002776:    e8bd4010    ...@    POP      {r4,lr}
        0x0800277a:    4802        .H      LDR      r0,[pc,#8] ; [0x8002784] = 0x20000b64
        0x0800277c:    f7ffb944    ..D.    B        HAL_UART_IRQHandler ; 0x8001a08
    $d
        0x08002780:    20000c6d    m..     DCD    536874093
        0x08002784:    20000b64    d..     DCD    536873828
    $t
    i.UsageFault_Handler
    UsageFault_Handler
        0x08002788:    e7fe        ..      B        UsageFault_Handler ; 0x8002788
        0x0800278a:    0000        ..      MOVS     r0,r0
    i.__0printf
    __0printf
    __1printf
    __2printf
    __c89printf
    printf
        0x0800278c:    b40f        ..      PUSH     {r0-r3}
        0x0800278e:    4b05        .K      LDR      r3,[pc,#20] ; [0x80027a4] = 0x80030c1
        0x08002790:    b510        ..      PUSH     {r4,lr}
        0x08002792:    a903        ..      ADD      r1,sp,#0xc
        0x08002794:    4a04        .J      LDR      r2,[pc,#16] ; [0x80027a8] = 0x20000024
        0x08002796:    9802        ..      LDR      r0,[sp,#8]
        0x08002798:    f000f904    ....    BL       _printf_core ; 0x80029a4
        0x0800279c:    bc10        ..      POP      {r4}
        0x0800279e:    f85dfb14    ]...    LDR      pc,[sp],#0x14
    $d
        0x080027a2:    0000        ..      DCW    0
        0x080027a4:    080030c1    .0..    DCD    134230209
        0x080027a8:    20000024    $..     DCD    536870948
    $t
    i.__0vsnprintf
    __0vsnprintf
    __1vsnprintf
    __2vsnprintf
    __c89vsnprintf
    vsnprintf
        0x080027ac:    b57c        |.      PUSH     {r2-r6,lr}
        0x080027ae:    000c        ..      MOVS     r4,r1
        0x080027b0:    461d        .F      MOV      r5,r3
        0x080027b2:    4616        .F      MOV      r6,r2
        0x080027b4:    4601        .F      MOV      r1,r0
        0x080027b6:    d001        ..      BEQ      0x80027bc ; __0vsnprintf + 16
        0x080027b8:    1e60        `.      SUBS     r0,r4,#1
        0x080027ba:    e000        ..      B        0x80027be ; __0vsnprintf + 18
        0x080027bc:    2000        .       MOVS     r0,#0
        0x080027be:    e9cd1000    ....    STRD     r1,r0,[sp,#0]
        0x080027c2:    4b06        .K      LDR      r3,[pc,#24] ; [0x80027dc] = 0x80030ab
        0x080027c4:    466a        jF      MOV      r2,sp
        0x080027c6:    4629        )F      MOV      r1,r5
        0x080027c8:    4630        0F      MOV      r0,r6
        0x080027ca:    f000f8eb    ....    BL       _printf_core ; 0x80029a4
        0x080027ce:    2c00        .,      CMP      r4,#0
        0x080027d0:    d002        ..      BEQ      0x80027d8 ; __0vsnprintf + 44
        0x080027d2:    9a00        ..      LDR      r2,[sp,#0]
        0x080027d4:    2100        .!      MOVS     r1,#0
        0x080027d6:    7011        .p      STRB     r1,[r2,#0]
        0x080027d8:    bd7c        |.      POP      {r2-r6,pc}
    $d
        0x080027da:    0000        ..      DCW    0
        0x080027dc:    080030ab    .0..    DCD    134230187
    $t
    i.__NVIC_SetPriority
    __NVIC_SetPriority
        0x080027e0:    0709        ..      LSLS     r1,r1,#28
        0x080027e2:    0e09        ..      LSRS     r1,r1,#24
        0x080027e4:    2800        .(      CMP      r0,#0
        0x080027e6:    db04        ..      BLT      0x80027f2 ; __NVIC_SetPriority + 18
        0x080027e8:    f10020e0    ...     ADD      r0,r0,#0xe000e000
        0x080027ec:    f8801400    ....    STRB     r1,[r0,#0x400]
        0x080027f0:    4770        pG      BX       lr
        0x080027f2:    f000000f    ....    AND      r0,r0,#0xf
        0x080027f6:    f10020e0    ...     ADD      r0,r0,#0xe000e000
        0x080027fa:    f8801d14    ....    STRB     r1,[r0,#0xd14]
        0x080027fe:    4770        pG      BX       lr
    i.__scatterload_copy
    __scatterload_copy
        0x08002800:    e002        ..      B        0x8002808 ; __scatterload_copy + 8
        0x08002802:    c808        ..      LDM      r0!,{r3}
        0x08002804:    1f12        ..      SUBS     r2,r2,#4
        0x08002806:    c108        ..      STM      r1!,{r3}
        0x08002808:    2a00        .*      CMP      r2,#0
        0x0800280a:    d1fa        ..      BNE      0x8002802 ; __scatterload_copy + 2
        0x0800280c:    4770        pG      BX       lr
    i.__scatterload_null
    __scatterload_null
        0x0800280e:    4770        pG      BX       lr
    i.__scatterload_zeroinit
    __scatterload_zeroinit
        0x08002810:    2000        .       MOVS     r0,#0
        0x08002812:    e001        ..      B        0x8002818 ; __scatterload_zeroinit + 8
        0x08002814:    c101        ..      STM      r1!,{r0}
        0x08002816:    1f12        ..      SUBS     r2,r2,#4
        0x08002818:    2a00        .*      CMP      r2,#0
        0x0800281a:    d1fb        ..      BNE      0x8002814 ; __scatterload_zeroinit + 4
        0x0800281c:    4770        pG      BX       lr
        0x0800281e:    0000        ..      MOVS     r0,r0
    i._fp_digits
    _fp_digits
        0x08002820:    e92d5fff    -.._    PUSH     {r0-r12,lr}
        0x08002824:    b082        ..      SUB      sp,sp,#8
        0x08002826:    2100        .!      MOVS     r1,#0
        0x08002828:    e9dd3004    ...0    LDRD     r3,r0,[sp,#0x10]
        0x0800282c:    0d02        ..      LSRS     r2,r0,#20
        0x0800282e:    f8ddb040    ..@.    LDR      r11,[sp,#0x40]
        0x08002832:    4303        .C      ORRS     r3,r3,r0
        0x08002834:    d018        ..      BEQ      0x8002868 ; _fp_digits + 72
        0x08002836:    f6445010    D..P    MOV      r0,#0x4d10
        0x0800283a:    f2a232ff    ...2    SUB      r2,r2,#0x3ff
        0x0800283e:    4342        BC      MULS     r2,r0,r2
        0x08002840:    1415        ..      ASRS     r5,r2,#16
        0x08002842:    9811        ..      LDR      r0,[sp,#0x44]
        0x08002844:    2801        .(      CMP      r0,#1
        0x08002846:    d01f        ..      BEQ      0x8002888 ; _fp_digits + 104
        0x08002848:    eba5000b    ....    SUB      r0,r5,r11
        0x0800284c:    1c40        @.      ADDS     r0,r0,#1
        0x0800284e:    ea5f0a00    _...    MOVS     r10,r0
        0x08002852:    f04f0600    O...    MOV      r6,#0
        0x08002856:    4f4e        NO      LDR      r7,[pc,#312] ; [0x8002990] = 0x40140000
        0x08002858:    f8df9138    ..8.    LDR      r9,[pc,#312] ; [0x8002994] = 0x3ff00000
        0x0800285c:    46b0        .F      MOV      r8,r6
        0x0800285e:    4650        PF      MOV      r0,r10
        0x08002860:    d515        ..      BPL      0x800288e ; _fp_digits + 110
        0x08002862:    f1ca0400    ....    RSB      r4,r10,#0
        0x08002866:    e013        ..      B        0x8002890 ; _fp_digits + 112
        0x08002868:    9811        ..      LDR      r0,[sp,#0x44]
        0x0800286a:    2401        .$      MOVS     r4,#1
        0x0800286c:    a34a        J.      ADR      r3,{pc}+0x12c ; 0x8002998
        0x0800286e:    2801        .(      CMP      r0,#1
        0x08002870:    d101        ..      BNE      0x8002876 ; _fp_digits + 86
        0x08002872:    ea6f010b    o...    MVN      r1,r11
        0x08002876:    9802        ..      LDR      r0,[sp,#8]
        0x08002878:    9a11        ..      LDR      r2,[sp,#0x44]
        0x0800287a:    e9c03100    ...1    STRD     r3,r1,[r0,#0]
        0x0800287e:    e9c04202    ...B    STRD     r4,r2,[r0,#8]
        0x08002882:    b006        ..      ADD      sp,sp,#0x18
        0x08002884:    e8bd9ff0    ....    POP      {r4-r12,pc}
        0x08002888:    f1cb0000    ....    RSB      r0,r11,#0
        0x0800288c:    e7df        ..      B        0x800284e ; _fp_digits + 46
        0x0800288e:    4604        .F      MOV      r4,r0
        0x08002890:    2100        .!      MOVS     r1,#0
        0x08002892:    4a40        @J      LDR      r2,[pc,#256] ; [0x8002994] = 0x3ff00000
        0x08002894:    1849        I.      ADDS     r1,r1,r1
        0x08002896:    eb425004    B..P    ADC      r0,r2,r4,LSL #20
        0x0800289a:    e9cd1000    ....    STRD     r1,r0,[sp,#0]
        0x0800289e:    e012        ..      B        0x80028c6 ; _fp_digits + 166
        0x080028a0:    07e0        ..      LSLS     r0,r4,#31
        0x080028a2:    d007        ..      BEQ      0x80028b4 ; _fp_digits + 148
        0x080028a4:    4632        2F      MOV      r2,r6
        0x080028a6:    463b        ;F      MOV      r3,r7
        0x080028a8:    4640        @F      MOV      r0,r8
        0x080028aa:    4649        IF      MOV      r1,r9
        0x080028ac:    f7fdfdc9    ....    BL       __aeabi_dmul ; 0x8000442
        0x080028b0:    4680        .F      MOV      r8,r0
        0x080028b2:    4689        .F      MOV      r9,r1
        0x080028b4:    4632        2F      MOV      r2,r6
        0x080028b6:    463b        ;F      MOV      r3,r7
        0x080028b8:    4610        .F      MOV      r0,r2
        0x080028ba:    4619        .F      MOV      r1,r3
        0x080028bc:    f7fdfdc1    ....    BL       __aeabi_dmul ; 0x8000442
        0x080028c0:    4606        .F      MOV      r6,r0
        0x080028c2:    460f        .F      MOV      r7,r1
        0x080028c4:    1064        d.      ASRS     r4,r4,#1
        0x080028c6:    2c00        .,      CMP      r4,#0
        0x080028c8:    d1ea        ..      BNE      0x80028a0 ; _fp_digits + 128
        0x080028ca:    e9dd0104    ....    LDRD     r0,r1,[sp,#0x10]
        0x080028ce:    e9dd2300    ...#    LDRD     r2,r3,[sp,#0]
        0x080028d2:    f1ba0f00    ....    CMP      r10,#0
        0x080028d6:    da06        ..      BGE      0x80028e6 ; _fp_digits + 198
        0x080028d8:    f7fdfdb3    ....    BL       __aeabi_dmul ; 0x8000442
        0x080028dc:    4642        BF      MOV      r2,r8
        0x080028de:    464b        KF      MOV      r3,r9
        0x080028e0:    f7fdfdaf    ....    BL       __aeabi_dmul ; 0x8000442
        0x080028e4:    e005        ..      B        0x80028f2 ; _fp_digits + 210
        0x080028e6:    f7fdfe1e    ....    BL       __aeabi_ddiv ; 0x8000526
        0x080028ea:    4642        BF      MOV      r2,r8
        0x080028ec:    464b        KF      MOV      r3,r9
        0x080028ee:    f7fdfe1a    ....    BL       __aeabi_ddiv ; 0x8000526
        0x080028f2:    4604        .F      MOV      r4,r0
        0x080028f4:    460e        .F      MOV      r6,r1
        0x080028f6:    2200        ."      MOVS     r2,#0
        0x080028f8:    4b28        (K      LDR      r3,[pc,#160] ; [0x800299c] = 0x43f00000
        0x080028fa:    f7fdfe9b    ....    BL       __aeabi_cdrcmple ; 0x8000634
        0x080028fe:    d803        ..      BHI      0x8002908 ; _fp_digits + 232
        0x08002900:    f04f30ff    O..0    MOV      r0,#0xffffffff
        0x08002904:    4601        .F      MOV      r1,r0
        0x08002906:    e007        ..      B        0x8002918 ; _fp_digits + 248
        0x08002908:    2200        ."      MOVS     r2,#0
        0x0800290a:    4b25        %K      LDR      r3,[pc,#148] ; [0x80029a0] = 0x3fe00000
        0x0800290c:    4620         F      MOV      r0,r4
        0x0800290e:    4631        1F      MOV      r1,r6
        0x08002910:    f7fdfcf0    ....    BL       __I$use$fp ; 0x80002f4
        0x08002914:    f7fdfe76    ..v.    BL       __aeabi_d2ulz ; 0x8000604
        0x08002918:    2410        .$      MOVS     r4,#0x10
        0x0800291a:    e009        ..      B        0x8002930 ; _fp_digits + 272
        0x0800291c:    2c00        .,      CMP      r4,#0
        0x0800291e:    db0a        ..      BLT      0x8002936 ; _fp_digits + 278
        0x08002920:    220a        ."      MOVS     r2,#0xa
        0x08002922:    2300        .#      MOVS     r3,#0
        0x08002924:    f7fdfc4e    ..N.    BL       __aeabi_uldivmod ; 0x80001c4
        0x08002928:    9b03        ..      LDR      r3,[sp,#0xc]
        0x0800292a:    3230        02      ADDS     r2,r2,#0x30
        0x0800292c:    551a        .U      STRB     r2,[r3,r4]
        0x0800292e:    1e64        d.      SUBS     r4,r4,#1
        0x08002930:    ea500201    P...    ORRS     r2,r0,r1
        0x08002934:    d1f2        ..      BNE      0x800291c ; _fp_digits + 252
        0x08002936:    1c64        d.      ADDS     r4,r4,#1
        0x08002938:    9a03        ..      LDR      r2,[sp,#0xc]
        0x0800293a:    f1c40311    ....    RSB      r3,r4,#0x11
        0x0800293e:    4414        .D      ADD      r4,r4,r2
        0x08002940:    9a11        ..      LDR      r2,[sp,#0x44]
        0x08002942:    2a01        .*      CMP      r2,#1
        0x08002944:    d003        ..      BEQ      0x800294e ; _fp_digits + 302
        0x08002946:    2201        ."      MOVS     r2,#1
        0x08002948:    4308        .C      ORRS     r0,r0,r1
        0x0800294a:    d10d        ..      BNE      0x8002968 ; _fp_digits + 328
        0x0800294c:    e00a        ..      B        0x8002964 ; _fp_digits + 324
        0x0800294e:    4308        .C      ORRS     r0,r0,r1
        0x08002950:    d004        ..      BEQ      0x800295c ; _fp_digits + 316
        0x08002952:    2000        .       MOVS     r0,#0
        0x08002954:    f04f0b11    O...    MOV      r11,#0x11
        0x08002958:    9011        ..      STR      r0,[sp,#0x44]
        0x0800295a:    e772        r.      B        0x8002842 ; _fp_digits + 34
        0x0800295c:    eba3050b    ....    SUB      r5,r3,r11
        0x08002960:    1e6d        m.      SUBS     r5,r5,#1
        0x08002962:    e00d        ..      B        0x8002980 ; _fp_digits + 352
        0x08002964:    455b        [E      CMP      r3,r11
        0x08002966:    dd04        ..      BLE      0x8002972 ; _fp_digits + 338
        0x08002968:    f04f0200    O...    MOV      r2,#0
        0x0800296c:    f1050501    ....    ADD      r5,r5,#1
        0x08002970:    e004        ..      B        0x800297c ; _fp_digits + 348
        0x08002972:    da03        ..      BGE      0x800297c ; _fp_digits + 348
        0x08002974:    f04f0200    O...    MOV      r2,#0
        0x08002978:    f1a50501    ....    SUB      r5,r5,#1
        0x0800297c:    2a00        .*      CMP      r2,#0
        0x0800297e:    d0ec        ..      BEQ      0x800295a ; _fp_digits + 314
        0x08002980:    9802        ..      LDR      r0,[sp,#8]
        0x08002982:    9911        ..      LDR      r1,[sp,#0x44]
        0x08002984:    e9c03102    ...1    STRD     r3,r1,[r0,#8]
        0x08002988:    e9c04500    ...E    STRD     r4,r5,[r0,#0]
        0x0800298c:    e779        y.      B        0x8002882 ; _fp_digits + 98
    $d
        0x0800298e:    0000        ..      DCW    0
        0x08002990:    40140000    ...@    DCD    1075052544
        0x08002994:    3ff00000    ...?    DCD    1072693248
        0x08002998:    00000030    0...    DCD    48
        0x0800299c:    43f00000    ...C    DCD    1139802112
        0x080029a0:    3fe00000    ...?    DCD    1071644672
    $t
    i._printf_core
    _printf_core
        0x080029a4:    e92d4fff    -..O    PUSH     {r0-r11,lr}
        0x080029a8:    b095        ..      SUB      sp,sp,#0x54
        0x080029aa:    469a        .F      MOV      r10,r3
        0x080029ac:    4688        .F      MOV      r8,r1
        0x080029ae:    4606        .F      MOV      r6,r0
        0x080029b0:    2500        .%      MOVS     r5,#0
        0x080029b2:    e1ee        ..      B        0x8002d92 ; _printf_core + 1006
        0x080029b4:    2825        %(      CMP      r0,#0x25
        0x080029b6:    d177        w.      BNE      0x8002aa8 ; _printf_core + 260
        0x080029b8:    2400        .$      MOVS     r4,#0
        0x080029ba:    4627        'F      MOV      r7,r4
        0x080029bc:    4af9        .J      LDR      r2,[pc,#996] ; [0x8002da4] = 0x12809
        0x080029be:    2101        .!      MOVS     r1,#1
        0x080029c0:    9403        ..      STR      r4,[sp,#0xc]
        0x080029c2:    e000        ..      B        0x80029c6 ; _printf_core + 34
        0x080029c4:    4304        .C      ORRS     r4,r4,r0
        0x080029c6:    f8163f01    ...?    LDRB     r3,[r6,#1]!
        0x080029ca:    3b20         ;      SUBS     r3,r3,#0x20
        0x080029cc:    fa01f003    ....    LSL      r0,r1,r3
        0x080029d0:    4210        .B      TST      r0,r2
        0x080029d2:    d1f7        ..      BNE      0x80029c4 ; _printf_core + 32
        0x080029d4:    7830        0x      LDRB     r0,[r6,#0]
        0x080029d6:    282a        *(      CMP      r0,#0x2a
        0x080029d8:    d011        ..      BEQ      0x80029fe ; _printf_core + 90
        0x080029da:    f06f032f    o./.    MVN      r3,#0x2f
        0x080029de:    7830        0x      LDRB     r0,[r6,#0]
        0x080029e0:    f1a00230    ..0.    SUB      r2,r0,#0x30
        0x080029e4:    2a09        .*      CMP      r2,#9
        0x080029e6:    d816        ..      BHI      0x8002a16 ; _printf_core + 114
        0x080029e8:    9a03        ..      LDR      r2,[sp,#0xc]
        0x080029ea:    f0440402    D...    ORR      r4,r4,#2
        0x080029ee:    eb020282    ....    ADD      r2,r2,r2,LSL #2
        0x080029f2:    eb030242    ..B.    ADD      r2,r3,r2,LSL #1
        0x080029f6:    4410        .D      ADD      r0,r0,r2
        0x080029f8:    1c76        v.      ADDS     r6,r6,#1
        0x080029fa:    9003        ..      STR      r0,[sp,#0xc]
        0x080029fc:    e7ef        ..      B        0x80029de ; _printf_core + 58
        0x080029fe:    f8582b04    X..+    LDR      r2,[r8],#4
        0x08002a02:    9203        ..      STR      r2,[sp,#0xc]
        0x08002a04:    2a00        .*      CMP      r2,#0
        0x08002a06:    da03        ..      BGE      0x8002a10 ; _printf_core + 108
        0x08002a08:    4250        PB      RSBS     r0,r2,#0
        0x08002a0a:    f4445400    D..T    ORR      r4,r4,#0x2000
        0x08002a0e:    9003        ..      STR      r0,[sp,#0xc]
        0x08002a10:    f0440402    D...    ORR      r4,r4,#2
        0x08002a14:    1c76        v.      ADDS     r6,r6,#1
        0x08002a16:    7830        0x      LDRB     r0,[r6,#0]
        0x08002a18:    282e        .(      CMP      r0,#0x2e
        0x08002a1a:    d116        ..      BNE      0x8002a4a ; _printf_core + 166
        0x08002a1c:    f8160f01    ....    LDRB     r0,[r6,#1]!
        0x08002a20:    f0440404    D...    ORR      r4,r4,#4
        0x08002a24:    282a        *(      CMP      r0,#0x2a
        0x08002a26:    d00d        ..      BEQ      0x8002a44 ; _printf_core + 160
        0x08002a28:    f06f022f    o./.    MVN      r2,#0x2f
        0x08002a2c:    7830        0x      LDRB     r0,[r6,#0]
        0x08002a2e:    f1a00330    ..0.    SUB      r3,r0,#0x30
        0x08002a32:    2b09        .+      CMP      r3,#9
        0x08002a34:    d809        ..      BHI      0x8002a4a ; _printf_core + 166
        0x08002a36:    eb070387    ....    ADD      r3,r7,r7,LSL #2
        0x08002a3a:    eb020343    ..C.    ADD      r3,r2,r3,LSL #1
        0x08002a3e:    18c7        ..      ADDS     r7,r0,r3
        0x08002a40:    1c76        v.      ADDS     r6,r6,#1
        0x08002a42:    e7f3        ..      B        0x8002a2c ; _printf_core + 136
        0x08002a44:    f8587b04    X..{    LDR      r7,[r8],#4
        0x08002a48:    1c76        v.      ADDS     r6,r6,#1
        0x08002a4a:    7830        0x      LDRB     r0,[r6,#0]
        0x08002a4c:    286c        l(      CMP      r0,#0x6c
        0x08002a4e:    d00f        ..      BEQ      0x8002a70 ; _printf_core + 204
        0x08002a50:    dc06        ..      BGT      0x8002a60 ; _printf_core + 188
