tangbaishu/Personal/MDK-ARM/Out/STM32F407ZGT6_Embedded_V1.asm
        0x08002a52:    284c        L(      CMP      r0,#0x4c
        0x08002a54:    d017        ..      BEQ      0x8002a86 ; _printf_core + 226
        0x08002a56:    2868        h(      CMP      r0,#0x68
        0x08002a58:    d00d        ..      BEQ      0x8002a76 ; _printf_core + 210
        0x08002a5a:    286a        j(      CMP      r0,#0x6a
        0x08002a5c:    d114        ..      BNE      0x8002a88 ; _printf_core + 228
        0x08002a5e:    e004        ..      B        0x8002a6a ; _printf_core + 198
        0x08002a60:    2874        t(      CMP      r0,#0x74
        0x08002a62:    d010        ..      BEQ      0x8002a86 ; _printf_core + 226
        0x08002a64:    287a        z(      CMP      r0,#0x7a
        0x08002a66:    d10f        ..      BNE      0x8002a88 ; _printf_core + 228
        0x08002a68:    e00d        ..      B        0x8002a86 ; _printf_core + 226
        0x08002a6a:    f4441400    D...    ORR      r4,r4,#0x200000
        0x08002a6e:    e00a        ..      B        0x8002a86 ; _printf_core + 226
        0x08002a70:    f4441480    D...    ORR      r4,r4,#0x100000
        0x08002a74:    e001        ..      B        0x8002a7a ; _printf_core + 214
        0x08002a76:    f4441440    D.@.    ORR      r4,r4,#0x300000
        0x08002a7a:    7872        rx      LDRB     r2,[r6,#1]
        0x08002a7c:    4282        .B      CMP      r2,r0
        0x08002a7e:    d102        ..      BNE      0x8002a86 ; _printf_core + 226
        0x08002a80:    f5041480    ....    ADD      r4,r4,#0x100000
        0x08002a84:    1c76        v.      ADDS     r6,r6,#1
        0x08002a86:    1c76        v.      ADDS     r6,r6,#1
        0x08002a88:    7830        0x      LDRB     r0,[r6,#0]
        0x08002a8a:    2866        f(      CMP      r0,#0x66
        0x08002a8c:    d00b        ..      BEQ      0x8002aa6 ; _printf_core + 258
        0x08002a8e:    dc13        ..      BGT      0x8002ab8 ; _printf_core + 276
        0x08002a90:    2858        X(      CMP      r0,#0x58
        0x08002a92:    d077        w.      BEQ      0x8002b84 ; _printf_core + 480
        0x08002a94:    dc09        ..      BGT      0x8002aaa ; _printf_core + 262
        0x08002a96:    2800        .(      CMP      r0,#0
        0x08002a98:    d075        u.      BEQ      0x8002b86 ; _printf_core + 482
        0x08002a9a:    2845        E(      CMP      r0,#0x45
        0x08002a9c:    d0f6        ..      BEQ      0x8002a8c ; _printf_core + 232
        0x08002a9e:    2846        F(      CMP      r0,#0x46
        0x08002aa0:    d0f4        ..      BEQ      0x8002a8c ; _printf_core + 232
        0x08002aa2:    2847        G(      CMP      r0,#0x47
        0x08002aa4:    d11a        ..      BNE      0x8002adc ; _printf_core + 312
        0x08002aa6:    e193        ..      B        0x8002dd0 ; _printf_core + 1068
        0x08002aa8:    e018        ..      B        0x8002adc ; _printf_core + 312
        0x08002aaa:    2863        c(      CMP      r0,#0x63
        0x08002aac:    d035        5.      BEQ      0x8002b1a ; _printf_core + 374
        0x08002aae:    2864        d(      CMP      r0,#0x64
        0x08002ab0:    d079        y.      BEQ      0x8002ba6 ; _printf_core + 514
        0x08002ab2:    2865        e(      CMP      r0,#0x65
        0x08002ab4:    d112        ..      BNE      0x8002adc ; _printf_core + 312
        0x08002ab6:    e18b        ..      B        0x8002dd0 ; _printf_core + 1068
        0x08002ab8:    2870        p(      CMP      r0,#0x70
        0x08002aba:    d073        s.      BEQ      0x8002ba4 ; _printf_core + 512
        0x08002abc:    dc08        ..      BGT      0x8002ad0 ; _printf_core + 300
        0x08002abe:    2867        g(      CMP      r0,#0x67
        0x08002ac0:    d0f1        ..      BEQ      0x8002aa6 ; _printf_core + 258
        0x08002ac2:    2869        i(      CMP      r0,#0x69
        0x08002ac4:    d06f        o.      BEQ      0x8002ba6 ; _printf_core + 514
        0x08002ac6:    286e        n(      CMP      r0,#0x6e
        0x08002ac8:    d00d        ..      BEQ      0x8002ae6 ; _printf_core + 322
        0x08002aca:    286f        o(      CMP      r0,#0x6f
        0x08002acc:    d106        ..      BNE      0x8002adc ; _printf_core + 312
        0x08002ace:    e0ac        ..      B        0x8002c2a ; _printf_core + 646
        0x08002ad0:    2873        s(      CMP      r0,#0x73
        0x08002ad2:    d02c        ,.      BEQ      0x8002b2e ; _printf_core + 394
        0x08002ad4:    2875        u(      CMP      r0,#0x75
        0x08002ad6:    d074        t.      BEQ      0x8002bc2 ; _printf_core + 542
        0x08002ad8:    2878        x(      CMP      r0,#0x78
        0x08002ada:    d053        S.      BEQ      0x8002b84 ; _printf_core + 480
        0x08002adc:    4652        RF      MOV      r2,r10
        0x08002ade:    9917        ..      LDR      r1,[sp,#0x5c]
        0x08002ae0:    4790        .G      BLX      r2
        0x08002ae2:    1c6d        m.      ADDS     r5,r5,#1
        0x08002ae4:    e154        T.      B        0x8002d90 ; _printf_core + 1004
        0x08002ae6:    f3c45002    ...P    UBFX     r0,r4,#20,#3
        0x08002aea:    2802        .(      CMP      r0,#2
        0x08002aec:    d009        ..      BEQ      0x8002b02 ; _printf_core + 350
        0x08002aee:    2803        .(      CMP      r0,#3
        0x08002af0:    d00d        ..      BEQ      0x8002b0e ; _printf_core + 362
        0x08002af2:    f8d81000    ....    LDR      r1,[r8,#0]
        0x08002af6:    2804        .(      CMP      r0,#4
        0x08002af8:    d00d        ..      BEQ      0x8002b16 ; _printf_core + 370
        0x08002afa:    600d        .`      STR      r5,[r1,#0]
        0x08002afc:    f1080804    ....    ADD      r8,r8,#4
        0x08002b00:    e146        F.      B        0x8002d90 ; _printf_core + 1004
        0x08002b02:    f8d81000    ....    LDR      r1,[r8,#0]
        0x08002b06:    17ea        ..      ASRS     r2,r5,#31
        0x08002b08:    e9c15200    ...R    STRD     r5,r2,[r1,#0]
        0x08002b0c:    e7f6        ..      B        0x8002afc ; _printf_core + 344
        0x08002b0e:    f8d81000    ....    LDR      r1,[r8,#0]
        0x08002b12:    800d        ..      STRH     r5,[r1,#0]
        0x08002b14:    e7f2        ..      B        0x8002afc ; _printf_core + 344
        0x08002b16:    700d        .p      STRB     r5,[r1,#0]
        0x08002b18:    e7f0        ..      B        0x8002afc ; _printf_core + 344
        0x08002b1a:    f8181b04    ....    LDRB     r1,[r8],#4
        0x08002b1e:    f88d1000    ....    STRB     r1,[sp,#0]
        0x08002b22:    2000        .       MOVS     r0,#0
        0x08002b24:    f88d0001    ....    STRB     r0,[sp,#1]
        0x08002b28:    46eb        .F      MOV      r11,sp
        0x08002b2a:    2001        .       MOVS     r0,#1
        0x08002b2c:    e003        ..      B        0x8002b36 ; _printf_core + 402
        0x08002b2e:    f858bb04    X...    LDR      r11,[r8],#4
        0x08002b32:    f04f30ff    O..0    MOV      r0,#0xffffffff
        0x08002b36:    0761        a.      LSLS     r1,r4,#29
        0x08002b38:    f04f0100    O...    MOV      r1,#0
        0x08002b3c:    d402        ..      BMI      0x8002b44 ; _printf_core + 416
        0x08002b3e:    e00d        ..      B        0x8002b5c ; _printf_core + 440
        0x08002b40:    f1090101    ....    ADD      r1,r9,#1
        0x08002b44:    4689        .F      MOV      r9,r1
        0x08002b46:    42b9        .B      CMP      r1,r7
        0x08002b48:    da0f        ..      BGE      0x8002b6a ; _printf_core + 454
        0x08002b4a:    4581        .E      CMP      r9,r0
        0x08002b4c:    dbf8        ..      BLT      0x8002b40 ; _printf_core + 412
        0x08002b4e:    f81b1009    ....    LDRB     r1,[r11,r9]
        0x08002b52:    2900        .)      CMP      r1,#0
        0x08002b54:    d1f4        ..      BNE      0x8002b40 ; _printf_core + 412
        0x08002b56:    e008        ..      B        0x8002b6a ; _printf_core + 454
        0x08002b58:    f1090101    ....    ADD      r1,r9,#1
        0x08002b5c:    4689        .F      MOV      r9,r1
        0x08002b5e:    4281        .B      CMP      r1,r0
        0x08002b60:    dbfa        ..      BLT      0x8002b58 ; _printf_core + 436
        0x08002b62:    f81b1009    ....    LDRB     r1,[r11,r9]
        0x08002b66:    2900        .)      CMP      r1,#0
        0x08002b68:    d1f6        ..      BNE      0x8002b58 ; _printf_core + 436
        0x08002b6a:    9803        ..      LDR      r0,[sp,#0xc]
        0x08002b6c:    4653        SF      MOV      r3,r10
        0x08002b6e:    eba00709    ....    SUB      r7,r0,r9
        0x08002b72:    4621        !F      MOV      r1,r4
        0x08002b74:    4638        8F      MOV      r0,r7
        0x08002b76:    9a17        ..      LDR      r2,[sp,#0x5c]
        0x08002b78:    f000fa80    ....    BL       _printf_pre_padding ; 0x800307c
        0x08002b7c:    4428        (D      ADD      r0,r0,r5
        0x08002b7e:    eb000509    ....    ADD      r5,r0,r9
        0x08002b82:    e007        ..      B        0x8002b94 ; _printf_core + 496
        0x08002b84:    e044        D.      B        0x8002c10 ; _printf_core + 620
        0x08002b86:    e108        ..      B        0x8002d9a ; _printf_core + 1014
        0x08002b88:    e00d        ..      B        0x8002ba6 ; _printf_core + 514
        0x08002b8a:    f81b0b01    ....    LDRB     r0,[r11],#1
        0x08002b8e:    4652        RF      MOV      r2,r10
        0x08002b90:    9917        ..      LDR      r1,[sp,#0x5c]
        0x08002b92:    4790        .G      BLX      r2
        0x08002b94:    f1b90901    ....    SUBS     r9,r9,#1
        0x08002b98:    d2f7        ..      BCS      0x8002b8a ; _printf_core + 486
        0x08002b9a:    4653        SF      MOV      r3,r10
        0x08002b9c:    4621        !F      MOV      r1,r4
        0x08002b9e:    4638        8F      MOV      r0,r7
        0x08002ba0:    9a17        ..      LDR      r2,[sp,#0x5c]
        0x08002ba2:    e0f2        ..      B        0x8002d8a ; _printf_core + 998
        0x08002ba4:    e039        9.      B        0x8002c1a ; _printf_core + 630
        0x08002ba6:    210a        .!      MOVS     r1,#0xa
        0x08002ba8:    f3c45202    ...R    UBFX     r2,r4,#20,#3
        0x08002bac:    f04f0b00    O...    MOV      r11,#0
        0x08002bb0:    9100        ..      STR      r1,[sp,#0]
        0x08002bb2:    2a02        .*      CMP      r2,#2
        0x08002bb4:    d006        ..      BEQ      0x8002bc4 ; _printf_core + 544
        0x08002bb6:    f8580b04    X...    LDR      r0,[r8],#4
        0x08002bba:    17c1        ..      ASRS     r1,r0,#31
        0x08002bbc:    2a03        .*      CMP      r2,#3
        0x08002bbe:    d009        ..      BEQ      0x8002bd4 ; _printf_core + 560
        0x08002bc0:    e00a        ..      B        0x8002bd8 ; _printf_core + 564
        0x08002bc2:    e023        #.      B        0x8002c0c ; _printf_core + 616
        0x08002bc4:    f1080007    ....    ADD      r0,r8,#7
        0x08002bc8:    f0200207     ...    BIC      r2,r0,#7
        0x08002bcc:    e8f20102    ....    LDRD     r0,r1,[r2],#8
        0x08002bd0:    4690        .F      MOV      r8,r2
        0x08002bd2:    e005        ..      B        0x8002be0 ; _printf_core + 572
        0x08002bd4:    b200        ..      SXTH     r0,r0
        0x08002bd6:    17c1        ..      ASRS     r1,r0,#31
        0x08002bd8:    2a04        .*      CMP      r2,#4
        0x08002bda:    d101        ..      BNE      0x8002be0 ; _printf_core + 572
        0x08002bdc:    b240        @.      SXTB     r0,r0
        0x08002bde:    17c1        ..      ASRS     r1,r0,#31
        0x08002be0:    2900        .)      CMP      r1,#0
        0x08002be2:    da06        ..      BGE      0x8002bf2 ; _printf_core + 590
        0x08002be4:    460a        .F      MOV      r2,r1
        0x08002be6:    2100        .!      MOVS     r1,#0
        0x08002be8:    4240        @B      RSBS     r0,r0,#0
        0x08002bea:    eb610102    a...    SBC      r1,r1,r2
        0x08002bee:    222d        -"      MOVS     r2,#0x2d
        0x08002bf0:    e002        ..      B        0x8002bf8 ; _printf_core + 596
        0x08002bf2:    0522        ".      LSLS     r2,r4,#20
        0x08002bf4:    d504        ..      BPL      0x8002c00 ; _printf_core + 604
        0x08002bf6:    222b        +"      MOVS     r2,#0x2b
        0x08002bf8:    f88d2004    ...     STRB     r2,[sp,#4]
        0x08002bfc:    2201        ."      MOVS     r2,#1
        0x08002bfe:    e003        ..      B        0x8002c08 ; _printf_core + 612
        0x08002c00:    07e2        ..      LSLS     r2,r4,#31
        0x08002c02:    d001        ..      BEQ      0x8002c08 ; _printf_core + 612
        0x08002c04:    2220         "      MOVS     r2,#0x20
        0x08002c06:    e7f7        ..      B        0x8002bf8 ; _printf_core + 596
        0x08002c08:    4691        .F      MOV      r9,r2
        0x08002c0a:    e057        W.      B        0x8002cbc ; _printf_core + 792
        0x08002c0c:    210a        .!      MOVS     r1,#0xa
        0x08002c0e:    e000        ..      B        0x8002c12 ; _printf_core + 622
        0x08002c10:    2110        .!      MOVS     r1,#0x10
        0x08002c12:    f04f0b00    O...    MOV      r11,#0
        0x08002c16:    9100        ..      STR      r1,[sp,#0]
        0x08002c18:    e00b        ..      B        0x8002c32 ; _printf_core + 654
        0x08002c1a:    2110        .!      MOVS     r1,#0x10
        0x08002c1c:    f04f0b00    O...    MOV      r11,#0
        0x08002c20:    f0440404    D...    ORR      r4,r4,#4
        0x08002c24:    2708        .'      MOVS     r7,#8
        0x08002c26:    9100        ..      STR      r1,[sp,#0]
        0x08002c28:    e003        ..      B        0x8002c32 ; _printf_core + 654
        0x08002c2a:    2008        .       MOVS     r0,#8
        0x08002c2c:    f04f0b00    O...    MOV      r11,#0
        0x08002c30:    9000        ..      STR      r0,[sp,#0]
        0x08002c32:    f3c45202    ...R    UBFX     r2,r4,#20,#3
        0x08002c36:    2a02        .*      CMP      r2,#2
        0x08002c38:    d005        ..      BEQ      0x8002c46 ; _printf_core + 674
        0x08002c3a:    f8580b04    X...    LDR      r0,[r8],#4
        0x08002c3e:    2100        .!      MOVS     r1,#0
        0x08002c40:    2a03        .*      CMP      r2,#3
        0x08002c42:    d008        ..      BEQ      0x8002c56 ; _printf_core + 690
        0x08002c44:    e008        ..      B        0x8002c58 ; _printf_core + 692
        0x08002c46:    f1080007    ....    ADD      r0,r8,#7
        0x08002c4a:    f0200207     ...    BIC      r2,r0,#7
        0x08002c4e:    e8f20102    ....    LDRD     r0,r1,[r2],#8
        0x08002c52:    4690        .F      MOV      r8,r2
        0x08002c54:    e003        ..      B        0x8002c5e ; _printf_core + 698
        0x08002c56:    b280        ..      UXTH     r0,r0
        0x08002c58:    2a04        .*      CMP      r2,#4
        0x08002c5a:    d100        ..      BNE      0x8002c5e ; _printf_core + 698
        0x08002c5c:    b2c0        ..      UXTB     r0,r0
        0x08002c5e:    f04f0900    O...    MOV      r9,#0
        0x08002c62:    0722        ".      LSLS     r2,r4,#28
        0x08002c64:    d52a        *.      BPL      0x8002cbc ; _printf_core + 792
        0x08002c66:    7832        2x      LDRB     r2,[r6,#0]
        0x08002c68:    2a70        p*      CMP      r2,#0x70
        0x08002c6a:    d007        ..      BEQ      0x8002c7c ; _printf_core + 728
        0x08002c6c:    f8ddc000    ....    LDR      r12,[sp,#0]
        0x08002c70:    f08c0c10    ....    EOR      r12,r12,#0x10
        0x08002c74:    ea5c0c0b    \...    ORRS     r12,r12,r11
        0x08002c78:    d005        ..      BEQ      0x8002c86 ; _printf_core + 738
        0x08002c7a:    e00e        ..      B        0x8002c9a ; _printf_core + 758
        0x08002c7c:    2240        @"      MOVS     r2,#0x40
        0x08002c7e:    f88d2004    ...     STRB     r2,[sp,#4]
        0x08002c82:    2201        ."      MOVS     r2,#1
        0x08002c84:    e008        ..      B        0x8002c98 ; _printf_core + 756
        0x08002c86:    ea500301    P...    ORRS     r3,r0,r1
        0x08002c8a:    d006        ..      BEQ      0x8002c9a ; _printf_core + 758
        0x08002c8c:    2330        0#      MOVS     r3,#0x30
        0x08002c8e:    f88d3004    ...0    STRB     r3,[sp,#4]
        0x08002c92:    f88d2005    ...     STRB     r2,[sp,#5]
        0x08002c96:    2202        ."      MOVS     r2,#2
        0x08002c98:    4691        .F      MOV      r9,r2
        0x08002c9a:    9b00        ..      LDR      r3,[sp,#0]
        0x08002c9c:    f0830308    ....    EOR      r3,r3,#8
        0x08002ca0:    ea53030b    S...    ORRS     r3,r3,r11
        0x08002ca4:    d10a        ..      BNE      0x8002cbc ; _printf_core + 792
        0x08002ca6:    ea500201    P...    ORRS     r2,r0,r1
        0x08002caa:    d101        ..      BNE      0x8002cb0 ; _printf_core + 780
        0x08002cac:    0762        b.      LSLS     r2,r4,#29
        0x08002cae:    d505        ..      BPL      0x8002cbc ; _printf_core + 792
        0x08002cb0:    2230        0"      MOVS     r2,#0x30
        0x08002cb2:    f88d2004    ...     STRB     r2,[sp,#4]
        0x08002cb6:    f04f0901    O...    MOV      r9,#1
        0x08002cba:    1e7f        ..      SUBS     r7,r7,#1
        0x08002cbc:    7832        2x      LDRB     r2,[r6,#0]
        0x08002cbe:    2a58        X*      CMP      r2,#0x58
        0x08002cc0:    d004        ..      BEQ      0x8002ccc ; _printf_core + 808
        0x08002cc2:    a239        9.      ADR      r2,{pc}+0xe6 ; 0x8002da8
        0x08002cc4:    920c        ..      STR      r2,[sp,#0x30]
        0x08002cc6:    aa0c        ..      ADD      r2,sp,#0x30
        0x08002cc8:    9202        ..      STR      r2,[sp,#8]
        0x08002cca:    e00b        ..      B        0x8002ce4 ; _printf_core + 832
        0x08002ccc:    a23b        ;.      ADR      r2,{pc}+0xf0 ; 0x8002dbc
        0x08002cce:    e7f9        ..      B        0x8002cc4 ; _printf_core + 800
        0x08002cd0:    465b        [F      MOV      r3,r11
        0x08002cd2:    9a00        ..      LDR      r2,[sp,#0]
        0x08002cd4:    f7fdfa76    ..v.    BL       __aeabi_uldivmod ; 0x80001c4
        0x08002cd8:    9b0c        ..      LDR      r3,[sp,#0x30]
        0x08002cda:    5c9b        .\      LDRB     r3,[r3,r2]
        0x08002cdc:    9a02        ..      LDR      r2,[sp,#8]
        0x08002cde:    1e52        R.      SUBS     r2,r2,#1
        0x08002ce0:    9202        ..      STR      r2,[sp,#8]
        0x08002ce2:    7013        .p      STRB     r3,[r2,#0]
        0x08002ce4:    ea500201    P...    ORRS     r2,r0,r1
        0x08002ce8:    d1f2        ..      BNE      0x8002cd0 ; _printf_core + 812
        0x08002cea:    9802        ..      LDR      r0,[sp,#8]
        0x08002cec:    a904        ..      ADD      r1,sp,#0x10
        0x08002cee:    1a08        ..      SUBS     r0,r1,r0
        0x08002cf0:    f1000b20    .. .    ADD      r11,r0,#0x20
        0x08002cf4:    0760        `.      LSLS     r0,r4,#29
        0x08002cf6:    d502        ..      BPL      0x8002cfe ; _printf_core + 858
        0x08002cf8:    f4243480    $..4    BIC      r4,r4,#0x10000
        0x08002cfc:    e000        ..      B        0x8002d00 ; _printf_core + 860
        0x08002cfe:    2701        .'      MOVS     r7,#1
        0x08002d00:    455f        _E      CMP      r7,r11
        0x08002d02:    dd02        ..      BLE      0x8002d0a ; _printf_core + 870
        0x08002d04:    eba7000b    ....    SUB      r0,r7,r11
        0x08002d08:    e000        ..      B        0x8002d0c ; _printf_core + 872
        0x08002d0a:    2000        .       MOVS     r0,#0
        0x08002d0c:    eb00010b    ....    ADD      r1,r0,r11
        0x08002d10:    9000        ..      STR      r0,[sp,#0]
        0x08002d12:    9803        ..      LDR      r0,[sp,#0xc]
        0x08002d14:    4449        ID      ADD      r1,r1,r9
        0x08002d16:    1a40        @.      SUBS     r0,r0,r1
        0x08002d18:    9003        ..      STR      r0,[sp,#0xc]
        0x08002d1a:    03e0        ..      LSLS     r0,r4,#15
        0x08002d1c:    d406        ..      BMI      0x8002d2c ; _printf_core + 904
        0x08002d1e:    4653        SF      MOV      r3,r10
        0x08002d20:    4621        !F      MOV      r1,r4
        0x08002d22:    9a17        ..      LDR      r2,[sp,#0x5c]
        0x08002d24:    9803        ..      LDR      r0,[sp,#0xc]
        0x08002d26:    f000f9a9    ....    BL       _printf_pre_padding ; 0x800307c
        0x08002d2a:    4405        .D      ADD      r5,r5,r0
        0x08002d2c:    2700        .'      MOVS     r7,#0
        0x08002d2e:    e006        ..      B        0x8002d3e ; _printf_core + 922
        0x08002d30:    a801        ..      ADD      r0,sp,#4
        0x08002d32:    4652        RF      MOV      r2,r10
        0x08002d34:    5dc0        .]      LDRB     r0,[r0,r7]
        0x08002d36:    9917        ..      LDR      r1,[sp,#0x5c]
        0x08002d38:    4790        .G      BLX      r2
        0x08002d3a:    1c6d        m.      ADDS     r5,r5,#1
        0x08002d3c:    1c7f        ..      ADDS     r7,r7,#1
        0x08002d3e:    454f        OE      CMP      r7,r9
        0x08002d40:    dbf6        ..      BLT      0x8002d30 ; _printf_core + 908
        0x08002d42:    03e0        ..      LSLS     r0,r4,#15
        0x08002d44:    d50c        ..      BPL      0x8002d60 ; _printf_core + 956
        0x08002d46:    4653        SF      MOV      r3,r10
        0x08002d48:    4621        !F      MOV      r1,r4
        0x08002d4a:    9a17        ..      LDR      r2,[sp,#0x5c]
        0x08002d4c:    9803        ..      LDR      r0,[sp,#0xc]
        0x08002d4e:    f000f995    ....    BL       _printf_pre_padding ; 0x800307c
        0x08002d52:    4405        .D      ADD      r5,r5,r0
        0x08002d54:    e004        ..      B        0x8002d60 ; _printf_core + 956
        0x08002d56:    2030        0       MOVS     r0,#0x30
        0x08002d58:    4652        RF      MOV      r2,r10
        0x08002d5a:    9917        ..      LDR      r1,[sp,#0x5c]
        0x08002d5c:    4790        .G      BLX      r2
        0x08002d5e:    1c6d        m.      ADDS     r5,r5,#1
        0x08002d60:    9900        ..      LDR      r1,[sp,#0]
        0x08002d62:    1e48        H.      SUBS     r0,r1,#1
        0x08002d64:    9000        ..      STR      r0,[sp,#0]
        0x08002d66:    2900        .)      CMP      r1,#0
        0x08002d68:    dcf5        ..      BGT      0x8002d56 ; _printf_core + 946
        0x08002d6a:    e008        ..      B        0x8002d7e ; _printf_core + 986
        0x08002d6c:    9802        ..      LDR      r0,[sp,#8]
        0x08002d6e:    9902        ..      LDR      r1,[sp,#8]
        0x08002d70:    4652        RF      MOV      r2,r10
        0x08002d72:    7800        .x      LDRB     r0,[r0,#0]
        0x08002d74:    1c49        I.      ADDS     r1,r1,#1
        0x08002d76:    9102        ..      STR      r1,[sp,#8]
        0x08002d78:    9917        ..      LDR      r1,[sp,#0x5c]
        0x08002d7a:    4790        .G      BLX      r2
        0x08002d7c:    1c6d        m.      ADDS     r5,r5,#1
        0x08002d7e:    f1bb0100    ....    SUBS     r1,r11,#0
        0x08002d82:    f1ab0b01    ....    SUB      r11,r11,#1
        0x08002d86:    dcf1        ..      BGT      0x8002d6c ; _printf_core + 968
        0x08002d88:    e15b        [.      B        0x8003042 ; _printf_core + 1694
        0x08002d8a:    f000f965    ..e.    BL       _printf_post_padding ; 0x8003058
        0x08002d8e:    4405        .D      ADD      r5,r5,r0
        0x08002d90:    1c76        v.      ADDS     r6,r6,#1
        0x08002d92:    7830        0x      LDRB     r0,[r6,#0]
        0x08002d94:    2800        .(      CMP      r0,#0
