tangbaishu/Personal/MDK-ARM/Out/STM32F407ZGT6_Embedded_V1.asm
        0x08002d96:    f47fae0d    ....    BNE      0x80029b4 ; _printf_core + 16
        0x08002d9a:    b019        ..      ADD      sp,sp,#0x64
        0x08002d9c:    4628        (F      MOV      r0,r5
        0x08002d9e:    e8bd8ff0    ....    POP      {r4-r11,pc}
    $d
        0x08002da2:    0000        ..      DCW    0
        0x08002da4:    00012809    .(..    DCD    75785
        0x08002da8:    33323130    0123    DCD    858927408
        0x08002dac:    37363534    4567    DCD    926299444
        0x08002db0:    62613938    89ab    DCD    1650538808
        0x08002db4:    66656463    cdef    DCD    1717920867
        0x08002db8:    00000000    ....    DCD    0
        0x08002dbc:    33323130    0123    DCD    858927408
        0x08002dc0:    37363534    4567    DCD    926299444
        0x08002dc4:    42413938    89AB    DCD    1111570744
        0x08002dc8:    46454443    CDEF    DCD    1178944579
        0x08002dcc:    00000000    ....    DCD    0
    $t
        0x08002dd0:    0760        `.      LSLS     r0,r4,#29
        0x08002dd2:    d400        ..      BMI      0x8002dd6 ; _printf_core + 1074
        0x08002dd4:    2706        .'      MOVS     r7,#6
        0x08002dd6:    f1080007    ....    ADD      r0,r8,#7
        0x08002dda:    f0200007     ...    BIC      r0,r0,#7
        0x08002dde:    e8f02302    ...#    LDRD     r2,r3,[r0],#8
        0x08002de2:    4680        .F      MOV      r8,r0
        0x08002de4:    f0034c00    ...L    AND      r12,r3,#0x80000000
        0x08002de8:    ea5f000c    _...    MOVS     r0,r12
        0x08002dec:    d001        ..      BEQ      0x8002df2 ; _printf_core + 1102
        0x08002dee:    a097        ..      ADR      r0,{pc}+0x25e ; 0x800304c
        0x08002df0:    e009        ..      B        0x8002e06 ; _printf_core + 1122
        0x08002df2:    0520         .      LSLS     r0,r4,#20
        0x08002df4:    d501        ..      BPL      0x8002dfa ; _printf_core + 1110
        0x08002df6:    a096        ..      ADR      r0,{pc}+0x25a ; 0x8003050
        0x08002df8:    e005        ..      B        0x8002e06 ; _printf_core + 1122
        0x08002dfa:    07e0        ..      LSLS     r0,r4,#31
        0x08002dfc:    d001        ..      BEQ      0x8002e02 ; _printf_core + 1118
        0x08002dfe:    a095        ..      ADR      r0,{pc}+0x256 ; 0x8003054
        0x08002e00:    e001        ..      B        0x8002e06 ; _printf_core + 1122
        0x08002e02:    f2af004c    ..L.    ADR      r0,{pc}-0x4a ; 0x8002db8
        0x08002e06:    9013        ..      STR      r0,[sp,#0x4c]
        0x08002e08:    7830        0x      LDRB     r0,[r6,#0]
        0x08002e0a:    f0234300    #..C    BIC      r3,r3,#0x80000000
        0x08002e0e:    2865        e(      CMP      r0,#0x65
        0x08002e10:    d00c        ..      BEQ      0x8002e2c ; _printf_core + 1160
        0x08002e12:    dc06        ..      BGT      0x8002e22 ; _printf_core + 1150
        0x08002e14:    2845        E(      CMP      r0,#0x45
        0x08002e16:    d009        ..      BEQ      0x8002e2c ; _printf_core + 1160
        0x08002e18:    2846        F(      CMP      r0,#0x46
        0x08002e1a:    d01d        ..      BEQ      0x8002e58 ; _printf_core + 1204
        0x08002e1c:    2847        G(      CMP      r0,#0x47
        0x08002e1e:    d17f        ..      BNE      0x8002f20 ; _printf_core + 1404
        0x08002e20:    e03b        ;.      B        0x8002e9a ; _printf_core + 1270
        0x08002e22:    2866        f(      CMP      r0,#0x66
        0x08002e24:    d018        ..      BEQ      0x8002e58 ; _printf_core + 1204
        0x08002e26:    2867        g(      CMP      r0,#0x67
        0x08002e28:    d17a        z.      BNE      0x8002f20 ; _printf_core + 1404
        0x08002e2a:    e036        6.      B        0x8002e9a ; _printf_core + 1270
        0x08002e2c:    2100        .!      MOVS     r1,#0
        0x08002e2e:    2f11        ./      CMP      r7,#0x11
        0x08002e30:    db01        ..      BLT      0x8002e36 ; _printf_core + 1170
        0x08002e32:    2011        .       MOVS     r0,#0x11
        0x08002e34:    e000        ..      B        0x8002e38 ; _printf_core + 1172
        0x08002e36:    1c78        x.      ADDS     r0,r7,#1
        0x08002e38:    e9cd0100    ....    STRD     r0,r1,[sp,#0]
        0x08002e3c:    a904        ..      ADD      r1,sp,#0x10
        0x08002e3e:    a80c        ..      ADD      r0,sp,#0x30
        0x08002e40:    f7fffcee    ....    BL       _fp_digits ; 0x8002820
        0x08002e44:    e9dd010d    ....    LDRD     r0,r1,[sp,#0x34]
        0x08002e48:    9a0c        ..      LDR      r2,[sp,#0x30]
        0x08002e4a:    f04f0b00    O...    MOV      r11,#0
        0x08002e4e:    f1070901    ....    ADD      r9,r7,#1
        0x08002e52:    9210        ..      STR      r2,[sp,#0x40]
        0x08002e54:    9100        ..      STR      r1,[sp,#0]
        0x08002e56:    e04e        N.      B        0x8002ef6 ; _printf_core + 1362
        0x08002e58:    f04f4000    O..@    MOV      r0,#0x80000000
        0x08002e5c:    9700        ..      STR      r7,[sp,#0]
        0x08002e5e:    e9cd1001    ....    STRD     r1,r0,[sp,#4]
        0x08002e62:    a904        ..      ADD      r1,sp,#0x10
        0x08002e64:    a80c        ..      ADD      r0,sp,#0x30
        0x08002e66:    f7fffcdb    ....    BL       _fp_digits ; 0x8002820
        0x08002e6a:    e9dd020d    ....    LDRD     r0,r2,[sp,#0x34]
        0x08002e6e:    9b0c        ..      LDR      r3,[sp,#0x30]
        0x08002e70:    990f        ..      LDR      r1,[sp,#0x3c]
        0x08002e72:    f04f0b00    O...    MOV      r11,#0
        0x08002e76:    4691        .F      MOV      r9,r2
        0x08002e78:    9310        ..      STR      r3,[sp,#0x40]
        0x08002e7a:    9200        ..      STR      r2,[sp,#0]
        0x08002e7c:    b911        ..      CBNZ     r1,0x8002e84 ; _printf_core + 1248
        0x08002e7e:    1c79        y.      ADDS     r1,r7,#1
        0x08002e80:    eb000901    ....    ADD      r9,r0,r1
        0x08002e84:    ebb70009    ....    SUBS     r0,r7,r9
        0x08002e88:    d403        ..      BMI      0x8002e92 ; _printf_core + 1262
        0x08002e8a:    f1c03bff    ...;    RSB      r11,r0,#0xffffffff
        0x08002e8e:    f1070901    ....    ADD      r9,r7,#1
        0x08002e92:    eba90007    ....    SUB      r0,r9,r7
        0x08002e96:    9001        ..      STR      r0,[sp,#4]
        0x08002e98:    e042        B.      B        0x8002f20 ; _printf_core + 1404
        0x08002e9a:    2f01        ./      CMP      r7,#1
        0x08002e9c:    da00        ..      BGE      0x8002ea0 ; _printf_core + 1276
        0x08002e9e:    2701        .'      MOVS     r7,#1
        0x08002ea0:    2100        .!      MOVS     r1,#0
        0x08002ea2:    2f11        ./      CMP      r7,#0x11
        0x08002ea4:    dd01        ..      BLE      0x8002eaa ; _printf_core + 1286
        0x08002ea6:    2011        .       MOVS     r0,#0x11
        0x08002ea8:    e000        ..      B        0x8002eac ; _printf_core + 1288
        0x08002eaa:    4638        8F      MOV      r0,r7
        0x08002eac:    e9cd0100    ....    STRD     r0,r1,[sp,#0]
        0x08002eb0:    a904        ..      ADD      r1,sp,#0x10
        0x08002eb2:    a80c        ..      ADD      r0,sp,#0x30
        0x08002eb4:    f7fffcb4    ....    BL       _fp_digits ; 0x8002820
        0x08002eb8:    e9dd010d    ....    LDRD     r0,r1,[sp,#0x34]
        0x08002ebc:    9a0c        ..      LDR      r2,[sp,#0x30]
        0x08002ebe:    9100        ..      STR      r1,[sp,#0]
        0x08002ec0:    f04f0b00    O...    MOV      r11,#0
        0x08002ec4:    46b9        .F      MOV      r9,r7
        0x08002ec6:    9210        ..      STR      r2,[sp,#0x40]
        0x08002ec8:    0721        !.      LSLS     r1,r4,#28
        0x08002eca:    d40f        ..      BMI      0x8002eec ; _printf_core + 1352
        0x08002ecc:    9a00        ..      LDR      r2,[sp,#0]
        0x08002ece:    454a        JE      CMP      r2,r9
        0x08002ed0:    da03        ..      BGE      0x8002eda ; _printf_core + 1334
        0x08002ed2:    4691        .F      MOV      r9,r2
        0x08002ed4:    e001        ..      B        0x8002eda ; _printf_core + 1334
        0x08002ed6:    f1a90901    ....    SUB      r9,r9,#1
        0x08002eda:    f1b90f01    ....    CMP      r9,#1
        0x08002ede:    dd05        ..      BLE      0x8002eec ; _printf_core + 1352
        0x08002ee0:    9a10        ..      LDR      r2,[sp,#0x40]
        0x08002ee2:    f1a90101    ....    SUB      r1,r9,#1
        0x08002ee6:    5c51        Q\      LDRB     r1,[r2,r1]
        0x08002ee8:    2930        0)      CMP      r1,#0x30
        0x08002eea:    d0f4        ..      BEQ      0x8002ed6 ; _printf_core + 1330
        0x08002eec:    42b8        .B      CMP      r0,r7
        0x08002eee:    da02        ..      BGE      0x8002ef6 ; _printf_core + 1362
        0x08002ef0:    f1100f04    ....    CMN      r0,#4
        0x08002ef4:    da03        ..      BGE      0x8002efe ; _printf_core + 1370
        0x08002ef6:    2101        .!      MOVS     r1,#1
        0x08002ef8:    e9cd1001    ....    STRD     r1,r0,[sp,#4]
        0x08002efc:    e010        ..      B        0x8002f20 ; _printf_core + 1404
        0x08002efe:    2800        .(      CMP      r0,#0
        0x08002f00:    dc03        ..      BGT      0x8002f0a ; _printf_core + 1382
        0x08002f02:    4483        .D      ADD      r11,r11,r0
        0x08002f04:    eba90100    ....    SUB      r1,r9,r0
        0x08002f08:    e002        ..      B        0x8002f10 ; _printf_core + 1388
        0x08002f0a:    1c41        A.      ADDS     r1,r0,#1
        0x08002f0c:    4549        IE      CMP      r1,r9
        0x08002f0e:    dd00        ..      BLE      0x8002f12 ; _printf_core + 1390
        0x08002f10:    4689        .F      MOV      r9,r1
        0x08002f12:    eba0000b    ....    SUB      r0,r0,r11
        0x08002f16:    1c40        @.      ADDS     r0,r0,#1
        0x08002f18:    9001        ..      STR      r0,[sp,#4]
        0x08002f1a:    f04f4000    O..@    MOV      r0,#0x80000000
        0x08002f1e:    9002        ..      STR      r0,[sp,#8]
        0x08002f20:    0720         .      LSLS     r0,r4,#28
        0x08002f22:    d405        ..      BMI      0x8002f30 ; _printf_core + 1420
        0x08002f24:    9801        ..      LDR      r0,[sp,#4]
        0x08002f26:    4548        HE      CMP      r0,r9
        0x08002f28:    db02        ..      BLT      0x8002f30 ; _printf_core + 1420
        0x08002f2a:    f04f30ff    O..0    MOV      r0,#0xffffffff
        0x08002f2e:    9001        ..      STR      r0,[sp,#4]
        0x08002f30:    2000        .       MOVS     r0,#0
        0x08002f32:    f88d004b    ..K.    STRB     r0,[sp,#0x4b]
        0x08002f36:    9802        ..      LDR      r0,[sp,#8]
        0x08002f38:    f10d074b    ..K.    ADD      r7,sp,#0x4b
        0x08002f3c:    f1b04f00    ...O    CMP      r0,#0x80000000
        0x08002f40:    d025        %.      BEQ      0x8002f8e ; _printf_core + 1514
        0x08002f42:    2002        .       MOVS     r0,#2
        0x08002f44:    900c        ..      STR      r0,[sp,#0x30]
        0x08002f46:    202b        +       MOVS     r0,#0x2b
        0x08002f48:    900d        ..      STR      r0,[sp,#0x34]
        0x08002f4a:    9802        ..      LDR      r0,[sp,#8]
        0x08002f4c:    2800        .(      CMP      r0,#0
        0x08002f4e:    da0c        ..      BGE      0x8002f6a ; _printf_core + 1478
        0x08002f50:    4240        @B      RSBS     r0,r0,#0
        0x08002f52:    9002        ..      STR      r0,[sp,#8]
        0x08002f54:    202d        -       MOVS     r0,#0x2d
        0x08002f56:    900d        ..      STR      r0,[sp,#0x34]
        0x08002f58:    e007        ..      B        0x8002f6a ; _printf_core + 1478
        0x08002f5a:    210a        .!      MOVS     r1,#0xa
        0x08002f5c:    9802        ..      LDR      r0,[sp,#8]
        0x08002f5e:    f7fdf9a4    ....    BL       __aeabi_uidiv ; 0x80002aa
        0x08002f62:    3130        01      ADDS     r1,r1,#0x30
        0x08002f64:    9002        ..      STR      r0,[sp,#8]
        0x08002f66:    f8071d01    ....    STRB     r1,[r7,#-1]!
        0x08002f6a:    990c        ..      LDR      r1,[sp,#0x30]
        0x08002f6c:    1e48        H.      SUBS     r0,r1,#1
        0x08002f6e:    900c        ..      STR      r0,[sp,#0x30]
        0x08002f70:    2900        .)      CMP      r1,#0
        0x08002f72:    dcf2        ..      BGT      0x8002f5a ; _printf_core + 1462
        0x08002f74:    9802        ..      LDR      r0,[sp,#8]
        0x08002f76:    2800        .(      CMP      r0,#0
        0x08002f78:    d1ef        ..      BNE      0x8002f5a ; _printf_core + 1462
        0x08002f7a:    1e79        y.      SUBS     r1,r7,#1
        0x08002f7c:    980d        ..      LDR      r0,[sp,#0x34]
        0x08002f7e:    7008        .p      STRB     r0,[r1,#0]
        0x08002f80:    7830        0x      LDRB     r0,[r6,#0]
        0x08002f82:    f0000020    .. .    AND      r0,r0,#0x20
        0x08002f86:    f0400045    @.E.    ORR      r0,r0,#0x45
        0x08002f8a:    f8070d02    ....    STRB     r0,[r7,#-2]!
        0x08002f8e:    a811        ..      ADD      r0,sp,#0x44
        0x08002f90:    1bc0        ..      SUBS     r0,r0,r7
        0x08002f92:    1dc0        ..      ADDS     r0,r0,#7
        0x08002f94:    9002        ..      STR      r0,[sp,#8]
        0x08002f96:    9813        ..      LDR      r0,[sp,#0x4c]
        0x08002f98:    7800        .x      LDRB     r0,[r0,#0]
        0x08002f9a:    b100        ..      CBZ      r0,0x8002f9e ; _printf_core + 1530
        0x08002f9c:    2001        .       MOVS     r0,#1
        0x08002f9e:    eb000109    ....    ADD      r1,r0,r9
        0x08002fa2:    9801        ..      LDR      r0,[sp,#4]
        0x08002fa4:    eb0171e0    ...q    ADD      r1,r1,r0,ASR #31
        0x08002fa8:    9802        ..      LDR      r0,[sp,#8]
        0x08002faa:    4401        .D      ADD      r1,r1,r0
        0x08002fac:    9803        ..      LDR      r0,[sp,#0xc]
        0x08002fae:    1a40        @.      SUBS     r0,r0,r1
        0x08002fb0:    1e40        @.      SUBS     r0,r0,#1
        0x08002fb2:    9003        ..      STR      r0,[sp,#0xc]
        0x08002fb4:    03e0        ..      LSLS     r0,r4,#15
        0x08002fb6:    d406        ..      BMI      0x8002fc6 ; _printf_core + 1570
        0x08002fb8:    4653        SF      MOV      r3,r10
        0x08002fba:    4621        !F      MOV      r1,r4
        0x08002fbc:    9a17        ..      LDR      r2,[sp,#0x5c]
        0x08002fbe:    9803        ..      LDR      r0,[sp,#0xc]
        0x08002fc0:    f000f85c    ..\.    BL       _printf_pre_padding ; 0x800307c
        0x08002fc4:    4405        .D      ADD      r5,r5,r0
        0x08002fc6:    9813        ..      LDR      r0,[sp,#0x4c]
        0x08002fc8:    7800        .x      LDRB     r0,[r0,#0]
        0x08002fca:    b118        ..      CBZ      r0,0x8002fd4 ; _printf_core + 1584
        0x08002fcc:    4652        RF      MOV      r2,r10
        0x08002fce:    9917        ..      LDR      r1,[sp,#0x5c]
        0x08002fd0:    4790        .G      BLX      r2
        0x08002fd2:    1c6d        m.      ADDS     r5,r5,#1
        0x08002fd4:    03e0        ..      LSLS     r0,r4,#15
        0x08002fd6:    d523        #.      BPL      0x8003020 ; _printf_core + 1660
        0x08002fd8:    4653        SF      MOV      r3,r10
        0x08002fda:    4621        !F      MOV      r1,r4
        0x08002fdc:    9a17        ..      LDR      r2,[sp,#0x5c]
        0x08002fde:    9803        ..      LDR      r0,[sp,#0xc]
        0x08002fe0:    f000f84c    ..L.    BL       _printf_pre_padding ; 0x800307c
        0x08002fe4:    4405        .D      ADD      r5,r5,r0
        0x08002fe6:    e01b        ..      B        0x8003020 ; _printf_core + 1660
        0x08002fe8:    f1bb0f00    ....    CMP      r11,#0
        0x08002fec:    db07        ..      BLT      0x8002ffe ; _printf_core + 1626
        0x08002fee:    9800        ..      LDR      r0,[sp,#0]
        0x08002ff0:    4558        XE      CMP      r0,r11
        0x08002ff2:    dd04        ..      BLE      0x8002ffe ; _printf_core + 1626
        0x08002ff4:    9810        ..      LDR      r0,[sp,#0x40]
        0x08002ff6:    9917        ..      LDR      r1,[sp,#0x5c]
        0x08002ff8:    f810000b    ....    LDRB     r0,[r0,r11]
        0x08002ffc:    e001        ..      B        0x8003002 ; _printf_core + 1630
        0x08002ffe:    9917        ..      LDR      r1,[sp,#0x5c]
        0x08003000:    2030        0       MOVS     r0,#0x30
        0x08003002:    4652        RF      MOV      r2,r10
        0x08003004:    4790        .G      BLX      r2
        0x08003006:    9801        ..      LDR      r0,[sp,#4]
        0x08003008:    f10b0b01    ....    ADD      r11,r11,#1
        0x0800300c:    1e40        @.      SUBS     r0,r0,#1
        0x0800300e:    f1050501    ....    ADD      r5,r5,#1
        0x08003012:    9001        ..      STR      r0,[sp,#4]
        0x08003014:    d104        ..      BNE      0x8003020 ; _printf_core + 1660
        0x08003016:    202e        .       MOVS     r0,#0x2e
        0x08003018:    4652        RF      MOV      r2,r10
        0x0800301a:    9917        ..      LDR      r1,[sp,#0x5c]
        0x0800301c:    4790        .G      BLX      r2
        0x0800301e:    1c6d        m.      ADDS     r5,r5,#1
        0x08003020:    f1b90100    ....    SUBS     r1,r9,#0
        0x08003024:    f1a90901    ....    SUB      r9,r9,#1
        0x08003028:    dcde        ..      BGT      0x8002fe8 ; _printf_core + 1604
        0x0800302a:    e005        ..      B        0x8003038 ; _printf_core + 1684
        0x0800302c:    f8170b01    ....    LDRB     r0,[r7],#1
        0x08003030:    4652        RF      MOV      r2,r10
        0x08003032:    9917        ..      LDR      r1,[sp,#0x5c]
        0x08003034:    4790        .G      BLX      r2
        0x08003036:    1c6d        m.      ADDS     r5,r5,#1
        0x08003038:    9902        ..      LDR      r1,[sp,#8]
        0x0800303a:    1e48        H.      SUBS     r0,r1,#1
        0x0800303c:    9002        ..      STR      r0,[sp,#8]
        0x0800303e:    2900        .)      CMP      r1,#0
        0x08003040:    dcf4        ..      BGT      0x800302c ; _printf_core + 1672
        0x08003042:    4653        SF      MOV      r3,r10
        0x08003044:    4621        !F      MOV      r1,r4
        0x08003046:    9a17        ..      LDR      r2,[sp,#0x5c]
        0x08003048:    9803        ..      LDR      r0,[sp,#0xc]
        0x0800304a:    e69e        ..      B        0x8002d8a ; _printf_core + 998
    $d
        0x0800304c:    0000002d    -...    DCD    45
        0x08003050:    0000002b    +...    DCD    43
        0x08003054:    00000020     ...    DCD    32
    $t
    i._printf_post_padding
    _printf_post_padding
        0x08003058:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x0800305c:    4604        .F      MOV      r4,r0
        0x0800305e:    2500        .%      MOVS     r5,#0
        0x08003060:    461e        .F      MOV      r6,r3
        0x08003062:    4617        .F      MOV      r7,r2
        0x08003064:    0488        ..      LSLS     r0,r1,#18
        0x08003066:    d404        ..      BMI      0x8003072 ; _printf_post_padding + 26
        0x08003068:    e005        ..      B        0x8003076 ; _printf_post_padding + 30
        0x0800306a:    4639        9F      MOV      r1,r7
        0x0800306c:    2020                MOVS     r0,#0x20
        0x0800306e:    47b0        .G      BLX      r6
        0x08003070:    1c6d        m.      ADDS     r5,r5,#1
        0x08003072:    1e64        d.      SUBS     r4,r4,#1
        0x08003074:    d5f9        ..      BPL      0x800306a ; _printf_post_padding + 18
        0x08003076:    4628        (F      MOV      r0,r5
        0x08003078:    e8bd81f0    ....    POP      {r4-r8,pc}
    i._printf_pre_padding
    _printf_pre_padding
        0x0800307c:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08003080:    4604        .F      MOV      r4,r0
        0x08003082:    2500        .%      MOVS     r5,#0
        0x08003084:    461e        .F      MOV      r6,r3
        0x08003086:    4690        .F      MOV      r8,r2
        0x08003088:    03c8        ..      LSLS     r0,r1,#15
        0x0800308a:    d501        ..      BPL      0x8003090 ; _printf_pre_padding + 20
        0x0800308c:    2730        0'      MOVS     r7,#0x30
        0x0800308e:    e000        ..      B        0x8003092 ; _printf_pre_padding + 22
        0x08003090:    2720         '      MOVS     r7,#0x20
        0x08003092:    0488        ..      LSLS     r0,r1,#18
        0x08003094:    d504        ..      BPL      0x80030a0 ; _printf_pre_padding + 36
        0x08003096:    e005        ..      B        0x80030a4 ; _printf_pre_padding + 40
        0x08003098:    4641        AF      MOV      r1,r8
        0x0800309a:    4638        8F      MOV      r0,r7
        0x0800309c:    47b0        .G      BLX      r6
        0x0800309e:    1c6d        m.      ADDS     r5,r5,#1
        0x080030a0:    1e64        d.      SUBS     r4,r4,#1
        0x080030a2:    d5f9        ..      BPL      0x8003098 ; _printf_pre_padding + 28
        0x080030a4:    4628        (F      MOV      r0,r5
        0x080030a6:    e8bd81f0    ....    POP      {r4-r8,pc}
    i._snputc
    _snputc
        0x080030aa:    684a        Jh      LDR      r2,[r1,#4]
        0x080030ac:    2a00        .*      CMP      r2,#0
        0x080030ae:    d006        ..      BEQ      0x80030be ; _snputc + 20
        0x080030b0:    680a        .h      LDR      r2,[r1,#0]
        0x080030b2:    1c53        S.      ADDS     r3,r2,#1
        0x080030b4:    600b        .`      STR      r3,[r1,#0]
        0x080030b6:    7010        .p      STRB     r0,[r2,#0]
        0x080030b8:    6848        Hh      LDR      r0,[r1,#4]
        0x080030ba:    1e40        @.      SUBS     r0,r0,#1
        0x080030bc:    6048        H`      STR      r0,[r1,#4]
        0x080030be:    4770        pG      BX       lr
    i.fputc
    fputc
        0x080030c0:    4903        .I      LDR      r1,[pc,#12] ; [0x80030d0] = 0x20000a5c
        0x080030c2:    6809        .h      LDR      r1,[r1,#0]
        0x080030c4:    680a        .h      LDR      r2,[r1,#0]
        0x080030c6:    0652        R.      LSLS     r2,r2,#25
        0x080030c8:    d5fc        ..      BPL      0x80030c4 ; fputc + 4
        0x080030ca:    b2c2        ..      UXTB     r2,r0
        0x080030cc:    604a        J`      STR      r2,[r1,#4]
        0x080030ce:    4770        pG      BX       lr
    $d
        0x080030d0:    20000a5c    \..     DCD    536873564
    $t
    i.main
    main
        0x080030d4:    b508        ..      PUSH     {r3,lr}
        0x080030d6:    f7fef917    ....    BL       HAL_Init ; 0x8001308
        0x080030da:    f7feff8d    ....    BL       SystemClock_Config ; 0x8001ff8
        0x080030de:    f44f707a    O.zp    MOV      r0,#0x3e8
        0x080030e2:    f7fdff63    ..c.    BL       HAL_Delay ; 0x8000fac
        0x080030e6:    f7feff21    ..!.    BL       LED_Driver_Init ; 0x8001f2c
        0x080030ea:    f7fefef6    ....    BL       LED_Driver_Check ; 0x8001eda
        0x080030ee:    f7fdfce1    ....    BL       DMA_UART_Debug_Driver_Init ; 0x8000ab4
        0x080030f2:    a028        (.      ADR      r0,{pc}+0xa2 ; 0x8003194
        0x080030f4:    f7fdfbbe    ....    BL       DMA_Sprintf ; 0x8000874
        0x080030f8:    f7fff80a    ....    BL       UART3_DMA_Driver_Init ; 0x8002110
        0x080030fc:    a030        0.      ADR      r0,{pc}+0xc4 ; 0x80031c0
        0x080030fe:    2103        .!      MOVS     r1,#3
        0x08003100:    6800        .h      LDR      r0,[r0,#0]
        0x08003102:    9000        ..      STR      r0,[sp,#0]
