tangbaishu/Personal/MDK-ARM/Out/STM32F407ZGT6_Embedded_V1.asm
        0x08003104:    4668        hF      MOV      r0,sp
        0x08003106:    f7fff8a1    ....    BL       UART3_Send_Hex_Data ; 0x800224c
        0x0800310a:    f06f5280    o..R    MVN      r2,#0x10000000
        0x0800310e:    2132        2!      MOVS     r1,#0x32
        0x08003110:    482c        ,H      LDR      r0,[pc,#176] ; [0x80031c4] = 0x20000c6c
        0x08003112:    f7fff88b    ....    BL       UART3_Receive_Data_Wait ; 0x800222c
        0x08003116:    a02c        ,.      ADR      r0,{pc}+0xb2 ; 0x80031c8
        0x08003118:    f7fffb38    ..8.    BL       __0printf ; 0x800278c
        0x0800311c:    27fe        .'      MOVS     r7,#0xfe
        0x0800311e:    f8df80c0    ....    LDR      r8,[pc,#192] ; [0x80031e0] = 0x40002c00
        0x08003122:    f8df90c0    ....    LDR      r9,[pc,#192] ; [0x80031e4] = 0x20000014
        0x08003126:    f8dfb0c0    ....    LDR      r11,[pc,#192] ; [0x80031e8] = 0x40003000
        0x0800312a:    4d30        0M      LDR      r5,[pc,#192] ; [0x80031ec] = 0x20000a50
        0x0800312c:    4c25        %L      LDR      r4,[pc,#148] ; [0x80031c4] = 0x20000c6c
        0x0800312e:    f64a2aaa    J..*    MOV      r10,#0xaaaa
        0x08003132:    2600        .&      MOVS     r6,#0
        0x08003134:    f8c87000    ...p    STR      r7,[r8,#0]
        0x08003138:    f8896000    ...`    STRB     r6,[r9,#0]
        0x0800313c:    f8cba000    ....    STR      r10,[r11,#0]
        0x08003140:    7828        (x      LDRB     r0,[r5,#0]
        0x08003142:    b120         .      CBZ      r0,0x800314e ; main + 122
        0x08003144:    702e        .p      STRB     r6,[r5,#0]
        0x08003146:    7a69        iz      LDRB     r1,[r5,#9]
        0x08003148:    6868        hh      LDR      r0,[r5,#4]
        0x0800314a:    f7fdfc5b    ..[.    BL       DMA_Sprintf_String ; 0x8000a04
        0x0800314e:    f8940066    ..f.    LDRB     r0,[r4,#0x66]
        0x08003152:    2801        .(      CMP      r0,#1
        0x08003154:    d10e        ..      BNE      0x8003174 ; main + 160
        0x08003156:    a026        &.      ADR      r0,{pc}+0x9a ; 0x80031f0
        0x08003158:    f7fffb18    ....    BL       __0printf ; 0x800278c
        0x0800315c:    f8846066    ..f`    STRB     r6,[r4,#0x66]
        0x08003160:    f8141f64    ..d.    LDRB     r1,[r4,#0x64]!
        0x08003164:    4817        .H      LDR      r0,[pc,#92] ; [0x80031c4] = 0x20000c6c
        0x08003166:    f7fdfc4d    ..M.    BL       DMA_Sprintf_String ; 0x8000a04
        0x0800316a:    f8141964    ..d.    LDRB     r1,[r4],#-0x64
        0x0800316e:    4815        .H      LDR      r0,[pc,#84] ; [0x80031c4] = 0x20000c6c
        0x08003170:    f7fff86c    ..l.    BL       UART3_Send_Hex_Data ; 0x800224c
        0x08003174:    6ea0        .n      LDR      r0,[r4,#0x68]
        0x08003176:    2800        .(      CMP      r0,#0
        0x08003178:    d0dc        ..      BEQ      0x8003134 ; main + 96
        0x0800317a:    6ee0        .n      LDR      r0,[r4,#0x6c]
        0x0800317c:    2800        .(      CMP      r0,#0
        0x0800317e:    d0d9        ..      BEQ      0x8003134 ; main + 96
        0x08003180:    f44f70fa    O..p    MOV      r0,#0x1f4
        0x08003184:    f7fdff12    ....    BL       HAL_Delay ; 0x8000fac
        0x08003188:    e9d4121a    ....    LDRD     r1,r2,[r4,#0x68]
        0x0800318c:    a01d        ..      ADR      r0,{pc}+0x78 ; 0x8003204
        0x0800318e:    f7fffafd    ....    BL       __0printf ; 0x800278c
        0x08003192:    e7cf        ..      B        0x8003134 ; main + 96
    $d
        0x08003194:    544f4f42    BOOT    DCD    1414483778
        0x08003198:    54532009    . ST    DCD    1414733833
        0x0800319c:    4632334d    M32F    DCD    1177695053
        0x080031a0:    5a373034    407Z    DCD    1513566260
        0x080031a4:    5f365447    GT6_    DCD    1597396039
        0x080031a8:    65626d45    Embe    DCD    1700949317
        0x080031ac:    64656464    dded    DCD    1684366436
        0x080031b0:    696e495f    _Ini    DCD    1768835423
        0x080031b4:    75535f74    t_Su    DCD    1968398196
        0x080031b8:    73656363    cces    DCD    1936024419
        0x080031bc:    000a0d73    s...    DCD    658803
        0x080031c0:    00342312    .#4.    DCD    3416850
        0x080031c4:    20000c6c    l..     DCD    536874092
        0x080031c8:    54524155    UART    DCD    1414676821
        0x080031cc:    65525f33    3_Re    DCD    1699897139
        0x080031d0:    76696563    ceiv    DCD    1986618723
        0x080031d4:    6e69465f    _Fin    DCD    1852393055
        0x080031d8:    0d687369    ish.    DCD    224949097
        0x080031dc:    0000000a    ....    DCD    10
        0x080031e0:    40002c00    .,.@    DCD    1073753088
        0x080031e4:    20000014    ...     DCD    536870932
        0x080031e8:    40003000    .0.@    DCD    1073754112
        0x080031ec:    20000a50    P..     DCD    536873552
        0x080031f0:    54524155    UART    DCD    1414676821
        0x080031f4:    65525f33    3_Re    DCD    1699897139
        0x080031f8:    76696563    ceiv    DCD    1986618723
        0x080031fc:    7461445f    _Dat    DCD    1952531551
        0x08003200:    000a0d61    a...    DCD    658785
        0x08003204:    74736574    test    DCD    1953719668
        0x08003208:    3d20315f    _1 =    DCD    1025519967
        0x0800320c:    2c642520     %d,    DCD    744760608
        0x08003210:    73657420     tes    DCD    1936028704
        0x08003214:    20325f74    t_2     DCD    540172148
        0x08003218:    6425203d    = %d    DCD    1680154685
        0x0800321c:    000a0d20     ...    DCD    658720
    $t
    i.malloc
    malloc
        0x08003220:    b5f0        ..      PUSH     {r4-r7,lr}
        0x08003222:    300b        .0      ADDS     r0,r0,#0xb
        0x08003224:    4d15        .M      LDR      r5,[pc,#84] ; [0x800327c] = 0x2000002c
        0x08003226:    f0200107     ...    BIC      r1,r0,#7
        0x0800322a:    2400        .$      MOVS     r4,#0
        0x0800322c:    4a14        .J      LDR      r2,[pc,#80] ; [0x8003280] = 0x20000028
        0x0800322e:    e00f        ..      B        0x8003250 ; malloc + 48
        0x08003230:    6803        .h      LDR      r3,[r0,#0]
        0x08003232:    428b        .B      CMP      r3,r1
        0x08003234:    d30b        ..      BCC      0x800324e ; malloc + 46
        0x08003236:    428b        .B      CMP      r3,r1
        0x08003238:    d905        ..      BLS      0x8003246 ; malloc + 38
        0x0800323a:    1a5e        ^.      SUBS     r6,r3,r1
        0x0800323c:    1843        C.      ADDS     r3,r0,r1
        0x0800323e:    6847        Gh      LDR      r7,[r0,#4]
        0x08003240:    e9c36700    ...g    STRD     r6,r7,[r3,#0]
        0x08003244:    e000        ..      B        0x8003248 ; malloc + 40
        0x08003246:    6843        Ch      LDR      r3,[r0,#4]
        0x08003248:    6013        .`      STR      r3,[r2,#0]
        0x0800324a:    c002        ..      STM      r0!,{r1}
        0x0800324c:    e004        ..      B        0x8003258 ; malloc + 56
        0x0800324e:    1d02        ..      ADDS     r2,r0,#4
        0x08003250:    6810        .h      LDR      r0,[r2,#0]
        0x08003252:    2800        .(      CMP      r0,#0
        0x08003254:    d1ec        ..      BNE      0x8003230 ; malloc + 16
        0x08003256:    4620         F      MOV      r0,r4
        0x08003258:    2800        .(      CMP      r0,#0
        0x0800325a:    d102        ..      BNE      0x8003262 ; malloc + 66
        0x0800325c:    6828        (h      LDR      r0,[r5,#0]
        0x0800325e:    b108        ..      CBZ      r0,0x8003264 ; malloc + 68
        0x08003260:    2000        .       MOVS     r0,#0
        0x08003262:    bdf0        ..      POP      {r4-r7,pc}
        0x08003264:    4a06        .J      LDR      r2,[pc,#24] ; [0x8003280] = 0x20000028
        0x08003266:    4807        .H      LDR      r0,[pc,#28] ; [0x8003284] = 0x20000ce4
        0x08003268:    6010        .`      STR      r0,[r2,#0]
        0x0800326a:    4a07        .J      LDR      r2,[pc,#28] ; [0x8003288] = 0x20000ee0
        0x0800326c:    1a12        ..      SUBS     r2,r2,r0
        0x0800326e:    f0220207    "...    BIC      r2,r2,#7
        0x08003272:    e9c02400    ...$    STRD     r2,r4,[r0,#0]
        0x08003276:    2001        .       MOVS     r0,#1
        0x08003278:    6028        (`      STR      r0,[r5,#0]
        0x0800327a:    e7d7        ..      B        0x800322c ; malloc + 12
    $d
        0x0800327c:    2000002c    ,..     DCD    536870956
        0x08003280:    20000028    (..     DCD    536870952
        0x08003284:    20000ce4    ...     DCD    536874212
        0x08003288:    20000ee0    ...     DCD    536874720
    $d.realdata
    .constdata
    flagBitshiftOffset
        0x0800328c:    16100600    ....    DCD    370148864
        0x08003290:    16100600    ....    DCD    370148864
    .constdata
    AHBPrescTable
        0x08003294:    00000000    ....    DCD    0
        0x08003298:    00000000    ....    DCD    0
        0x0800329c:    04030201    ....    DCD    67305985
        0x080032a0:    09080706    ....    DCD    151521030
    .constdata
    APBPrescTable
        0x080032a4:    00000000    ....    DCD    0
        0x080032a8:    04030201    ....    DCD    67305985
    Region$$Table$$Base
        0x080032ac:    080032cc    .2..    DCD    134230732
        0x080032b0:    20000000    ...     DCD    536870912
        0x080032b4:    00000030    0...    DCD    48
        0x080032b8:    08002800    .(..    DCD    134227968
        0x080032bc:    080032fc    .2..    DCD    134230780
        0x080032c0:    20000030    0..     DCD    536870960
        0x080032c4:    000012b0    ....    DCD    4784
        0x080032c8:    08002810    .(..    DCD    134227984
    Region$$Table$$Limit

** Section #2 'RW_IRAM1' (SHT_PROGBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 48 bytes (alignment 4)
    Address: 0x20000000


** Section #3 'RW_IRAM1' (SHT_NOBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 4784 bytes (alignment 8)
    Address: 0x20000030


** Section #4 '.debug_abbrev' (SHT_PROGBITS)
    Size   : 1476 bytes


** Section #5 '.debug_frame' (SHT_PROGBITS)
    Size   : 4484 bytes


** Section #6 '.debug_info' (SHT_PROGBITS)
    Size   : 78840 bytes


** Section #7 '.debug_line' (SHT_PROGBITS)
    Size   : 24348 bytes


** Section #8 '.debug_loc' (SHT_PROGBITS)
    Size   : 6748 bytes


** Section #9 '.debug_macinfo' (SHT_PROGBITS)
    Size   : 748088 bytes


** Section #10 '.debug_pubnames' (SHT_PROGBITS)
    Size   : 4166 bytes


** Section #11 '.symtab' (SHT_SYMTAB)
    Size   : 14672 bytes (alignment 4)
    String table #12 '.strtab'
    Last local symbol no. 631


** Section #12 '.strtab' (SHT_STRTAB)
    Size   : 21036 bytes


** Section #13 '.note' (SHT_NOTE)
    Size   : 28 bytes (alignment 4)


** Section #14 '.comment' (SHT_PROGBITS)
    Size   : 255276 bytes


** Section #15 '.shstrtab' (SHT_STRTAB)
    Size   : 164 bytes


